#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_JailBot

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_JailBot.ABP_JailBot_C.AnimBlueprintGeneratedConstantData
// 0x0517 (0x0518 - 0x0001)
struct ABP_JailBot::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_130;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMirrorDataTable*                       __MirrorDataTable_131;                             // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_132;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_133;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_134;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_135;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_136;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_137;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_138;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_139;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_140;                                // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_141;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_142;                              // 0x0050(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_143;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_144;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_145;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_146;                                // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_147;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_148;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_149;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_150;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_151;                              // 0x00A0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0140(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mirror;                              // 0x0188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;                  // 0x01B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x01E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x0218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x02A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                       // 0x02D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x0308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x0338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x0368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x0398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x03C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x03F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0488(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                              // 0x04B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x04E8(0x0030)()
};
static_assert(alignof(ABP_JailBot::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_JailBot::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_JailBot::FAnimBlueprintGeneratedConstantData) == 0x000518, "Wrong size on ABP_JailBot::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __NameProperty_130) == 0x000004, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__NameProperty_130' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __MirrorDataTable_131) == 0x000010, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__MirrorDataTable_131' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __NameProperty_132) == 0x000018, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__NameProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __IntProperty_133) == 0x000020, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__IntProperty_133' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __NameProperty_134) == 0x000024, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__NameProperty_134' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __IntProperty_135) == 0x00002C, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__IntProperty_135' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __NameProperty_136) == 0x000030, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__NameProperty_136' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __IntProperty_137) == 0x000038, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__IntProperty_137' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __NameProperty_138) == 0x00003C, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__NameProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __IntProperty_139) == 0x000044, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__IntProperty_139' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __BoolProperty_140) == 0x000048, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__BoolProperty_140' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __FloatProperty_141) == 0x00004C, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__FloatProperty_141' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __StructProperty_142) == 0x000050, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__StructProperty_142' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __FloatProperty_143) == 0x00007C, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__FloatProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __BoolProperty_144) == 0x000080, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__BoolProperty_144' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __EnumProperty_145) == 0x000081, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__EnumProperty_145' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __ByteProperty_146) == 0x000082, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__ByteProperty_146' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __NameProperty_147) == 0x000084, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__NameProperty_147' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __NameProperty_148) == 0x00008C, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__NameProperty_148' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __NameProperty_149) == 0x000094, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__NameProperty_149' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __IntProperty_150) == 0x00009C, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__IntProperty_150' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, __StructProperty_151) == 0x0000A0, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::__StructProperty_151' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C0, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000140, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000158, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Mirror) == 0x000188, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Mirror' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x0001B8, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x0001E8, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000218, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000248, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000278, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x0002A8, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x0002D8, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000308, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000338, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000368, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000398, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0003C8, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0003F8, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000428, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000458, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000488, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x0004B8, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x0004E8, "Member 'ABP_JailBot::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");

// ScriptStruct ABP_JailBot.ABP_JailBot_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_JailBot::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JailBot::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_JailBot::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_JailBot::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_JailBot::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_JailBot::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_JailBot::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

