#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Rasmus

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Rasmus.ABP_Rasmus_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Rasmus_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Rasmus_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Rasmus_C_AnimGraph");
static_assert(sizeof(ABP_Rasmus_C_AnimGraph) == 0x000010, "Wrong size on ABP_Rasmus_C_AnimGraph");
static_assert(offsetof(ABP_Rasmus_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Rasmus_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Rasmus.ABP_Rasmus_C.ExecuteUbergraph_ABP_Rasmus
// 0x0004 (0x0004 - 0x0000)
struct ABP_Rasmus_C_ExecuteUbergraph_ABP_Rasmus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Rasmus_C_ExecuteUbergraph_ABP_Rasmus) == 0x000004, "Wrong alignment on ABP_Rasmus_C_ExecuteUbergraph_ABP_Rasmus");
static_assert(sizeof(ABP_Rasmus_C_ExecuteUbergraph_ABP_Rasmus) == 0x000004, "Wrong size on ABP_Rasmus_C_ExecuteUbergraph_ABP_Rasmus");
static_assert(offsetof(ABP_Rasmus_C_ExecuteUbergraph_ABP_Rasmus, EntryPoint) == 0x000000, "Member 'ABP_Rasmus_C_ExecuteUbergraph_ABP_Rasmus::EntryPoint' has a wrong offset!");

}

