#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArrayHelper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ArrayHelper.ArrayHelperBPLibrary.ArrayAddRef
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_ArrayAddRef final
{
public:
	TArray<int32>                                 InArrayA;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InItem;                                            // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutResult;                                         // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_ArrayAddRef) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ArrayAddRef");
static_assert(sizeof(ArrayHelperBPLibrary_ArrayAddRef) == 0x000018, "Wrong size on ArrayHelperBPLibrary_ArrayAddRef");
static_assert(offsetof(ArrayHelperBPLibrary_ArrayAddRef, InArrayA) == 0x000000, "Member 'ArrayHelperBPLibrary_ArrayAddRef::InArrayA' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ArrayAddRef, InItem) == 0x000010, "Member 'ArrayHelperBPLibrary_ArrayAddRef::InItem' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ArrayAddRef, OutResult) == 0x000014, "Member 'ArrayHelperBPLibrary_ArrayAddRef::OutResult' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ArrayDivideRef
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_ArrayDivideRef final
{
public:
	TArray<int32>                                 InArrayA;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InItem;                                            // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutResult;                                         // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_ArrayDivideRef) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ArrayDivideRef");
static_assert(sizeof(ArrayHelperBPLibrary_ArrayDivideRef) == 0x000018, "Wrong size on ArrayHelperBPLibrary_ArrayDivideRef");
static_assert(offsetof(ArrayHelperBPLibrary_ArrayDivideRef, InArrayA) == 0x000000, "Member 'ArrayHelperBPLibrary_ArrayDivideRef::InArrayA' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ArrayDivideRef, InItem) == 0x000010, "Member 'ArrayHelperBPLibrary_ArrayDivideRef::InItem' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ArrayDivideRef, OutResult) == 0x000014, "Member 'ArrayHelperBPLibrary_ArrayDivideRef::OutResult' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ArrayMultiplyRef
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_ArrayMultiplyRef final
{
public:
	TArray<int32>                                 InArrayA;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InItem;                                            // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutResult;                                         // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_ArrayMultiplyRef) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ArrayMultiplyRef");
static_assert(sizeof(ArrayHelperBPLibrary_ArrayMultiplyRef) == 0x000018, "Wrong size on ArrayHelperBPLibrary_ArrayMultiplyRef");
static_assert(offsetof(ArrayHelperBPLibrary_ArrayMultiplyRef, InArrayA) == 0x000000, "Member 'ArrayHelperBPLibrary_ArrayMultiplyRef::InArrayA' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ArrayMultiplyRef, InItem) == 0x000010, "Member 'ArrayHelperBPLibrary_ArrayMultiplyRef::InItem' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ArrayMultiplyRef, OutResult) == 0x000014, "Member 'ArrayHelperBPLibrary_ArrayMultiplyRef::OutResult' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ArraySubtractRef
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_ArraySubtractRef final
{
public:
	TArray<int32>                                 InArrayA;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InItem;                                            // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutResult;                                         // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_ArraySubtractRef) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ArraySubtractRef");
static_assert(sizeof(ArrayHelperBPLibrary_ArraySubtractRef) == 0x000018, "Wrong size on ArrayHelperBPLibrary_ArraySubtractRef");
static_assert(offsetof(ArrayHelperBPLibrary_ArraySubtractRef, InArrayA) == 0x000000, "Member 'ArrayHelperBPLibrary_ArraySubtractRef::InArrayA' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ArraySubtractRef, InItem) == 0x000010, "Member 'ArrayHelperBPLibrary_ArraySubtractRef::InItem' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ArraySubtractRef, OutResult) == 0x000014, "Member 'ArrayHelperBPLibrary_ArraySubtractRef::OutResult' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.AverageByte
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_AverageByte final
{
public:
	TArray<uint8>                                 Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_AverageByte) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_AverageByte");
static_assert(sizeof(ArrayHelperBPLibrary_AverageByte) == 0x000018, "Wrong size on ArrayHelperBPLibrary_AverageByte");
static_assert(offsetof(ArrayHelperBPLibrary_AverageByte, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_AverageByte::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_AverageByte, ReturnValue) == 0x000010, "Member 'ArrayHelperBPLibrary_AverageByte::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.AverageFloat
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_AverageFloat final
{
public:
	TArray<float>                                 Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_AverageFloat) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_AverageFloat");
static_assert(sizeof(ArrayHelperBPLibrary_AverageFloat) == 0x000018, "Wrong size on ArrayHelperBPLibrary_AverageFloat");
static_assert(offsetof(ArrayHelperBPLibrary_AverageFloat, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_AverageFloat::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_AverageFloat, ReturnValue) == 0x000010, "Member 'ArrayHelperBPLibrary_AverageFloat::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.AverageInteger
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_AverageInteger final
{
public:
	TArray<int32>                                 Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_AverageInteger) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_AverageInteger");
static_assert(sizeof(ArrayHelperBPLibrary_AverageInteger) == 0x000018, "Wrong size on ArrayHelperBPLibrary_AverageInteger");
static_assert(offsetof(ArrayHelperBPLibrary_AverageInteger, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_AverageInteger::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_AverageInteger, ReturnValue) == 0x000010, "Member 'ArrayHelperBPLibrary_AverageInteger::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.AverageInteger64
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_AverageInteger64 final
{
public:
	TArray<int64>                                 Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_AverageInteger64) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_AverageInteger64");
static_assert(sizeof(ArrayHelperBPLibrary_AverageInteger64) == 0x000018, "Wrong size on ArrayHelperBPLibrary_AverageInteger64");
static_assert(offsetof(ArrayHelperBPLibrary_AverageInteger64, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_AverageInteger64::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_AverageInteger64, ReturnValue) == 0x000010, "Member 'ArrayHelperBPLibrary_AverageInteger64::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.BreakTransformArray
// 0x0040 (0x0040 - 0x0000)
struct ArrayHelperBPLibrary_BreakTransformArray final
{
public:
	TArray<struct FTransform>                     InTransforms;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        OutLocations;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRotator>                       OutRotators;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        OutScales;                                         // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_BreakTransformArray) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_BreakTransformArray");
static_assert(sizeof(ArrayHelperBPLibrary_BreakTransformArray) == 0x000040, "Wrong size on ArrayHelperBPLibrary_BreakTransformArray");
static_assert(offsetof(ArrayHelperBPLibrary_BreakTransformArray, InTransforms) == 0x000000, "Member 'ArrayHelperBPLibrary_BreakTransformArray::InTransforms' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_BreakTransformArray, OutLocations) == 0x000010, "Member 'ArrayHelperBPLibrary_BreakTransformArray::OutLocations' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_BreakTransformArray, OutRotators) == 0x000020, "Member 'ArrayHelperBPLibrary_BreakTransformArray::OutRotators' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_BreakTransformArray, OutScales) == 0x000030, "Member 'ArrayHelperBPLibrary_BreakTransformArray::OutScales' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampByte
// 0x0028 (0x0028 - 0x0000)
struct ArrayHelperBPLibrary_ClampByte final
{
public:
	TArray<uint8>                                 Array;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Min;                                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Max;                                               // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampByte) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampByte");
static_assert(sizeof(ArrayHelperBPLibrary_ClampByte) == 0x000028, "Wrong size on ArrayHelperBPLibrary_ClampByte");
static_assert(offsetof(ArrayHelperBPLibrary_ClampByte, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampByte::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampByte, Min) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampByte::Min' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampByte, Max) == 0x000011, "Member 'ArrayHelperBPLibrary_ClampByte::Max' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampByte, ReturnValue) == 0x000018, "Member 'ArrayHelperBPLibrary_ClampByte::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampByteRef
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_ClampByteRef final
{
public:
	TArray<uint8>                                 Array;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Min;                                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Max;                                               // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_ClampByteRef) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampByteRef");
static_assert(sizeof(ArrayHelperBPLibrary_ClampByteRef) == 0x000018, "Wrong size on ArrayHelperBPLibrary_ClampByteRef");
static_assert(offsetof(ArrayHelperBPLibrary_ClampByteRef, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampByteRef::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampByteRef, Min) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampByteRef::Min' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampByteRef, Max) == 0x000011, "Member 'ArrayHelperBPLibrary_ClampByteRef::Max' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampFloat
// 0x0028 (0x0028 - 0x0000)
struct ArrayHelperBPLibrary_ClampFloat final
{
public:
	TArray<float>                                 Array;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Min;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampFloat) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampFloat");
static_assert(sizeof(ArrayHelperBPLibrary_ClampFloat) == 0x000028, "Wrong size on ArrayHelperBPLibrary_ClampFloat");
static_assert(offsetof(ArrayHelperBPLibrary_ClampFloat, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampFloat::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampFloat, Min) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampFloat::Min' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampFloat, Max) == 0x000014, "Member 'ArrayHelperBPLibrary_ClampFloat::Max' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampFloat, ReturnValue) == 0x000018, "Member 'ArrayHelperBPLibrary_ClampFloat::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampFloatRef
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_ClampFloatRef final
{
public:
	TArray<float>                                 Array;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Min;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampFloatRef) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampFloatRef");
static_assert(sizeof(ArrayHelperBPLibrary_ClampFloatRef) == 0x000018, "Wrong size on ArrayHelperBPLibrary_ClampFloatRef");
static_assert(offsetof(ArrayHelperBPLibrary_ClampFloatRef, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampFloatRef::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampFloatRef, Min) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampFloatRef::Min' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampFloatRef, Max) == 0x000014, "Member 'ArrayHelperBPLibrary_ClampFloatRef::Max' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampInteger
// 0x0028 (0x0028 - 0x0000)
struct ArrayHelperBPLibrary_ClampInteger final
{
public:
	TArray<int32>                                 Array;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Min;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Max;                                               // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampInteger) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampInteger");
static_assert(sizeof(ArrayHelperBPLibrary_ClampInteger) == 0x000028, "Wrong size on ArrayHelperBPLibrary_ClampInteger");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampInteger::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger, Min) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampInteger::Min' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger, Max) == 0x000014, "Member 'ArrayHelperBPLibrary_ClampInteger::Max' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger, ReturnValue) == 0x000018, "Member 'ArrayHelperBPLibrary_ClampInteger::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampInteger64
// 0x0030 (0x0030 - 0x0000)
struct ArrayHelperBPLibrary_ClampInteger64 final
{
public:
	TArray<int64>                                 Array;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int64                                         Min;                                               // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Max;                                               // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampInteger64) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampInteger64");
static_assert(sizeof(ArrayHelperBPLibrary_ClampInteger64) == 0x000030, "Wrong size on ArrayHelperBPLibrary_ClampInteger64");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger64, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampInteger64::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger64, Min) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampInteger64::Min' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger64, Max) == 0x000018, "Member 'ArrayHelperBPLibrary_ClampInteger64::Max' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger64, ReturnValue) == 0x000020, "Member 'ArrayHelperBPLibrary_ClampInteger64::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampInteger64Ref
// 0x0020 (0x0020 - 0x0000)
struct ArrayHelperBPLibrary_ClampInteger64Ref final
{
public:
	TArray<int64>                                 Array;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         Min;                                               // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Max;                                               // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampInteger64Ref) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampInteger64Ref");
static_assert(sizeof(ArrayHelperBPLibrary_ClampInteger64Ref) == 0x000020, "Wrong size on ArrayHelperBPLibrary_ClampInteger64Ref");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger64Ref, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampInteger64Ref::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger64Ref, Min) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampInteger64Ref::Min' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampInteger64Ref, Max) == 0x000018, "Member 'ArrayHelperBPLibrary_ClampInteger64Ref::Max' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampIntegerRef
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_ClampIntegerRef final
{
public:
	TArray<int32>                                 Array;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Min;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Max;                                               // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampIntegerRef) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampIntegerRef");
static_assert(sizeof(ArrayHelperBPLibrary_ClampIntegerRef) == 0x000018, "Wrong size on ArrayHelperBPLibrary_ClampIntegerRef");
static_assert(offsetof(ArrayHelperBPLibrary_ClampIntegerRef, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampIntegerRef::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampIntegerRef, Min) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampIntegerRef::Min' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampIntegerRef, Max) == 0x000014, "Member 'ArrayHelperBPLibrary_ClampIntegerRef::Max' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampVector2DSize
// 0x0028 (0x0028 - 0x0000)
struct ArrayHelperBPLibrary_ClampVector2DSize final
{
public:
	TArray<struct FVector2D>                      InArray;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         InMinSize;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InMaxSize;                                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampVector2DSize) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampVector2DSize");
static_assert(sizeof(ArrayHelperBPLibrary_ClampVector2DSize) == 0x000028, "Wrong size on ArrayHelperBPLibrary_ClampVector2DSize");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVector2DSize, InArray) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampVector2DSize::InArray' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVector2DSize, InMinSize) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampVector2DSize::InMinSize' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVector2DSize, InMaxSize) == 0x000014, "Member 'ArrayHelperBPLibrary_ClampVector2DSize::InMaxSize' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVector2DSize, ReturnValue) == 0x000018, "Member 'ArrayHelperBPLibrary_ClampVector2DSize::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampVector2DSizeRef
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_ClampVector2DSizeRef final
{
public:
	TArray<struct FVector2D>                      InArray;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         InMinSize;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InMaxSize;                                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampVector2DSizeRef) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampVector2DSizeRef");
static_assert(sizeof(ArrayHelperBPLibrary_ClampVector2DSizeRef) == 0x000018, "Wrong size on ArrayHelperBPLibrary_ClampVector2DSizeRef");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVector2DSizeRef, InArray) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampVector2DSizeRef::InArray' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVector2DSizeRef, InMinSize) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampVector2DSizeRef::InMinSize' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVector2DSizeRef, InMaxSize) == 0x000014, "Member 'ArrayHelperBPLibrary_ClampVector2DSizeRef::InMaxSize' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampVectorSize
// 0x0030 (0x0030 - 0x0000)
struct ArrayHelperBPLibrary_ClampVectorSize final
{
public:
	TArray<struct FVector>                        Array;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         MinSize;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSize;                                           // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnly2D;                                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClampVectorSize) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampVectorSize");
static_assert(sizeof(ArrayHelperBPLibrary_ClampVectorSize) == 0x000030, "Wrong size on ArrayHelperBPLibrary_ClampVectorSize");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVectorSize, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampVectorSize::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVectorSize, MinSize) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampVectorSize::MinSize' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVectorSize, MaxSize) == 0x000014, "Member 'ArrayHelperBPLibrary_ClampVectorSize::MaxSize' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVectorSize, bOnly2D) == 0x000018, "Member 'ArrayHelperBPLibrary_ClampVectorSize::bOnly2D' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVectorSize, ReturnValue) == 0x000020, "Member 'ArrayHelperBPLibrary_ClampVectorSize::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClampVectorSizeRef
// 0x0020 (0x0020 - 0x0000)
struct ArrayHelperBPLibrary_ClampVectorSizeRef final
{
public:
	TArray<struct FVector>                        Array;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         MinSize;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSize;                                           // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnly2D;                                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_ClampVectorSizeRef) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClampVectorSizeRef");
static_assert(sizeof(ArrayHelperBPLibrary_ClampVectorSizeRef) == 0x000020, "Wrong size on ArrayHelperBPLibrary_ClampVectorSizeRef");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVectorSizeRef, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClampVectorSizeRef::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVectorSizeRef, MinSize) == 0x000010, "Member 'ArrayHelperBPLibrary_ClampVectorSizeRef::MinSize' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVectorSizeRef, MaxSize) == 0x000014, "Member 'ArrayHelperBPLibrary_ClampVectorSizeRef::MaxSize' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClampVectorSizeRef, bOnly2D) == 0x000018, "Member 'ArrayHelperBPLibrary_ClampVectorSizeRef::bOnly2D' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClosestActor
// 0x0028 (0x0028 - 0x0000)
struct ArrayHelperBPLibrary_ClosestActor final
{
public:
	TArray<class AActor*>                         Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class AActor*                           Origin;                                            // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Closest;                                           // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClosestActor) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClosestActor");
static_assert(sizeof(ArrayHelperBPLibrary_ClosestActor) == 0x000028, "Wrong size on ArrayHelperBPLibrary_ClosestActor");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestActor, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClosestActor::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestActor, Origin) == 0x000010, "Member 'ArrayHelperBPLibrary_ClosestActor::Origin' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestActor, Closest) == 0x000018, "Member 'ArrayHelperBPLibrary_ClosestActor::Closest' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestActor, Distance) == 0x000020, "Member 'ArrayHelperBPLibrary_ClosestActor::Distance' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestActor, Index_0) == 0x000024, "Member 'ArrayHelperBPLibrary_ClosestActor::Index_0' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClosestLocation
// 0x0048 (0x0048 - 0x0000)
struct ArrayHelperBPLibrary_ClosestLocation final
{
public:
	TArray<struct FVector>                        Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                Origin;                                            // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Closest;                                           // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ClosestLocation) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ClosestLocation");
static_assert(sizeof(ArrayHelperBPLibrary_ClosestLocation) == 0x000048, "Wrong size on ArrayHelperBPLibrary_ClosestLocation");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestLocation, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_ClosestLocation::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestLocation, Origin) == 0x000010, "Member 'ArrayHelperBPLibrary_ClosestLocation::Origin' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestLocation, Closest) == 0x000028, "Member 'ArrayHelperBPLibrary_ClosestLocation::Closest' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestLocation, Distance) == 0x000040, "Member 'ArrayHelperBPLibrary_ClosestLocation::Distance' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestLocation, Index_0) == 0x000044, "Member 'ArrayHelperBPLibrary_ClosestLocation::Index_0' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ClosestTransform
// 0x00A0 (0x00A0 - 0x0000)
struct ArrayHelperBPLibrary_ClosestTransform final
{
public:
	TArray<struct FTransform>                     InArray;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                InOrigin;                                          // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OutClosest;                                        // 0x0030(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutDistance;                                       // 0x0090(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0094(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_ClosestTransform) == 0x000010, "Wrong alignment on ArrayHelperBPLibrary_ClosestTransform");
static_assert(sizeof(ArrayHelperBPLibrary_ClosestTransform) == 0x0000A0, "Wrong size on ArrayHelperBPLibrary_ClosestTransform");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestTransform, InArray) == 0x000000, "Member 'ArrayHelperBPLibrary_ClosestTransform::InArray' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestTransform, InOrigin) == 0x000010, "Member 'ArrayHelperBPLibrary_ClosestTransform::InOrigin' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestTransform, OutClosest) == 0x000030, "Member 'ArrayHelperBPLibrary_ClosestTransform::OutClosest' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestTransform, OutDistance) == 0x000090, "Member 'ArrayHelperBPLibrary_ClosestTransform::OutDistance' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ClosestTransform, OutIndex) == 0x000094, "Member 'ArrayHelperBPLibrary_ClosestTransform::OutIndex' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.ExtractArray
// 0x0028 (0x0028 - 0x0000)
struct ArrayHelperBPLibrary_ExtractArray final
{
public:
	TArray<int32>                                 ArrayA;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 ArrayB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         StartIndex;                                        // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndIndex;                                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_ExtractArray) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_ExtractArray");
static_assert(sizeof(ArrayHelperBPLibrary_ExtractArray) == 0x000028, "Wrong size on ArrayHelperBPLibrary_ExtractArray");
static_assert(offsetof(ArrayHelperBPLibrary_ExtractArray, ArrayA) == 0x000000, "Member 'ArrayHelperBPLibrary_ExtractArray::ArrayA' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ExtractArray, ArrayB) == 0x000010, "Member 'ArrayHelperBPLibrary_ExtractArray::ArrayB' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ExtractArray, StartIndex) == 0x000020, "Member 'ArrayHelperBPLibrary_ExtractArray::StartIndex' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_ExtractArray, EndIndex) == 0x000024, "Member 'ArrayHelperBPLibrary_ExtractArray::EndIndex' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.FarthestActor
// 0x0028 (0x0028 - 0x0000)
struct ArrayHelperBPLibrary_FarthestActor final
{
public:
	TArray<class AActor*>                         Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class AActor*                           Origin;                                            // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Farthest;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_FarthestActor) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_FarthestActor");
static_assert(sizeof(ArrayHelperBPLibrary_FarthestActor) == 0x000028, "Wrong size on ArrayHelperBPLibrary_FarthestActor");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestActor, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_FarthestActor::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestActor, Origin) == 0x000010, "Member 'ArrayHelperBPLibrary_FarthestActor::Origin' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestActor, Farthest) == 0x000018, "Member 'ArrayHelperBPLibrary_FarthestActor::Farthest' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestActor, Distance) == 0x000020, "Member 'ArrayHelperBPLibrary_FarthestActor::Distance' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestActor, Index_0) == 0x000024, "Member 'ArrayHelperBPLibrary_FarthestActor::Index_0' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.FarthestLocation
// 0x0048 (0x0048 - 0x0000)
struct ArrayHelperBPLibrary_FarthestLocation final
{
public:
	TArray<struct FVector>                        Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                Origin;                                            // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Farthest;                                          // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_FarthestLocation) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_FarthestLocation");
static_assert(sizeof(ArrayHelperBPLibrary_FarthestLocation) == 0x000048, "Wrong size on ArrayHelperBPLibrary_FarthestLocation");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestLocation, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_FarthestLocation::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestLocation, Origin) == 0x000010, "Member 'ArrayHelperBPLibrary_FarthestLocation::Origin' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestLocation, Farthest) == 0x000028, "Member 'ArrayHelperBPLibrary_FarthestLocation::Farthest' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestLocation, Distance) == 0x000040, "Member 'ArrayHelperBPLibrary_FarthestLocation::Distance' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestLocation, Index_0) == 0x000044, "Member 'ArrayHelperBPLibrary_FarthestLocation::Index_0' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.FarthestTransform
// 0x00A0 (0x00A0 - 0x0000)
struct ArrayHelperBPLibrary_FarthestTransform final
{
public:
	TArray<struct FTransform>                     InArray;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                InOrigin;                                          // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OutFarthest;                                       // 0x0030(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutDistance;                                       // 0x0090(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0094(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_FarthestTransform) == 0x000010, "Wrong alignment on ArrayHelperBPLibrary_FarthestTransform");
static_assert(sizeof(ArrayHelperBPLibrary_FarthestTransform) == 0x0000A0, "Wrong size on ArrayHelperBPLibrary_FarthestTransform");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestTransform, InArray) == 0x000000, "Member 'ArrayHelperBPLibrary_FarthestTransform::InArray' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestTransform, InOrigin) == 0x000010, "Member 'ArrayHelperBPLibrary_FarthestTransform::InOrigin' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestTransform, OutFarthest) == 0x000030, "Member 'ArrayHelperBPLibrary_FarthestTransform::OutFarthest' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestTransform, OutDistance) == 0x000090, "Member 'ArrayHelperBPLibrary_FarthestTransform::OutDistance' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FarthestTransform, OutIndex) == 0x000094, "Member 'ArrayHelperBPLibrary_FarthestTransform::OutIndex' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.FilterMatch
// 0x0038 (0x0038 - 0x0000)
struct ArrayHelperBPLibrary_FilterMatch final
{
public:
	TArray<class FString>                         Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Pattern;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFound;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_FilterMatch) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_FilterMatch");
static_assert(sizeof(ArrayHelperBPLibrary_FilterMatch) == 0x000038, "Wrong size on ArrayHelperBPLibrary_FilterMatch");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatch, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_FilterMatch::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatch, Pattern) == 0x000010, "Member 'ArrayHelperBPLibrary_FilterMatch::Pattern' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatch, bFound) == 0x000020, "Member 'ArrayHelperBPLibrary_FilterMatch::bFound' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatch, Index_0) == 0x000024, "Member 'ArrayHelperBPLibrary_FilterMatch::Index_0' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatch, ReturnValue) == 0x000028, "Member 'ArrayHelperBPLibrary_FilterMatch::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.FilterMatches
// 0x0048 (0x0048 - 0x0000)
struct ArrayHelperBPLibrary_FilterMatches final
{
public:
	TArray<class FString>                         Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Pattern;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFound;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Indexes;                                           // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArrayHelperBPLibrary_FilterMatches) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_FilterMatches");
static_assert(sizeof(ArrayHelperBPLibrary_FilterMatches) == 0x000048, "Wrong size on ArrayHelperBPLibrary_FilterMatches");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatches, Array) == 0x000000, "Member 'ArrayHelperBPLibrary_FilterMatches::Array' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatches, Pattern) == 0x000010, "Member 'ArrayHelperBPLibrary_FilterMatches::Pattern' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatches, bFound) == 0x000020, "Member 'ArrayHelperBPLibrary_FilterMatches::bFound' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatches, Indexes) == 0x000028, "Member 'ArrayHelperBPLibrary_FilterMatches::Indexes' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_FilterMatches, ReturnValue) == 0x000038, "Member 'ArrayHelperBPLibrary_FilterMatches::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.MakeTransformArray
// 0x0048 (0x0048 - 0x0000)
struct ArrayHelperBPLibrary_MakeTransformArray final
{
public:
	TArray<struct FVector>                        InLocations;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FRotator>                       InRotators;                                        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        InScales;                                          // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     OutTransforms;                                     // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArrayHelperBPLibrary_MakeTransformArray) == 0x000008, "Wrong alignment on ArrayHelperBPLibrary_MakeTransformArray");
static_assert(sizeof(ArrayHelperBPLibrary_MakeTransformArray) == 0x000048, "Wrong size on ArrayHelperBPLibrary_MakeTransformArray");
static_assert(offsetof(ArrayHelperBPLibrary_MakeTransformArray, InLocations) == 0x000000, "Member 'ArrayHelperBPLibrary_MakeTransformArray::InLocations' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_MakeTransformArray, InRotators) == 0x000010, "Member 'ArrayHelperBPLibrary_MakeTransformArray::InRotators' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_MakeTransformArray, InScales) == 0x000020, "Member 'ArrayHelperBPLibrary_MakeTransformArray::InScales' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_MakeTransformArray, OutTransforms) == 0x000030, "Member 'ArrayHelperBPLibrary_MakeTransformArray::OutTransforms' has a wrong offset!");
static_assert(offsetof(ArrayHelperBPLibrary_MakeTransformArray, ReturnValue) == 0x000040, "Member 'ArrayHelperBPLibrary_MakeTransformArray::ReturnValue' has a wrong offset!");

// Function ArrayHelper.ArrayHelperBPLibrary.MaximumByteIndex
// 0x0018 (0x0018 - 0x0000)
struct ArrayHelperBPLibrary_MaximumByteIndex final
{
public:
	TArray<uint8>                                 Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
