#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BLP_LevelDesignUtils

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_LevelDesignPivot_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BLP_LevelDesignUtils.BLP_LevelDesignUtils_C.ClearChildren
// 0x0040 (0x0040 - 0x0000)
struct BLP_LevelDesignUtils_C_ClearChildren final
{
public:
	class USceneComponent*                        ParentComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BLP_LevelDesignUtils_C_ClearChildren) == 0x000008, "Wrong alignment on BLP_LevelDesignUtils_C_ClearChildren");
static_assert(sizeof(BLP_LevelDesignUtils_C_ClearChildren) == 0x000040, "Wrong size on BLP_LevelDesignUtils_C_ClearChildren");
static_assert(offsetof(BLP_LevelDesignUtils_C_ClearChildren, ParentComponent) == 0x000000, "Member 'BLP_LevelDesignUtils_C_ClearChildren::ParentComponent' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_ClearChildren, __WorldContext) == 0x000008, "Member 'BLP_LevelDesignUtils_C_ClearChildren::__WorldContext' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_ClearChildren, CallFunc_GetChildrenComponents_Children) == 0x000010, "Member 'BLP_LevelDesignUtils_C_ClearChildren::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_ClearChildren, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BLP_LevelDesignUtils_C_ClearChildren::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_ClearChildren, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BLP_LevelDesignUtils_C_ClearChildren::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_ClearChildren, CallFunc_Array_Get_Item) == 0x000028, "Member 'BLP_LevelDesignUtils_C_ClearChildren::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_ClearChildren, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BLP_LevelDesignUtils_C_ClearChildren::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_ClearChildren, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BLP_LevelDesignUtils_C_ClearChildren::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_ClearChildren, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BLP_LevelDesignUtils_C_ClearChildren::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BLP_LevelDesignUtils.BLP_LevelDesignUtils_C.IncorporateRelativeScale
// 0x0030 (0x0030 - 0x0000)
struct BLP_LevelDesignUtils_C_IncorporateRelativeScale final
{
public:
	double                                        RelativeScale;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DesignDimension;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        OutDimension;                                      // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BLP_LevelDesignUtils_C_IncorporateRelativeScale) == 0x000008, "Wrong alignment on BLP_LevelDesignUtils_C_IncorporateRelativeScale");
static_assert(sizeof(BLP_LevelDesignUtils_C_IncorporateRelativeScale) == 0x000030, "Wrong size on BLP_LevelDesignUtils_C_IncorporateRelativeScale");
static_assert(offsetof(BLP_LevelDesignUtils_C_IncorporateRelativeScale, RelativeScale) == 0x000000, "Member 'BLP_LevelDesignUtils_C_IncorporateRelativeScale::RelativeScale' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_IncorporateRelativeScale, DesignDimension) == 0x000008, "Member 'BLP_LevelDesignUtils_C_IncorporateRelativeScale::DesignDimension' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_IncorporateRelativeScale, __WorldContext) == 0x000010, "Member 'BLP_LevelDesignUtils_C_IncorporateRelativeScale::__WorldContext' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_IncorporateRelativeScale, OutDimension) == 0x000018, "Member 'BLP_LevelDesignUtils_C_IncorporateRelativeScale::OutDimension' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_IncorporateRelativeScale, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'BLP_LevelDesignUtils_C_IncorporateRelativeScale::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_IncorporateRelativeScale, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BLP_LevelDesignUtils_C_IncorporateRelativeScale::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BLP_LevelDesignUtils.BLP_LevelDesignUtils_C.MatchBounds
// 0x01E8 (0x01E8 - 0x0000)
struct BLP_LevelDesignUtils_C_MatchBounds final
{
public:
	class UBoxComponent*                          BoxCollider;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Visualizer;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00F0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BLP_LevelDesignUtils_C_MatchBounds) == 0x000008, "Wrong alignment on BLP_LevelDesignUtils_C_MatchBounds");
static_assert(sizeof(BLP_LevelDesignUtils_C_MatchBounds) == 0x0001E8, "Wrong size on BLP_LevelDesignUtils_C_MatchBounds");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, BoxCollider) == 0x000000, "Member 'BLP_LevelDesignUtils_C_MatchBounds::BoxCollider' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, Visualizer) == 0x000008, "Member 'BLP_LevelDesignUtils_C_MatchBounds::Visualizer' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, __WorldContext) == 0x000010, "Member 'BLP_LevelDesignUtils_C_MatchBounds::__WorldContext' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000018, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_GetLocalBounds_Min) == 0x000030, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_GetLocalBounds_Max) == 0x000048, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000080, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_Divide_VectorVector_ReturnValue) == 0x000088, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x0000A0, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000C0, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000D8, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_MatchBounds, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000F0, "Member 'BLP_LevelDesignUtils_C_MatchBounds::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BLP_LevelDesignUtils.BLP_LevelDesignUtils_C.PivotToTransformScale
// 0x0120 (0x0120 - 0x0000)
struct BLP_LevelDesignUtils_C_PivotToTransformScale final
{
public:
	ENUM_LevelDesignPivot                         Pivot;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TransformScale;                                    // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_LevelDesignPivot                         Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_6;                 // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_7;                 // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_8;                 // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0108(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BLP_LevelDesignUtils_C_PivotToTransformScale) == 0x000008, "Wrong alignment on BLP_LevelDesignUtils_C_PivotToTransformScale");
static_assert(sizeof(BLP_LevelDesignUtils_C_PivotToTransformScale) == 0x000120, "Wrong size on BLP_LevelDesignUtils_C_PivotToTransformScale");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, Pivot) == 0x000000, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::Pivot' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, __WorldContext) == 0x000008, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::__WorldContext' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, TransformScale) == 0x000010, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::TransformScale' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, Temp_byte_Variable) == 0x000028, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, CallFunc_MakeVector_ReturnValue_1) == 0x000048, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, CallFunc_MakeVector_ReturnValue_2) == 0x000060, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, CallFunc_MakeVector_ReturnValue_3) == 0x000078, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, CallFunc_MakeVector_ReturnValue_4) == 0x000090, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, CallFunc_MakeVector_ReturnValue_5) == 0x0000A8, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, CallFunc_MakeVector_ReturnValue_6) == 0x0000C0, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::CallFunc_MakeVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, CallFunc_MakeVector_ReturnValue_7) == 0x0000D8, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::CallFunc_MakeVector_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, CallFunc_MakeVector_ReturnValue_8) == 0x0000F0, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::CallFunc_MakeVector_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_PivotToTransformScale, K2Node_Select_Default) == 0x000108, "Member 'BLP_LevelDesignUtils_C_PivotToTransformScale::K2Node_Select_Default' has a wrong offset!");

// Function BLP_LevelDesignUtils.BLP_LevelDesignUtils_C.RoundToSnap
// 0x0038 (0x0038 - 0x0000)
struct BLP_LevelDesignUtils_C_RoundToSnap final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Rounded;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SnapValue;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BLP_LevelDesignUtils_C_RoundToSnap) == 0x000008, "Wrong alignment on BLP_LevelDesignUtils_C_RoundToSnap");
static_assert(sizeof(BLP_LevelDesignUtils_C_RoundToSnap) == 0x000038, "Wrong size on BLP_LevelDesignUtils_C_RoundToSnap");
static_assert(offsetof(BLP_LevelDesignUtils_C_RoundToSnap, Value) == 0x000000, "Member 'BLP_LevelDesignUtils_C_RoundToSnap::Value' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_RoundToSnap, __WorldContext) == 0x000008, "Member 'BLP_LevelDesignUtils_C_RoundToSnap::__WorldContext' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_RoundToSnap, Rounded) == 0x000010, "Member 'BLP_LevelDesignUtils_C_RoundToSnap::Rounded' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_RoundToSnap, SnapValue) == 0x000014, "Member 'BLP_LevelDesignUtils_C_RoundToSnap::SnapValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_RoundToSnap, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'BLP_LevelDesignUtils_C_RoundToSnap::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_RoundToSnap, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'BLP_LevelDesignUtils_C_RoundToSnap::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_RoundToSnap, CallFunc_FTrunc_ReturnValue) == 0x000028, "Member 'BLP_LevelDesignUtils_C_RoundToSnap::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_RoundToSnap, CallFunc_Multiply_IntInt_ReturnValue) == 0x00002C, "Member 'BLP_LevelDesignUtils_C_RoundToSnap::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_LevelDesignUtils_C_RoundToSnap, CallFunc_Max_ReturnValue) == 0x000030, "Member 'BLP_LevelDesignUtils_C_RoundToSnap::CallFunc_Max_ReturnValue' has a wrong offset!");

}

