#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BLP_CharacterUtils

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BLP_CharacterUtils.BLP_CharacterUtils_C.ShouldMinimapIconBeVisible
// 0x0048 (0x0048 - 0x0000)
struct BLP_CharacterUtils_C_ShouldMinimapIconBeVisible final
{
public:
	class AMatchaSnapNetCharacterEntity*          CharacterEntity;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldBeVisible;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSpectatedTeamNumber_ReturnValue;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOwnerPlayerIndex_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaTeamUIData*                      CallFunc_FindTeamUIDataForTeamNumber_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisguised_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentTeam_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBeRevealedToAllPlayers_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAliveState                                   CallFunc_GetAliveState_ReturnValue;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible) == 0x000008, "Wrong alignment on BLP_CharacterUtils_C_ShouldMinimapIconBeVisible");
static_assert(sizeof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible) == 0x000048, "Wrong size on BLP_CharacterUtils_C_ShouldMinimapIconBeVisible");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CharacterEntity) == 0x000000, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CharacterEntity' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, WorldContextObject) == 0x000008, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::WorldContextObject' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, __WorldContext) == 0x000010, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::__WorldContext' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, ShouldBeVisible) == 0x000018, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::ShouldBeVisible' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_GetUIDataModel_ReturnValue) == 0x000020, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_GetSpectatedTeamNumber_ReturnValue) == 0x000028, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_GetSpectatedTeamNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_GetOwnerPlayerIndex_ReturnValue) == 0x00002C, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_GetOwnerPlayerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_FindTeamUIDataForTeamNumber_ReturnValue) == 0x000030, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_FindTeamUIDataForTeamNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_IsDisguised_ReturnValue) == 0x000038, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_IsDisguised_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_Array_Contains_ReturnValue) == 0x000039, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_GetCurrentTeam_ReturnValue) == 0x00003C, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_GetCurrentTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_ShouldBeRevealedToAllPlayers_ReturnValue) == 0x000040, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_ShouldBeRevealedToAllPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000041, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_GetAliveState_ReturnValue) == 0x000042, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_GetAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_IsValid_ReturnValue_1) == 0x000043, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BLP_CharacterUtils_C_ShouldMinimapIconBeVisible, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000044, "Member 'BLP_CharacterUtils_C_ShouldMinimapIconBeVisible::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

