#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraLethalHitCeremony

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CameraLethalHitCeremony.BP_CameraLethalHitCeremony_C.BlueprintModifyCamera
// 0x0138 (0x0138 - 0x0000)
struct BP_CameraLethalHitCeremony_C_BlueprintModifyCamera final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ViewLocation;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ViewRotation;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         FOV;                                               // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewViewLocation;                                   // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewViewRotation;                                   // 0x0058(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         NewFOV;                                            // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ComputeBaseHeightOffset_HeightOffset;     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_DistanceSquared_ReturnValue;       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ComputeBaseHeightOffset_CameraPitch_ImplicitCast; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera) == 0x000008, "Wrong alignment on BP_CameraLethalHitCeremony_C_BlueprintModifyCamera");
static_assert(sizeof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera) == 0x000138, "Wrong size on BP_CameraLethalHitCeremony_C_BlueprintModifyCamera");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, DeltaTime) == 0x000000, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, ViewLocation) == 0x000008, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::ViewLocation' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, ViewRotation) == 0x000020, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::ViewRotation' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, FOV) == 0x000038, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::FOV' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, NewViewLocation) == 0x000040, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::NewViewLocation' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, NewViewRotation) == 0x000058, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::NewViewRotation' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, NewFOV) == 0x000070, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::NewFOV' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_SelectVector_ReturnValue) == 0x000090, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_BreakRotator_Roll) == 0x0000A8, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_BreakRotator_Pitch) == 0x0000AC, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_BreakRotator_Yaw) == 0x0000B0, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_IsValid_ReturnValue) == 0x0000B4, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_GetCameraLocation_ReturnValue) == 0x0000B8, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_BreakVector_X) == 0x0000D0, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_BreakVector_Y) == 0x0000D8, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_BreakVector_Z) == 0x0000E0, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_ComputeBaseHeightOffset_HeightOffset) == 0x0000E8, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_ComputeBaseHeightOffset_HeightOffset' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_MakeVector_ReturnValue) == 0x0000F0, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000108, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_Vector_DistanceSquared_ReturnValue) == 0x000120, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_Vector_DistanceSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000128, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_BlueprintModifyCamera, CallFunc_ComputeBaseHeightOffset_CameraPitch_ImplicitCast) == 0x000130, "Member 'BP_CameraLethalHitCeremony_C_BlueprintModifyCamera::CallFunc_ComputeBaseHeightOffset_CameraPitch_ImplicitCast' has a wrong offset!");

// Function BP_CameraLethalHitCeremony.BP_CameraLethalHitCeremony_C.IsCameraZoomChangingTooFast
// 0x0050 (0x0050 - 0x0000)
struct BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast final
{
public:
	bool                                          ZoomingOut;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast) == 0x000008, "Wrong alignment on BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast");
static_assert(sizeof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast) == 0x000050, "Wrong size on BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, ZoomingOut) == 0x000000, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::ZoomingOut' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, CallFunc_BreakVector_X) == 0x000008, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, CallFunc_BreakVector_Z) == 0x000018, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, CallFunc_BreakVector_X_1) == 0x000020, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, CallFunc_BreakVector_Y_1) == 0x000028, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, CallFunc_BreakVector_Z_1) == 0x000030, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, CallFunc_Abs_ReturnValue) == 0x000040, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_CameraLethalHitCeremony_C_IsCameraZoomChangingTooFast::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

}

