#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterSelectEntryUIData

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_structs.hpp"
#include "OdyUI_classes.hpp"
#include "StructUtilsEngine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterSelectEntryUIData.BP_CharacterSelectEntryUIData_C
// 0x0090 (0x00F8 - 0x0068)
class UBP_CharacterSelectEntryUIData_C final : public UOdyUIData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_MatchaCharacterUIData_C*            CharacterUIData;                                   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOdyUIBoolBinding                      IsLocallySelected;                                 // 0x0078(0x0020)(Edit, BlueprintVisible)
	struct FOdyUIBoolBinding                      IsUnavailable;                                     // 0x0098(0x0020)(Edit, BlueprintVisible)
	struct FOdyUIBoolBinding                      IsTeammateHovered;                                 // 0x00B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOdyUIBoolBinding                      IsTeammateSelected;                                // 0x00D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_CharacterSelectEntryUIData(int32 EntryPoint);
	void OnInit(const struct FInstancedStruct& InitParams);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CharacterSelectEntryUIData_C">();
	}
	static class UBP_CharacterSelectEntryUIData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CharacterSelectEntryUIData_C>();
	}
};
static_assert(alignof(UBP_CharacterSelectEntryUIData_C) == 0x000008, "Wrong alignment on UBP_CharacterSelectEntryUIData_C");
static_assert(sizeof(UBP_CharacterSelectEntryUIData_C) == 0x0000F8, "Wrong size on UBP_CharacterSelectEntryUIData_C");
static_assert(offsetof(UBP_CharacterSelectEntryUIData_C, UberGraphFrame) == 0x000068, "Member 'UBP_CharacterSelectEntryUIData_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CharacterSelectEntryUIData_C, CharacterUIData) == 0x000070, "Member 'UBP_CharacterSelectEntryUIData_C::CharacterUIData' has a wrong offset!");
static_assert(offsetof(UBP_CharacterSelectEntryUIData_C, IsLocallySelected) == 0x000078, "Member 'UBP_CharacterSelectEntryUIData_C::IsLocallySelected' has a wrong offset!");
static_assert(offsetof(UBP_CharacterSelectEntryUIData_C, IsUnavailable) == 0x000098, "Member 'UBP_CharacterSelectEntryUIData_C::IsUnavailable' has a wrong offset!");
static_assert(offsetof(UBP_CharacterSelectEntryUIData_C, IsTeammateHovered) == 0x0000B8, "Member 'UBP_CharacterSelectEntryUIData_C::IsTeammateHovered' has a wrong offset!");
static_assert(offsetof(UBP_CharacterSelectEntryUIData_C, IsTeammateSelected) == 0x0000D8, "Member 'UBP_CharacterSelectEntryUIData_C::IsTeammateSelected' has a wrong offset!");

}

