#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraLocationInterpolator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraLocationInterpolator.BP_CameraLocationInterpolator_C
// 0x0058 (0x00A0 - 0x0048)
class UBP_CameraLocationInterpolator_C final : public UCameraModifier
{
public:
	struct FVector                                InterpolationBase;                                 // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InterpolationTarget;                               // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InterpolationProgress;                             // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableFastFraming;                                 // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ZoomInterpolationProgress;                         // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PauseZoomBackInTimer;                              // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PauseZoomBackInTime;                               // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintModifyCamera(float DeltaTime, const struct FVector& ViewLocation, const struct FRotator& ViewRotation, float FOV, struct FVector* NewViewLocation, struct FRotator* NewViewRotation, float* NewFOV);
	void DidCameraTargetMaxZoom(bool* IsTargetingMaxDefaultZoom);
	void GetCameraZoomYDelta(double* YDelta);
	void IsCameraZoomChangingTooFast(bool* ZoomingOut);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CameraLocationInterpolator_C">();
	}
	static class UBP_CameraLocationInterpolator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CameraLocationInterpolator_C>();
	}
};
static_assert(alignof(UBP_CameraLocationInterpolator_C) == 0x000008, "Wrong alignment on UBP_CameraLocationInterpolator_C");
static_assert(sizeof(UBP_CameraLocationInterpolator_C) == 0x0000A0, "Wrong size on UBP_CameraLocationInterpolator_C");
static_assert(offsetof(UBP_CameraLocationInterpolator_C, InterpolationBase) == 0x000048, "Member 'UBP_CameraLocationInterpolator_C::InterpolationBase' has a wrong offset!");
static_assert(offsetof(UBP_CameraLocationInterpolator_C, InterpolationTarget) == 0x000060, "Member 'UBP_CameraLocationInterpolator_C::InterpolationTarget' has a wrong offset!");
static_assert(offsetof(UBP_CameraLocationInterpolator_C, InterpolationProgress) == 0x000078, "Member 'UBP_CameraLocationInterpolator_C::InterpolationProgress' has a wrong offset!");
static_assert(offsetof(UBP_CameraLocationInterpolator_C, EnableFastFraming) == 0x000080, "Member 'UBP_CameraLocationInterpolator_C::EnableFastFraming' has a wrong offset!");
static_assert(offsetof(UBP_CameraLocationInterpolator_C, ZoomInterpolationProgress) == 0x000088, "Member 'UBP_CameraLocationInterpolator_C::ZoomInterpolationProgress' has a wrong offset!");
static_assert(offsetof(UBP_CameraLocationInterpolator_C, PauseZoomBackInTimer) == 0x000090, "Member 'UBP_CameraLocationInterpolator_C::PauseZoomBackInTimer' has a wrong offset!");
static_assert(offsetof(UBP_CameraLocationInterpolator_C, PauseZoomBackInTime) == 0x000098, "Member 'UBP_CameraLocationInterpolator_C::PauseZoomBackInTime' has a wrong offset!");

}

