#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MovingSkyElevatorEntity

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MovingSkyElevatorEntity.BP_MovingSkyElevatorEntity_C.ChangeDoorCollision
// 0x0001 (0x0001 - 0x0000)
struct BP_MovingSkyElevatorEntity_C_ChangeDoorCollision final
{
public:
	bool                                          DoorCollisionOff;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingSkyElevatorEntity_C_ChangeDoorCollision) == 0x000001, "Wrong alignment on BP_MovingSkyElevatorEntity_C_ChangeDoorCollision");
static_assert(sizeof(BP_MovingSkyElevatorEntity_C_ChangeDoorCollision) == 0x000001, "Wrong size on BP_MovingSkyElevatorEntity_C_ChangeDoorCollision");
static_assert(offsetof(BP_MovingSkyElevatorEntity_C_ChangeDoorCollision, DoorCollisionOff) == 0x000000, "Member 'BP_MovingSkyElevatorEntity_C_ChangeDoorCollision::DoorCollisionOff' has a wrong offset!");

// Function BP_MovingSkyElevatorEntity.BP_MovingSkyElevatorEntity_C.ExecuteUbergraph_BP_MovingSkyElevatorEntity
// 0x0008 (0x0008 - 0x0000)
struct BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOldEnabled;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewEnabled;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity) == 0x000004, "Wrong alignment on BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity");
static_assert(sizeof(BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity) == 0x000008, "Wrong size on BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity");
static_assert(offsetof(BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity, EntryPoint) == 0x000000, "Member 'BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity, K2Node_Event_bOldEnabled) == 0x000004, "Member 'BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity::K2Node_Event_bOldEnabled' has a wrong offset!");
static_assert(offsetof(BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity, K2Node_Event_bNewEnabled) == 0x000005, "Member 'BP_MovingSkyElevatorEntity_C_ExecuteUbergraph_BP_MovingSkyElevatorEntity::K2Node_Event_bNewEnabled' has a wrong offset!");

// Function BP_MovingSkyElevatorEntity.BP_MovingSkyElevatorEntity_C.OnEnabledChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_MovingSkyElevatorEntity_C_OnEnabledChanged final
{
public:
	bool                                          bOldEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewEnabled;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingSkyElevatorEntity_C_OnEnabledChanged) == 0x000001, "Wrong alignment on BP_MovingSkyElevatorEntity_C_OnEnabledChanged");
static_assert(sizeof(BP_MovingSkyElevatorEntity_C_OnEnabledChanged) == 0x000002, "Wrong size on BP_MovingSkyElevatorEntity_C_OnEnabledChanged");
static_assert(offsetof(BP_MovingSkyElevatorEntity_C_OnEnabledChanged, bOldEnabled) == 0x000000, "Member 'BP_MovingSkyElevatorEntity_C_OnEnabledChanged::bOldEnabled' has a wrong offset!");
static_assert(offsetof(BP_MovingSkyElevatorEntity_C_OnEnabledChanged, bNewEnabled) == 0x000001, "Member 'BP_MovingSkyElevatorEntity_C_OnEnabledChanged::bNewEnabled' has a wrong offset!");

}

