#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchaCharacterUIData

#include "Basic.hpp"

#include "StructUtils_structs.hpp"
#include "StructUtilsEngine_structs.hpp"
#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BP_MatchaCharacterUIData.BP_MatchaCharacterUIData_C.ExecuteUbergraph_BP_MatchaCharacterUIData
// 0x0108 (0x0108 - 0x0000)
struct BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       K2Node_Event_UpdateParams;                         // 0x0008(0x0010)()
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EStructUtilsResult                            CallFunc_GetInstancedStructValue_ExecResult;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaCharacterUIData_InitParams      CallFunc_GetInstancedStructValue_Value;            // 0x0030(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaCharacterUIData_InitParams      K2Node_CustomEvent_Params;                         // 0x0060(0x0028)()
	struct FInstancedStruct                       K2Node_Event_InitParams;                           // 0x0088(0x0010)()
	EStructUtilsResult                            CallFunc_GetInstancedStructValue_ExecResult_1;     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaCharacterUIData_InitParams      CallFunc_GetInstancedStructValue_Value_1;          // 0x00A0(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIAssetData*                        CallFunc_GetUIAssetData_ReturnValue;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_AssetUIData_MatchaCharacter_C*      K2Node_DynamicCast_AsBP_Asset_UI_Data_Matcha_Character; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData) == 0x000008, "Wrong alignment on BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData");
static_assert(sizeof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData) == 0x000108, "Wrong size on BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, EntryPoint) == 0x000000, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_Event_UpdateParams) == 0x000008, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_Event_UpdateParams' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, CallFunc_GetInstancedStructValue_ExecResult) == 0x000028, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::CallFunc_GetInstancedStructValue_ExecResult' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, CallFunc_GetInstancedStructValue_Value) == 0x000030, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::CallFunc_GetInstancedStructValue_Value' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_CustomEvent_Params) == 0x000060, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_CustomEvent_Params' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_Event_InitParams) == 0x000088, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_Event_InitParams' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, CallFunc_GetInstancedStructValue_ExecResult_1) == 0x000098, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::CallFunc_GetInstancedStructValue_ExecResult_1' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, CallFunc_GetInstancedStructValue_Value_1) == 0x0000A0, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::CallFunc_GetInstancedStructValue_Value_1' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000C8, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, Temp_class_Variable) == 0x0000D0, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_CustomEvent_Loaded) == 0x0000D8, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity) == 0x0000E0, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_ClassDynamicCast_bSuccess) == 0x0000E8, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, CallFunc_GetUIAssetData_ReturnValue) == 0x0000F0, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::CallFunc_GetUIAssetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_DynamicCast_AsBP_Asset_UI_Data_Matcha_Character) == 0x0000F8, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_DynamicCast_AsBP_Asset_UI_Data_Matcha_Character' has a wrong offset!");
static_assert(offsetof(BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'BP_MatchaCharacterUIData_C_ExecuteUbergraph_BP_MatchaCharacterUIData::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_MatchaCharacterUIData.BP_MatchaCharacterUIData_C.OnInit
// 0x0010 (0x0010 - 0x0000)
struct BP_MatchaCharacterUIData_C_OnInit final
{
public:
	struct FInstancedStruct                       InitParams;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_MatchaCharacterUIData_C_OnInit) == 0x000008, "Wrong alignment on BP_MatchaCharacterUIData_C_OnInit");
static_assert(sizeof(BP_MatchaCharacterUIData_C_OnInit) == 0x000010, "Wrong size on BP_MatchaCharacterUIData_C_OnInit");
static_assert(offsetof(BP_MatchaCharacterUIData_C_OnInit, InitParams) == 0x000000, "Member 'BP_MatchaCharacterUIData_C_OnInit::InitParams' has a wrong offset!");

// Function BP_MatchaCharacterUIData.BP_MatchaCharacterUIData_C.OnLoaded_93475303485BAD7FB3CAF89735176EE3
// 0x0008 (0x0008 - 0x0000)
struct BP_MatchaCharacterUIData_C_OnLoaded_93475303485BAD7FB3CAF89735176EE3 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchaCharacterUIData_C_OnLoaded_93475303485BAD7FB3CAF89735176EE3) == 0x000008, "Wrong alignment on BP_MatchaCharacterUIData_C_OnLoaded_93475303485BAD7FB3CAF89735176EE3");
static_assert(sizeof(BP_MatchaCharacterUIData_C_OnLoaded_93475303485BAD7FB3CAF89735176EE3) == 0x000008, "Wrong size on BP_MatchaCharacterUIData_C_OnLoaded_93475303485BAD7FB3CAF89735176EE3");
static_assert(offsetof(BP_MatchaCharacterUIData_C_OnLoaded_93475303485BAD7FB3CAF89735176EE3, Loaded) == 0x000000, "Member 'BP_MatchaCharacterUIData_C_OnLoaded_93475303485BAD7FB3CAF89735176EE3::Loaded' has a wrong offset!");

// Function BP_MatchaCharacterUIData.BP_MatchaCharacterUIData_C.OnUpdateData
// 0x0010 (0x0010 - 0x0000)
struct BP_MatchaCharacterUIData_C_OnUpdateData final
{
public:
	struct FInstancedStruct                       UpdateParams;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_MatchaCharacterUIData_C_OnUpdateData) == 0x000008, "Wrong alignment on BP_MatchaCharacterUIData_C_OnUpdateData");
static_assert(sizeof(BP_MatchaCharacterUIData_C_OnUpdateData) == 0x000010, "Wrong size on BP_MatchaCharacterUIData_C_OnUpdateData");
static_assert(offsetof(BP_MatchaCharacterUIData_C_OnUpdateData, UpdateParams) == 0x000000, "Member 'BP_MatchaCharacterUIData_C_OnUpdateData::UpdateParams' has a wrong offset!");

// Function BP_MatchaCharacterUIData.BP_MatchaCharacterUIData_C.UpdateBindings
// 0x0028 (0x0028 - 0x0000)
struct BP_MatchaCharacterUIData_C_UpdateBindings final
{
public:
	struct FMatchaCharacterUIData_InitParams      Params_0;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_MatchaCharacterUIData_C_UpdateBindings) == 0x000008, "Wrong alignment on BP_MatchaCharacterUIData_C_UpdateBindings");
static_assert(sizeof(BP_MatchaCharacterUIData_C_UpdateBindings) == 0x000028, "Wrong size on BP_MatchaCharacterUIData_C_UpdateBindings");
static_assert(offsetof(BP_MatchaCharacterUIData_C_UpdateBindings, Params_0) == 0x000000, "Member 'BP_MatchaCharacterUIData_C_UpdateBindings::Params_0' has a wrong offset!");

}

