#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MovingPlatformEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MovingPlatformEntity.BP_MovingPlatformEntity_C.ApplyConfigScale
// 0x0030 (0x0030 - 0x0000)
struct BP_MovingPlatformEntity_C_ApplyConfigScale final
{
public:
	struct FVector                                CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue; // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingPlatformEntity_C_ApplyConfigScale) == 0x000008, "Wrong alignment on BP_MovingPlatformEntity_C_ApplyConfigScale");
static_assert(sizeof(BP_MovingPlatformEntity_C_ApplyConfigScale) == 0x000030, "Wrong size on BP_MovingPlatformEntity_C_ApplyConfigScale");
static_assert(offsetof(BP_MovingPlatformEntity_C_ApplyConfigScale, CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue) == 0x000000, "Member 'BP_MovingPlatformEntity_C_ApplyConfigScale::CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingPlatformEntity_C_ApplyConfigScale, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000018, "Member 'BP_MovingPlatformEntity_C_ApplyConfigScale::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_MovingPlatformEntity.BP_MovingPlatformEntity_C.ExecuteUbergraph_BP_MovingPlatformEntity
// 0x0008 (0x0008 - 0x0000)
struct BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOldEnabled;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewEnabled;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity) == 0x000004, "Wrong alignment on BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity");
static_assert(sizeof(BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity) == 0x000008, "Wrong size on BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity");
static_assert(offsetof(BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity, EntryPoint) == 0x000000, "Member 'BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity, K2Node_Event_bOldEnabled) == 0x000004, "Member 'BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity::K2Node_Event_bOldEnabled' has a wrong offset!");
static_assert(offsetof(BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity, K2Node_Event_bNewEnabled) == 0x000005, "Member 'BP_MovingPlatformEntity_C_ExecuteUbergraph_BP_MovingPlatformEntity::K2Node_Event_bNewEnabled' has a wrong offset!");

// Function BP_MovingPlatformEntity.BP_MovingPlatformEntity_C.OnEnabledChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_MovingPlatformEntity_C_OnEnabledChanged final
{
public:
	bool                                          bOldEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewEnabled;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingPlatformEntity_C_OnEnabledChanged) == 0x000001, "Wrong alignment on BP_MovingPlatformEntity_C_OnEnabledChanged");
static_assert(sizeof(BP_MovingPlatformEntity_C_OnEnabledChanged) == 0x000002, "Wrong size on BP_MovingPlatformEntity_C_OnEnabledChanged");
static_assert(offsetof(BP_MovingPlatformEntity_C_OnEnabledChanged, bOldEnabled) == 0x000000, "Member 'BP_MovingPlatformEntity_C_OnEnabledChanged::bOldEnabled' has a wrong offset!");
static_assert(offsetof(BP_MovingPlatformEntity_C_OnEnabledChanged, bNewEnabled) == 0x000001, "Member 'BP_MovingPlatformEntity_C_OnEnabledChanged::bNewEnabled' has a wrong offset!");

// Function BP_MovingPlatformEntity.BP_MovingPlatformEntity_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct BP_MovingPlatformEntity_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue; // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MovingPlatformEntity_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_MovingPlatformEntity_C_UserConstructionScript");
static_assert(sizeof(BP_MovingPlatformEntity_C_UserConstructionScript) == 0x000048, "Wrong size on BP_MovingPlatformEntity_C_UserConstructionScript");
static_assert(offsetof(BP_MovingPlatformEntity_C_UserConstructionScript, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000000, "Member 'BP_MovingPlatformEntity_C_UserConstructionScript::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingPlatformEntity_C_UserConstructionScript, CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue) == 0x000018, "Member 'BP_MovingPlatformEntity_C_UserConstructionScript::CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MovingPlatformEntity_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000030, "Member 'BP_MovingPlatformEntity_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

}

