#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MovingPlatformEntity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SnapNet_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MovingPlatformEntity.BP_MovingPlatformEntity_C
// 0x0098 (0x0520 - 0x0488)
class ABP_MovingPlatformEntity_C final : public AMatchaMovingPlatformEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSnapNetPropertyVector                 Size;                                              // 0x04A0(0x0080)(Edit, BlueprintVisible)

public:
	void ApplyConfigScale();
	void BndEvt__BP_MovingPlatformEntity_EntityComponent_K2Node_ComponentBoundEvent_0_SnapNetPropertiesModifiedDynamicDelegate__DelegateSignature();
	void ExecuteUbergraph_BP_MovingPlatformEntity(int32 EntryPoint);
	void OnEnabledChanged(bool bOldEnabled, bool bNewEnabled);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MovingPlatformEntity_C">();
	}
	static class ABP_MovingPlatformEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MovingPlatformEntity_C>();
	}
};
static_assert(alignof(ABP_MovingPlatformEntity_C) == 0x000008, "Wrong alignment on ABP_MovingPlatformEntity_C");
static_assert(sizeof(ABP_MovingPlatformEntity_C) == 0x000520, "Wrong size on ABP_MovingPlatformEntity_C");
static_assert(offsetof(ABP_MovingPlatformEntity_C, UberGraphFrame) == 0x000488, "Member 'ABP_MovingPlatformEntity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MovingPlatformEntity_C, Cube) == 0x000490, "Member 'ABP_MovingPlatformEntity_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_MovingPlatformEntity_C, DefaultSceneRoot) == 0x000498, "Member 'ABP_MovingPlatformEntity_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MovingPlatformEntity_C, Size) == 0x0004A0, "Member 'ABP_MovingPlatformEntity_C::Size' has a wrong offset!");

}

