#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchaCharacterUIData

#include "Basic.hpp"

#include "OdyUI_structs.hpp"
#include "Engine_structs.hpp"
#include "StructUtilsEngine_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MatchaCharacterUIData.BP_MatchaCharacterUIData_C
// 0x0208 (0x02A8 - 0x00A0)
class UBP_MatchaCharacterUIData_C final : public UMatchaCharacterUIData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FOdyUITextBinding                      CharacterName;                                     // 0x00A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOdyUITextBinding                      CharacterDescription;                              // 0x00D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOdyUIMaterialBinding                  CharacterSelectHeadshotPortrait;                   // 0x00F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOdyUIMaterialBinding                  CharacterSelectFullBodyPortraitDropShadow;         // 0x0148(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOdyUIMaterialBinding                  CharacterSelectFullBodyMirroredPortrait;           // 0x0198(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOdyUITextureBinding                   TeamTexture;                                       // 0x01E8(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOdyUITextureBinding                   FullBodyPortrait;                                  // 0x0248(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_MatchaCharacterUIData(int32 EntryPoint);
	void OnInit(const struct FInstancedStruct& InitParams);
	void OnLoaded_93475303485BAD7FB3CAF89735176EE3(TSubclassOf<class UObject> Loaded);
	void OnUpdateData(const struct FInstancedStruct& UpdateParams);
	void UpdateBindings(const struct FMatchaCharacterUIData_InitParams& Params_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MatchaCharacterUIData_C">();
	}
	static class UBP_MatchaCharacterUIData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MatchaCharacterUIData_C>();
	}
};
static_assert(alignof(UBP_MatchaCharacterUIData_C) == 0x000008, "Wrong alignment on UBP_MatchaCharacterUIData_C");
static_assert(sizeof(UBP_MatchaCharacterUIData_C) == 0x0002A8, "Wrong size on UBP_MatchaCharacterUIData_C");
static_assert(offsetof(UBP_MatchaCharacterUIData_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_MatchaCharacterUIData_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MatchaCharacterUIData_C, CharacterName) == 0x0000A8, "Member 'UBP_MatchaCharacterUIData_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UBP_MatchaCharacterUIData_C, CharacterDescription) == 0x0000D0, "Member 'UBP_MatchaCharacterUIData_C::CharacterDescription' has a wrong offset!");
static_assert(offsetof(UBP_MatchaCharacterUIData_C, CharacterSelectHeadshotPortrait) == 0x0000F8, "Member 'UBP_MatchaCharacterUIData_C::CharacterSelectHeadshotPortrait' has a wrong offset!");
static_assert(offsetof(UBP_MatchaCharacterUIData_C, CharacterSelectFullBodyPortraitDropShadow) == 0x000148, "Member 'UBP_MatchaCharacterUIData_C::CharacterSelectFullBodyPortraitDropShadow' has a wrong offset!");
static_assert(offsetof(UBP_MatchaCharacterUIData_C, CharacterSelectFullBodyMirroredPortrait) == 0x000198, "Member 'UBP_MatchaCharacterUIData_C::CharacterSelectFullBodyMirroredPortrait' has a wrong offset!");
static_assert(offsetof(UBP_MatchaCharacterUIData_C, TeamTexture) == 0x0001E8, "Member 'UBP_MatchaCharacterUIData_C::TeamTexture' has a wrong offset!");
static_assert(offsetof(UBP_MatchaCharacterUIData_C, FullBodyPortrait) == 0x000248, "Member 'UBP_MatchaCharacterUIData_C::FullBodyPortrait' has a wrong offset!");

}

