#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchaLocalPlayerUIData

#include "Basic.hpp"

#include "StructUtils_structs.hpp"
#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BP_MatchaLocalPlayerUIData.BP_MatchaLocalPlayerUIData_C.ExecuteUbergraph_BP_MatchaLocalPlayerUIData
// 0x00F8 (0x00F8 - 0x0000)
struct BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MatchaCharacterUIData_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchaCharacterUIData_InitParams      K2Node_MakeStruct_MatchaCharacterUIData_InitParams; // 0x0028(0x0028)()
	TArray<TSoftClassPtr<class UClass>>           CallFunc_GetAvailableCharacters_ReturnValue;       // 0x0050(0x0010)(ConstParm, ReferenceParm)
	struct FInstancedStruct                       CallFunc_MakeInstancedStruct_ReturnValue;          // 0x0060(0x0010)()
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item;                           // 0x0070(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaCharacterUIData_InitParams      K2Node_MakeStruct_MatchaCharacterUIData_InitParams_1; // 0x00A0(0x0028)()
	struct FInstancedStruct                       CallFunc_MakeInstancedStruct_ReturnValue_1;        // 0x00C8(0x0010)()
	struct FInstancedStruct                       K2Node_Event_InitParams;                           // 0x00D8(0x0010)()
	float                                         K2Node_Event_Volume_2;                             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Volume_1;                             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Volume;                               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData) == 0x000008, "Wrong alignment on BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData");
static_assert(sizeof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData) == 0x0000F8, "Wrong size on BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, EntryPoint) == 0x000000, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, K2Node_CustomEvent_OldValue) == 0x000020, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, K2Node_CustomEvent_NewValue) == 0x000024, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, K2Node_MakeStruct_MatchaCharacterUIData_InitParams) == 0x000028, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::K2Node_MakeStruct_MatchaCharacterUIData_InitParams' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, CallFunc_GetAvailableCharacters_ReturnValue) == 0x000050, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::CallFunc_GetAvailableCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, CallFunc_MakeInstancedStruct_ReturnValue) == 0x000060, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::CallFunc_MakeInstancedStruct_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000098, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, K2Node_MakeStruct_MatchaCharacterUIData_InitParams_1) == 0x0000A0, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::K2Node_MakeStruct_MatchaCharacterUIData_InitParams_1' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, CallFunc_MakeInstancedStruct_ReturnValue_1) == 0x0000C8, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::CallFunc_MakeInstancedStruct_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, K2Node_Event_InitParams) == 0x0000D8, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::K2Node_Event_InitParams' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, K2Node_Event_Volume_2) == 0x0000E8, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::K2Node_Event_Volume_2' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, K2Node_Event_Volume_1) == 0x0000EC, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::K2Node_Event_Volume_1' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData, K2Node_Event_Volume) == 0x0000F0, "Member 'BP_MatchaLocalPlayerUIData_C_ExecuteUbergraph_BP_MatchaLocalPlayerUIData::K2Node_Event_Volume' has a wrong offset!");

// Function BP_MatchaLocalPlayerUIData.BP_MatchaLocalPlayerUIData_C.OnCharacterSelectChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_MatchaLocalPlayerUIData_C_OnCharacterSelectChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchaLocalPlayerUIData_C_OnCharacterSelectChanged) == 0x000004, "Wrong alignment on BP_MatchaLocalPlayerUIData_C_OnCharacterSelectChanged");
static_assert(sizeof(BP_MatchaLocalPlayerUIData_C_OnCharacterSelectChanged) == 0x000008, "Wrong size on BP_MatchaLocalPlayerUIData_C_OnCharacterSelectChanged");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_OnCharacterSelectChanged, OldValue) == 0x000000, "Member 'BP_MatchaLocalPlayerUIData_C_OnCharacterSelectChanged::OldValue' has a wrong offset!");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_OnCharacterSelectChanged, NewValue) == 0x000004, "Member 'BP_MatchaLocalPlayerUIData_C_OnCharacterSelectChanged::NewValue' has a wrong offset!");

// Function BP_MatchaLocalPlayerUIData.BP_MatchaLocalPlayerUIData_C.OnInit
// 0x0010 (0x0010 - 0x0000)
struct BP_MatchaLocalPlayerUIData_C_OnInit final
{
public:
	struct FInstancedStruct                       InitParams;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_MatchaLocalPlayerUIData_C_OnInit) == 0x000008, "Wrong alignment on BP_MatchaLocalPlayerUIData_C_OnInit");
static_assert(sizeof(BP_MatchaLocalPlayerUIData_C_OnInit) == 0x000010, "Wrong size on BP_MatchaLocalPlayerUIData_C_OnInit");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_OnInit, InitParams) == 0x000000, "Member 'BP_MatchaLocalPlayerUIData_C_OnInit::InitParams' has a wrong offset!");

// Function BP_MatchaLocalPlayerUIData.BP_MatchaLocalPlayerUIData_C.OnMasterVolumeChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_MatchaLocalPlayerUIData_C_OnMasterVolumeChanged final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchaLocalPlayerUIData_C_OnMasterVolumeChanged) == 0x000004, "Wrong alignment on BP_MatchaLocalPlayerUIData_C_OnMasterVolumeChanged");
static_assert(sizeof(BP_MatchaLocalPlayerUIData_C_OnMasterVolumeChanged) == 0x000004, "Wrong size on BP_MatchaLocalPlayerUIData_C_OnMasterVolumeChanged");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_OnMasterVolumeChanged, Volume) == 0x000000, "Member 'BP_MatchaLocalPlayerUIData_C_OnMasterVolumeChanged::Volume' has a wrong offset!");

// Function BP_MatchaLocalPlayerUIData.BP_MatchaLocalPlayerUIData_C.OnMusicVolumeChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_MatchaLocalPlayerUIData_C_OnMusicVolumeChanged final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchaLocalPlayerUIData_C_OnMusicVolumeChanged) == 0x000004, "Wrong alignment on BP_MatchaLocalPlayerUIData_C_OnMusicVolumeChanged");
static_assert(sizeof(BP_MatchaLocalPlayerUIData_C_OnMusicVolumeChanged) == 0x000004, "Wrong size on BP_MatchaLocalPlayerUIData_C_OnMusicVolumeChanged");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_OnMusicVolumeChanged, Volume) == 0x000000, "Member 'BP_MatchaLocalPlayerUIData_C_OnMusicVolumeChanged::Volume' has a wrong offset!");

// Function BP_MatchaLocalPlayerUIData.BP_MatchaLocalPlayerUIData_C.OnSFXVolumeChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_MatchaLocalPlayerUIData_C_OnSFXVolumeChanged final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchaLocalPlayerUIData_C_OnSFXVolumeChanged) == 0x000004, "Wrong alignment on BP_MatchaLocalPlayerUIData_C_OnSFXVolumeChanged");
static_assert(sizeof(BP_MatchaLocalPlayerUIData_C_OnSFXVolumeChanged) == 0x000004, "Wrong size on BP_MatchaLocalPlayerUIData_C_OnSFXVolumeChanged");
static_assert(offsetof(BP_MatchaLocalPlayerUIData_C_OnSFXVolumeChanged, Volume) == 0x000000, "Member 'BP_MatchaLocalPlayerUIData_C_OnSFXVolumeChanged::Volume' has a wrong offset!");

}

