#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OdyMinimapActor

#include "Basic.hpp"

#include "OdyMinimap_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OdyMinimapActor.BP_OdyMinimapActor_C
// 0x0020 (0x0310 - 0x02F0)
class ABP_OdyMinimapActor_C final : public AOdyMinimapActor
{
public:
	class USplineComponent*                       Spline;                                            // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseLayerSlices;                                   // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugSlices;                                      // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FinalZoneMinimapIndicator_C*       ActiveFinalZone;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             WorldMapArt;                                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Capture();
	void MakeSplineLinear();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OdyMinimapActor_C">();
	}
	static class ABP_OdyMinimapActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OdyMinimapActor_C>();
	}
};
static_assert(alignof(ABP_OdyMinimapActor_C) == 0x000008, "Wrong alignment on ABP_OdyMinimapActor_C");
static_assert(sizeof(ABP_OdyMinimapActor_C) == 0x000310, "Wrong size on ABP_OdyMinimapActor_C");
static_assert(offsetof(ABP_OdyMinimapActor_C, Spline) == 0x0002F0, "Member 'ABP_OdyMinimapActor_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_OdyMinimapActor_C, bUseLayerSlices) == 0x0002F8, "Member 'ABP_OdyMinimapActor_C::bUseLayerSlices' has a wrong offset!");
static_assert(offsetof(ABP_OdyMinimapActor_C, bDebugSlices) == 0x0002F9, "Member 'ABP_OdyMinimapActor_C::bDebugSlices' has a wrong offset!");
static_assert(offsetof(ABP_OdyMinimapActor_C, ActiveFinalZone) == 0x000300, "Member 'ABP_OdyMinimapActor_C::ActiveFinalZone' has a wrong offset!");
static_assert(offsetof(ABP_OdyMinimapActor_C, WorldMapArt) == 0x000308, "Member 'ABP_OdyMinimapActor_C::WorldMapArt' has a wrong offset!");

}

