#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCameraManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerCameraManager.BP_PlayerCameraManager_C
// 0x0030 (0x24F0 - 0x24C0)
class ABP_PlayerCameraManager_C final : public AMatchaPlayerCameraManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x24C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CombatMode;                                        // 0x24C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C9[0x7];                                     // 0x24C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FieldOfView;                                       // 0x24D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CameraLethalHitCeremony_C*          LethalHitCamModifier;                              // 0x24D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CameraLocationInterpolator_C*       DefaultInterpolator;                               // 0x24E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EnableCameraHit(bool NewEnable);
	void EnableInterpolationFastFrame(bool NewEnable);
	void EnableInterpolator(bool NewEnable);
	void EnableLethalHitFocus(bool NewEnabled, const struct FVector& FocusLocation);
	void ExecuteUbergraph_BP_PlayerCameraManager(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerCameraManager_C">();
	}
	static class ABP_PlayerCameraManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerCameraManager_C>();
	}
};
static_assert(alignof(ABP_PlayerCameraManager_C) == 0x000010, "Wrong alignment on ABP_PlayerCameraManager_C");
static_assert(sizeof(ABP_PlayerCameraManager_C) == 0x0024F0, "Wrong size on ABP_PlayerCameraManager_C");
static_assert(offsetof(ABP_PlayerCameraManager_C, UberGraphFrame) == 0x0024C0, "Member 'ABP_PlayerCameraManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCameraManager_C, CombatMode) == 0x0024C8, "Member 'ABP_PlayerCameraManager_C::CombatMode' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCameraManager_C, FieldOfView) == 0x0024D0, "Member 'ABP_PlayerCameraManager_C::FieldOfView' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCameraManager_C, LethalHitCamModifier) == 0x0024D8, "Member 'ABP_PlayerCameraManager_C::LethalHitCamModifier' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCameraManager_C, DefaultInterpolator) == 0x0024E0, "Member 'ABP_PlayerCameraManager_C::DefaultInterpolator' has a wrong offset!");

}

