#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_VisionSystemUtils

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPL_VisionSystemUtils.BPL_VisionSystemUtils_C.CharRenderShouldBeGameplayVisibleToViewerRender
// 0x0080 (0x0080 - 0x0000)
struct BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender final
{
public:
	class ACharacterRenderer_Base_C*              ViewerRenderer;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterRenderer_Base_C*              TargetRenderer;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldBeVisible;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar;                                       // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VisTriggerCheck;                                   // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AMatchaSnapNetPlayerEntity*>     CallFunc_GetByTeamIndex_ReturnValue;               // 0x0028(0x0010)(ReferenceParm)
	class AMatchaSnapNetPlayerEntity*             CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_SnapNetPropertyEntityIndexToInt_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetEntityRendererByIndex_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterRenderer_Base_C*              K2Node_DynamicCast_AsCharacter_Renderer_Base;      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOwnerPlayerIndex_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleViaVisibilityTriggerCheck_IsVisible; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender) == 0x000008, "Wrong alignment on BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender");
static_assert(sizeof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender) == 0x000080, "Wrong size on BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, ViewerRenderer) == 0x000000, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::ViewerRenderer' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, TargetRenderer) == 0x000008, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::TargetRenderer' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, __WorldContext) == 0x000010, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, ShouldBeVisible) == 0x000018, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::ShouldBeVisible' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, NewLocalVar) == 0x000019, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, VisTriggerCheck) == 0x00001A, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::VisTriggerCheck' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_GetByTeamIndex_ReturnValue) == 0x000028, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_GetByTeamIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_Array_Get_Item) == 0x000038, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_Conv_SnapNetPropertyEntityIndexToInt_ReturnValue) == 0x000048, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_Conv_SnapNetPropertyEntityIndexToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_GetEntityRendererByIndex_ReturnValue) == 0x000050, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_GetEntityRendererByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, K2Node_DynamicCast_AsCharacter_Renderer_Base) == 0x000058, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::K2Node_DynamicCast_AsCharacter_Renderer_Base' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_GetOwnerPlayerIndex_ReturnValue) == 0x000064, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_GetOwnerPlayerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_IsVisibleViaVisibilityTriggerCheck_IsVisible) == 0x000068, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_IsVisibleViaVisibilityTriggerCheck_IsVisible' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_GetUIDataModel_ReturnValue) == 0x000070, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_Array_Contains_ReturnValue) == 0x000078, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000079, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00007A, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_BooleanOR_ReturnValue) == 0x00007B, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BPL_VisionSystemUtils_C_CharRenderShouldBeGameplayVisibleToViewerRender::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPL_VisionSystemUtils.BPL_VisionSystemUtils_C.IsVisibleViaVisibilityTriggerCheck
// 0x0070 (0x0070 - 0x0000)
struct BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck final
{
public:
	class ACharacterRenderer_Base_C*              Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterRenderer_Base_C*              Viewer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisible;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ViewerContainsAll;                                 // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ViewerOverlappingTriggers;                         // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         TargetOverlappingTriggers;                         // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck) == 0x000008, "Wrong alignment on BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck");
static_assert(sizeof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck) == 0x000070, "Wrong size on BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, Target) == 0x000000, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::Target' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, Viewer) == 0x000008, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::Viewer' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, __WorldContext) == 0x000010, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, IsVisible) == 0x000018, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::IsVisible' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, ViewerContainsAll) == 0x000019, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::ViewerContainsAll' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, ViewerOverlappingTriggers) == 0x000020, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::ViewerOverlappingTriggers' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, TargetOverlappingTriggers) == 0x000030, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::TargetOverlappingTriggers' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, Temp_bool_True_if_break_was_hit_Variable) == 0x00004C, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_Not_PreBool_ReturnValue) == 0x00004D, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_Array_Get_Item) == 0x000050, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_Array_Contains_ReturnValue) == 0x00005C, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00005D, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_Array_Length_ReturnValue_2) == 0x000068, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_BooleanAND_ReturnValue) == 0x00006C, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00006D, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_BooleanAND_ReturnValue_1) == 0x00006E, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck, CallFunc_BooleanOR_ReturnValue) == 0x00006F, "Member 'BPL_VisionSystemUtils_C_IsVisibleViaVisibilityTriggerCheck::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

