#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_Initialize_AI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_Initialize_AI.BTT_Initialize_AI_C
// 0x0058 (0x0100 - 0x00A8)
class UBTT_Initialize_AI_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 StartingSpawnLocationKey;                          // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 AggroDistance;                                     // 0x00D8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_Initialize_AI(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_Initialize_AI_C">();
	}
	static class UBTT_Initialize_AI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_Initialize_AI_C>();
	}
};
static_assert(alignof(UBTT_Initialize_AI_C) == 0x000008, "Wrong alignment on UBTT_Initialize_AI_C");
static_assert(sizeof(UBTT_Initialize_AI_C) == 0x000100, "Wrong size on UBTT_Initialize_AI_C");
static_assert(offsetof(UBTT_Initialize_AI_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_Initialize_AI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_Initialize_AI_C, StartingSpawnLocationKey) == 0x0000B0, "Member 'UBTT_Initialize_AI_C::StartingSpawnLocationKey' has a wrong offset!");
static_assert(offsetof(UBTT_Initialize_AI_C, AggroDistance) == 0x0000D8, "Member 'UBTT_Initialize_AI_C::AggroDistance' has a wrong offset!");

}

