#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_CharacterPassive_Base

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BUF_CharacterPassive_Base.BUF_CharacterPassive_Base_C.OnBuffApplied
// 0x0010 (0x0010 - 0x0000)
struct BUF_CharacterPassive_Base_C_OnBuffApplied final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BuffLevel;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_CharacterPassive_Base_C_OnBuffApplied) == 0x000008, "Wrong alignment on BUF_CharacterPassive_Base_C_OnBuffApplied");
static_assert(sizeof(BUF_CharacterPassive_Base_C_OnBuffApplied) == 0x000010, "Wrong size on BUF_CharacterPassive_Base_C_OnBuffApplied");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnBuffApplied, BuffedCharacter) == 0x000000, "Member 'BUF_CharacterPassive_Base_C_OnBuffApplied::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnBuffApplied, BuffRarity) == 0x000008, "Member 'BUF_CharacterPassive_Base_C_OnBuffApplied::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnBuffApplied, BuffLevel) == 0x00000C, "Member 'BUF_CharacterPassive_Base_C_OnBuffApplied::BuffLevel' has a wrong offset!");

// Function BUF_CharacterPassive_Base.BUF_CharacterPassive_Base_C.OnBuffRemoved
// 0x0010 (0x0010 - 0x0000)
struct BUF_CharacterPassive_Base_C_OnBuffRemoved final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_CharacterPassive_Base_C_OnBuffRemoved) == 0x000008, "Wrong alignment on BUF_CharacterPassive_Base_C_OnBuffRemoved");
static_assert(sizeof(BUF_CharacterPassive_Base_C_OnBuffRemoved) == 0x000010, "Wrong size on BUF_CharacterPassive_Base_C_OnBuffRemoved");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnBuffRemoved, BuffedCharacter) == 0x000000, "Member 'BUF_CharacterPassive_Base_C_OnBuffRemoved::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnBuffRemoved, BuffRarity) == 0x000008, "Member 'BUF_CharacterPassive_Base_C_OnBuffRemoved::BuffRarity' has a wrong offset!");

// Function BUF_CharacterPassive_Base.BUF_CharacterPassive_Base_C.OnCharacterShieldStateChanged
// 0x00A0 (0x00A0 - 0x0000)
struct BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMatchaShieldState                            PreviousShieldState;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaShieldState                            NewShieldState;                                    // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCombinedFXInfo                        K2Node_MakeStruct_CombinedFXInfo;                  // 0x0010(0x0088)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged) == 0x000008, "Wrong alignment on BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged");
static_assert(sizeof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged) == 0x0000A0, "Wrong size on BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged, BuffedCharacter) == 0x000000, "Member 'BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged, PreviousShieldState) == 0x000008, "Member 'BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged::PreviousShieldState' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged, NewShieldState) == 0x000009, "Member 'BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged::NewShieldState' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged, BuffRarity) == 0x00000A, "Member 'BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged, K2Node_MakeStruct_CombinedFXInfo) == 0x000010, "Member 'BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged::K2Node_MakeStruct_CombinedFXInfo' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000098, "Member 'BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000099, "Member 'BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged, CallFunc_BooleanAND_ReturnValue) == 0x00009A, "Member 'BUF_CharacterPassive_Base_C_OnCharacterShieldStateChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BUF_CharacterPassive_Base.BUF_CharacterPassive_Base_C.OnKnockedOutAnEnemyCharacter
// 0x0018 (0x0018 - 0x0000)
struct BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 EnemyCharacter;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter) == 0x000008, "Wrong alignment on BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter");
static_assert(sizeof(BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter) == 0x000018, "Wrong size on BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter, BuffedCharacter) == 0x000000, "Member 'BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter, EnemyCharacter) == 0x000008, "Member 'BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter::EnemyCharacter' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter, BuffRarity) == 0x000010, "Member 'BUF_CharacterPassive_Base_C_OnKnockedOutAnEnemyCharacter::BuffRarity' has a wrong offset!");

// Function BUF_CharacterPassive_Base.BUF_CharacterPassive_Base_C.OnPostApplyOutgoingHit
// 0x0120 (0x0120 - 0x0000)
struct BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetHit;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PreviousTargetHit;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMatchaHitData                         HitData;                                           // 0x0018(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         AppliedHitFlags;                                   // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaCharacterMontageType                   MontageDuringHit;                                  // 0x0091(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0092(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShieldHit_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaAICharacterEntity*               K2Node_DynamicCast_AsMatcha_AI_Character_Entity;   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaSnapNetCharacterEntity*          K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEnergyGenerationRatio_ReturnValue;     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddEnergy_Amount_ImplicitCast;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit) == 0x000008, "Wrong alignment on BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit");
static_assert(sizeof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit) == 0x000120, "Wrong size on BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, BuffedCharacter) == 0x000000, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, TargetHit) == 0x000008, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::TargetHit' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, PreviousTargetHit) == 0x000010, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::PreviousTargetHit' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, HitData) == 0x000018, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::HitData' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, AppliedHitFlags) == 0x000090, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::AppliedHitFlags' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, MontageDuringHit) == 0x000091, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::MontageDuringHit' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, BuffRarity) == 0x000092, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000093, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000094, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000095, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000096, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000097, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000098, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000099, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x00009A, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x00009B, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_IsShieldHit_ReturnValue) == 0x00009C, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_IsShieldHit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_BooleanOR_ReturnValue) == 0x00009D, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_BooleanOR_ReturnValue_1) == 0x00009E, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_BooleanOR_ReturnValue_2) == 0x00009F, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_BooleanOR_ReturnValue_3) == 0x0000A1, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_SelectFloat_ReturnValue) == 0x0000A8, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_BooleanOR_ReturnValue_4) == 0x0000B0, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000B1, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_BooleanOR_ReturnValue_5) == 0x0000B2, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_SelectFloat_ReturnValue_1) == 0x0000B8, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_BooleanOR_ReturnValue_6) == 0x0000C0, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_AsMatcha_AI_Character_Entity) == 0x0000C8, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_AsMatcha_AI_Character_Entity' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_BooleanOR_ReturnValue_7) == 0x0000D1, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity) == 0x0000D8, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_BooleanOR_ReturnValue_8) == 0x0000E1, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_GetEnergyGenerationRatio_ReturnValue) == 0x0000E4, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_GetEnergyGenerationRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000F0, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000F8, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000100, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000108, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000110, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit, CallFunc_AddEnergy_Amount_ImplicitCast) == 0x000118, "Member 'BUF_CharacterPassive_Base_C_OnPostApplyOutgoingHit::CallFunc_AddEnergy_Amount_ImplicitCast' has a wrong offset!");

// Function BUF_CharacterPassive_Base.BUF_CharacterPassive_Base_C.OnShieldBlockedAHit
// 0x0130 (0x0130 - 0x0000)
struct BUF_CharacterPassive_Base_C_OnShieldBlockedAHit final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitInstigator;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         PreHitShieldHealth;                                // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDidShieldBreak;                                   // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DamageShielded;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDidPerfectShieldHit;                              // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCombinedFXInfo                        K2Node_MakeStruct_CombinedFXInfo;                  // 0x0020(0x0088)(NoDestructor)
	struct FCombinedFXInfo                        K2Node_MakeStruct_CombinedFXInfo_1;                // 0x00A8(0x0088)(NoDestructor)
};
static_assert(alignof(BUF_CharacterPassive_Base_C_OnShieldBlockedAHit) == 0x000008, "Wrong alignment on BUF_CharacterPassive_Base_C_OnShieldBlockedAHit");
static_assert(sizeof(BUF_CharacterPassive_Base_C_OnShieldBlockedAHit) == 0x000130, "Wrong size on BUF_CharacterPassive_Base_C_OnShieldBlockedAHit");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnShieldBlockedAHit, BuffedCharacter) == 0x000000, "Member 'BUF_CharacterPassive_Base_C_OnShieldBlockedAHit::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnShieldBlockedAHit, HitInstigator) == 0x000008, "Member 'BUF_CharacterPassive_Base_C_OnShieldBlockedAHit::HitInstigator' has a wrong offset!");
static_assert(offsetof(BUF_CharacterPassive_Base_C_OnShieldBlockedAHit, PreHitShieldHealth) == 0x000010, "Member 'BUF_CharacterPassive_Base_C_OnShieldBlockedAHit::PreHitShieldHealth' has a wrong offset!");
