#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_Armor_FocusArmor

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BUF_Armor_FocusArmor.BUF_Armor_FocusArmor_C.OnBuffApplied
// 0x0010 (0x0010 - 0x0000)
struct BUF_Armor_FocusArmor_C_OnBuffApplied final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_Armor_FocusArmor_C_OnBuffApplied) == 0x000008, "Wrong alignment on BUF_Armor_FocusArmor_C_OnBuffApplied");
static_assert(sizeof(BUF_Armor_FocusArmor_C_OnBuffApplied) == 0x000010, "Wrong size on BUF_Armor_FocusArmor_C_OnBuffApplied");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnBuffApplied, BuffedCharacter) == 0x000000, "Member 'BUF_Armor_FocusArmor_C_OnBuffApplied::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnBuffApplied, BuffRarity) == 0x000008, "Member 'BUF_Armor_FocusArmor_C_OnBuffApplied::BuffRarity' has a wrong offset!");

// Function BUF_Armor_FocusArmor.BUF_Armor_FocusArmor_C.OnBuffRemoved
// 0x0010 (0x0010 - 0x0000)
struct BUF_Armor_FocusArmor_C_OnBuffRemoved final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_Armor_FocusArmor_C_OnBuffRemoved) == 0x000008, "Wrong alignment on BUF_Armor_FocusArmor_C_OnBuffRemoved");
static_assert(sizeof(BUF_Armor_FocusArmor_C_OnBuffRemoved) == 0x000010, "Wrong size on BUF_Armor_FocusArmor_C_OnBuffRemoved");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnBuffRemoved, BuffedCharacter) == 0x000000, "Member 'BUF_Armor_FocusArmor_C_OnBuffRemoved::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnBuffRemoved, BuffRarity) == 0x000008, "Member 'BUF_Armor_FocusArmor_C_OnBuffRemoved::BuffRarity' has a wrong offset!");

// Function BUF_Armor_FocusArmor.BUF_Armor_FocusArmor_C.OnCharacterPeformedTech
// 0x00A0 (0x00A0 - 0x0000)
struct BUF_Armor_FocusArmor_C_OnCharacterPeformedTech final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCombinedFXInfo                        K2Node_MakeStruct_CombinedFXInfo;                  // 0x0010(0x0088)(NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RequestIntangibility_DurationSeconds_ImplicitCast; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_Armor_FocusArmor_C_OnCharacterPeformedTech) == 0x000008, "Wrong alignment on BUF_Armor_FocusArmor_C_OnCharacterPeformedTech");
static_assert(sizeof(BUF_Armor_FocusArmor_C_OnCharacterPeformedTech) == 0x0000A0, "Wrong size on BUF_Armor_FocusArmor_C_OnCharacterPeformedTech");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnCharacterPeformedTech, BuffedCharacter) == 0x000000, "Member 'BUF_Armor_FocusArmor_C_OnCharacterPeformedTech::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnCharacterPeformedTech, BuffRarity) == 0x000008, "Member 'BUF_Armor_FocusArmor_C_OnCharacterPeformedTech::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnCharacterPeformedTech, Temp_byte_Variable) == 0x000009, "Member 'BUF_Armor_FocusArmor_C_OnCharacterPeformedTech::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnCharacterPeformedTech, K2Node_MakeStruct_CombinedFXInfo) == 0x000010, "Member 'BUF_Armor_FocusArmor_C_OnCharacterPeformedTech::K2Node_MakeStruct_CombinedFXInfo' has a wrong offset!");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnCharacterPeformedTech, K2Node_Select_Default) == 0x000098, "Member 'BUF_Armor_FocusArmor_C_OnCharacterPeformedTech::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BUF_Armor_FocusArmor_C_OnCharacterPeformedTech, CallFunc_RequestIntangibility_DurationSeconds_ImplicitCast) == 0x00009C, "Member 'BUF_Armor_FocusArmor_C_OnCharacterPeformedTech::CallFunc_RequestIntangibility_DurationSeconds_ImplicitCast' has a wrong offset!");

}

