#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_DashSpeed

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_DashSpeed.BUF_DashSpeed_C
// 0x0020 (0x0048 - 0x0028)
class UBUF_DashSpeed_C : public UMatchaCharacterBuff
{
public:
	class UClass*                                 SpeedGE;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        RareDashSpeedMod;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EpicDashSpeedMod;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LegendaryDashSpeedMod;                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBuffApplied(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnBuffRemoved(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_DashSpeed_C">();
	}
	static class UBUF_DashSpeed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_DashSpeed_C>();
	}
};
static_assert(alignof(UBUF_DashSpeed_C) == 0x000008, "Wrong alignment on UBUF_DashSpeed_C");
static_assert(sizeof(UBUF_DashSpeed_C) == 0x000048, "Wrong size on UBUF_DashSpeed_C");
static_assert(offsetof(UBUF_DashSpeed_C, SpeedGE) == 0x000028, "Member 'UBUF_DashSpeed_C::SpeedGE' has a wrong offset!");
static_assert(offsetof(UBUF_DashSpeed_C, RareDashSpeedMod) == 0x000030, "Member 'UBUF_DashSpeed_C::RareDashSpeedMod' has a wrong offset!");
static_assert(offsetof(UBUF_DashSpeed_C, EpicDashSpeedMod) == 0x000038, "Member 'UBUF_DashSpeed_C::EpicDashSpeedMod' has a wrong offset!");
static_assert(offsetof(UBUF_DashSpeed_C, LegendaryDashSpeedMod) == 0x000040, "Member 'UBUF_DashSpeed_C::LegendaryDashSpeedMod' has a wrong offset!");

}

