#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_Energized_ChargeGloves_Child

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BUF_Energized_ChargeGloves_Child.BUF_Energized_ChargeGloves_Child_C.OnKnockedOutAnEnemyCharacter
// 0x0018 (0x0018 - 0x0000)
struct BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 EnemyCharacter;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter) == 0x000008, "Wrong alignment on BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter");
static_assert(sizeof(BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter) == 0x000018, "Wrong size on BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter");
static_assert(offsetof(BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter, BuffedCharacter) == 0x000000, "Member 'BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter, EnemyCharacter) == 0x000008, "Member 'BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter::EnemyCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter, BuffRarity) == 0x000010, "Member 'BUF_Energized_ChargeGloves_Child_C_OnKnockedOutAnEnemyCharacter::BuffRarity' has a wrong offset!");

}

