#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_Vampirism_Rarity

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_Vampirism_Rarity.BUF_Vampirism_Rarity_C
// 0x0020 (0x0048 - 0x0028)
class UBUF_Vampirism_Rarity_C final : public UMatchaCharacterBuff
{
public:
	class UClass*                                 VampStatGE;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        RareVampStatAmount;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EpicVampStatAmount;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LegendaryVampStatAmount;                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBuffApplied(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnBuffRemoved(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_Vampirism_Rarity_C">();
	}
	static class UBUF_Vampirism_Rarity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_Vampirism_Rarity_C>();
	}
};
static_assert(alignof(UBUF_Vampirism_Rarity_C) == 0x000008, "Wrong alignment on UBUF_Vampirism_Rarity_C");
static_assert(sizeof(UBUF_Vampirism_Rarity_C) == 0x000048, "Wrong size on UBUF_Vampirism_Rarity_C");
static_assert(offsetof(UBUF_Vampirism_Rarity_C, VampStatGE) == 0x000028, "Member 'UBUF_Vampirism_Rarity_C::VampStatGE' has a wrong offset!");
static_assert(offsetof(UBUF_Vampirism_Rarity_C, RareVampStatAmount) == 0x000030, "Member 'UBUF_Vampirism_Rarity_C::RareVampStatAmount' has a wrong offset!");
static_assert(offsetof(UBUF_Vampirism_Rarity_C, EpicVampStatAmount) == 0x000038, "Member 'UBUF_Vampirism_Rarity_C::EpicVampStatAmount' has a wrong offset!");
static_assert(offsetof(UBUF_Vampirism_Rarity_C, LegendaryVampStatAmount) == 0x000040, "Member 'UBUF_Vampirism_Rarity_C::LegendaryVampStatAmount' has a wrong offset!");

}

