#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_Gloves_Thief

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BUF_Gloves_Thief.BUF_Gloves_Thief_C.ModifyOutGoingHitBoxDamage
// 0x0078 (0x0078 - 0x0000)
struct BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         BaseHitBoxDamage;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSharedTeamCoinsCount_ReturnValue;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage) == 0x000008, "Wrong alignment on BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage");
static_assert(sizeof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage) == 0x000078, "Wrong size on BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, BuffedCharacter) == 0x000000, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, BaseHitBoxDamage) == 0x000008, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::BaseHitBoxDamage' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, BuffRarity) == 0x00000C, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, ReturnValue) == 0x000010, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_GetSharedTeamCoinsCount_ReturnValue) == 0x000014, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_GetSharedTeamCoinsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, Temp_byte_Variable) == 0x000019, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Min_ReturnValue) == 0x00001C, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, K2Node_Select_Default) == 0x000028, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000030, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000048, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000060, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000068, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BUF_Gloves_Thief_C_ModifyOutGoingHitBoxDamage::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BUF_Gloves_Thief.BUF_Gloves_Thief_C.OnPostApplyOutgoingHit
// 0x0178 (0x0178 - 0x0000)
struct BUF_Gloves_Thief_C_OnPostApplyOutgoingHit final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetHit;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PreviousTargetHit;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMatchaHitData                         HitData;                                           // 0x0018(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         AppliedHitFlags;                                   // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaCharacterMontageType                   MontageDuringHit;                                  // 0x0091(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0092(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CoinsAfterSteal;                                   // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActualCoinsStolen;                                 // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CoinsBeforeSteal;                                  // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCombinedFXInfo                        K2Node_MakeStruct_CombinedFXInfo;                  // 0x00A0(0x0088)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaSnapNetCharacterEntity*          K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaSnapNetPlayerEntity*             CallFunc_GetOwningPlayerEntity_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchaSnapNetPlayerEntity*             CallFunc_GetOwningPlayerEntity_ReturnValue_1;      // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSharedTeamCoins_ReturnValue;           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSharedTeamCoins_ReturnValue_1;         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit) == 0x000008, "Wrong alignment on BUF_Gloves_Thief_C_OnPostApplyOutgoingHit");
static_assert(sizeof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit) == 0x000178, "Wrong size on BUF_Gloves_Thief_C_OnPostApplyOutgoingHit");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, BuffedCharacter) == 0x000000, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, TargetHit) == 0x000008, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::TargetHit' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, PreviousTargetHit) == 0x000010, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::PreviousTargetHit' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, HitData) == 0x000018, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::HitData' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, AppliedHitFlags) == 0x000090, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::AppliedHitFlags' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, MontageDuringHit) == 0x000091, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::MontageDuringHit' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, BuffRarity) == 0x000092, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CoinsAfterSteal) == 0x000094, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CoinsAfterSteal' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, ActualCoinsStolen) == 0x000098, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::ActualCoinsStolen' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CoinsBeforeSteal) == 0x00009C, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CoinsBeforeSteal' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, K2Node_MakeStruct_CombinedFXInfo) == 0x0000A0, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::K2Node_MakeStruct_CombinedFXInfo' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000128, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity) == 0x000130, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_GetOwningPlayerEntity_ReturnValue) == 0x000140, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_GetOwningPlayerEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_GetOwningPlayerEntity_ReturnValue_1) == 0x000148, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_GetOwningPlayerEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_IsValid_ReturnValue_1) == 0x000151, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_GetSharedTeamCoins_ReturnValue) == 0x000154, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_GetSharedTeamCoins_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_GetSharedTeamCoins_ReturnValue_1) == 0x000158, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_GetSharedTeamCoins_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00015C, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_Subtract_IntInt_ReturnValue) == 0x000160, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_Max_ReturnValue) == 0x000164, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_Greater_IntInt_ReturnValue) == 0x000168, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_Add_IntInt_ReturnValue) == 0x00016C, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000170, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_C_OnPostApplyOutgoingHit, CallFunc_Max_ReturnValue_1) == 0x000174, "Member 'BUF_Gloves_Thief_C_OnPostApplyOutgoingHit::CallFunc_Max_ReturnValue_1' has a wrong offset!");

}

