#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_PoisonGloves

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "MatchaGameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BUF_PoisonGloves.BUF_PoisonGloves_C.OnPostApplyOutgoingHit
// 0x0460 (0x0460 - 0x0000)
struct BUF_PoisonGloves_C_OnPostApplyOutgoingHit final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetHit;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PreviousTargetHit;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMatchaHitData                         HitData;                                           // 0x0018(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         AppliedHitFlags;                                   // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaCharacterMontageType                   MontageDuringHit;                                  // 0x0091(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0092(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 Temp_byte_Variable;                                // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterEntity_Base_C*                K2Node_DynamicCast_AsCharacter_Entity_Base;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMatchaGameplayEffectOwnerProvider> CallFunc_GetGameplayEffectOwner_self_CastInput;    // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMatchaGameplayEffectOwner> CallFunc_GetGameplayEffectOwner_ReturnValue;       // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IMatchaGameplayEffectOwnerProvider> CallFunc_GetGameplayEffectOwner_self_CastInput_1;  // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMatchaGameplayEffectOwner> CallFunc_GetGameplayEffectOwner_ReturnValue_1;     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasSuperArmor_ReturnValue;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaShieldState                            CallFunc_GetShieldState_ReturnValue;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaGameplayEffectQuery             K2Node_MakeStruct_MatchaGameplayEffectQuery;       // 0x00F0(0x0198)(ContainsInstancedReference)
	int32                                         CallFunc_GetAggregatedStackCount_ReturnValue;      // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaGameplayEffectQuery             K2Node_MakeStruct_MatchaGameplayEffectQuery_1;     // 0x0290(0x0198)(ContainsInstancedReference)
	int32                                         CallFunc_GetAggregatedStackCount_ReturnValue_1;    // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyPeriodicDamageEffect_DamageAmount_ImplicitCast; // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit) == 0x000008, "Wrong alignment on BUF_PoisonGloves_C_OnPostApplyOutgoingHit");
static_assert(sizeof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit) == 0x000460, "Wrong size on BUF_PoisonGloves_C_OnPostApplyOutgoingHit");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, BuffedCharacter) == 0x000000, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, TargetHit) == 0x000008, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::TargetHit' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, PreviousTargetHit) == 0x000010, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::PreviousTargetHit' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, HitData) == 0x000018, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::HitData' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, AppliedHitFlags) == 0x000090, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::AppliedHitFlags' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, MontageDuringHit) == 0x000091, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::MontageDuringHit' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, BuffRarity) == 0x000092, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, Temp_byte_Variable) == 0x000093, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_AsCharacter_Entity_Base) == 0x000098, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_AsCharacter_Entity_Base' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000A1, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_GetGameplayEffectOwner_self_CastInput) == 0x0000A8, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_GetGameplayEffectOwner_self_CastInput' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_GetGameplayEffectOwner_ReturnValue) == 0x0000B8, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_GetGameplayEffectOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_GetGameplayEffectOwner_self_CastInput_1) == 0x0000C8, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_GetGameplayEffectOwner_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_GetGameplayEffectOwner_ReturnValue_1) == 0x0000D8, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_GetGameplayEffectOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_HasSuperArmor_ReturnValue) == 0x0000E8, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_HasSuperArmor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_GetShieldState_ReturnValue) == 0x0000E9, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_GetShieldState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_Not_PreBool_ReturnValue) == 0x0000EA, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000EB, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_BooleanAND_ReturnValue) == 0x0000EC, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_BooleanAND_ReturnValue_1) == 0x0000ED, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, K2Node_MakeStruct_MatchaGameplayEffectQuery) == 0x0000F0, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::K2Node_MakeStruct_MatchaGameplayEffectQuery' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_GetAggregatedStackCount_ReturnValue) == 0x000288, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_GetAggregatedStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_Less_IntInt_ReturnValue) == 0x00028C, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, K2Node_MakeStruct_MatchaGameplayEffectQuery_1) == 0x000290, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::K2Node_MakeStruct_MatchaGameplayEffectQuery_1' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_GetAggregatedStackCount_ReturnValue_1) == 0x000428, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_GetAggregatedStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000430, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, K2Node_Select_Default) == 0x000438, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000440, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000448, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000450, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BUF_PoisonGloves_C_OnPostApplyOutgoingHit, CallFunc_ApplyPeriodicDamageEffect_DamageAmount_ImplicitCast) == 0x000458, "Member 'BUF_PoisonGloves_C_OnPostApplyOutgoingHit::CallFunc_ApplyPeriodicDamageEffect_DamageAmount_ImplicitCast' has a wrong offset!");

}

