#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_Gloves_Thief_Energized

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BUF_Gloves_Thief_Energized.BUF_Gloves_Thief_Energized_C.OnPostApplyOutgoingHit
// 0x00E0 (0x00E0 - 0x0000)
struct BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetHit;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PreviousTargetHit;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMatchaHitData                         HitData;                                           // 0x0018(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         AppliedHitFlags;                                   // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaCharacterMontageType                   MontageDuringHit;                                  // 0x0091(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0092(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInventoryProvider>    K2Node_DynamicCast_AsInventory_Provider;           // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryComponent*              CallFunc_GetInventoryComponent_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryDropRandomItemInCategory_ReturnValue;  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit) == 0x000008, "Wrong alignment on BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit");
static_assert(sizeof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit) == 0x0000E0, "Wrong size on BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, BuffedCharacter) == 0x000000, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, TargetHit) == 0x000008, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::TargetHit' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, PreviousTargetHit) == 0x000010, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::PreviousTargetHit' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, HitData) == 0x000018, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::HitData' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, AppliedHitFlags) == 0x000090, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::AppliedHitFlags' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, MontageDuringHit) == 0x000091, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::MontageDuringHit' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, BuffRarity) == 0x000092, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_AsInventory_Provider) == 0x000098, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_AsInventory_Provider' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A9, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, CallFunc_GetInventoryComponent_ReturnValue) == 0x0000B0, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C0, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit, CallFunc_TryDropRandomItemInCategory_ReturnValue) == 0x0000D8, "Member 'BUF_Gloves_Thief_Energized_C_OnPostApplyOutgoingHit::CallFunc_TryDropRandomItemInCategory_ReturnValue' has a wrong offset!");

}

