#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_WaveBoots

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_WaveBoots.BUF_WaveBoots_C
// 0x0030 (0x0058 - 0x0028)
class UBUF_WaveBoots_C : public UMatchaCharacterBuff
{
public:
	class UClass*                                 SpeedGE;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         EarlyAirDodgeCancelLag;                            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     HitVolumeEntity;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        AirDodgeAmpMod_Rare;                               // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AirDodgeAmpMod_Epic;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AirDodgeAmpMod_Legendary;                          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBuffApplied(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnBuffRemoved(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnCharacterLand(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EFallType FallTypeBeforeLand, EMatchaCharacterMontageType MontageBeforeLand, int32 MillisecondsInAirBeforeLand, EObjectRarity BuffRarity) const;
	void OnCharacterMontageStart(class AMatchaSnapNetCharacterEntity* BuffedCharacter, float MontageDuration, EMatchaCharacterMontageType MontageType, EMatchaCharacterMontageType PreviousMontageType, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_WaveBoots_C">();
	}
	static class UBUF_WaveBoots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_WaveBoots_C>();
	}
};
static_assert(alignof(UBUF_WaveBoots_C) == 0x000008, "Wrong alignment on UBUF_WaveBoots_C");
static_assert(sizeof(UBUF_WaveBoots_C) == 0x000058, "Wrong size on UBUF_WaveBoots_C");
static_assert(offsetof(UBUF_WaveBoots_C, SpeedGE) == 0x000028, "Member 'UBUF_WaveBoots_C::SpeedGE' has a wrong offset!");
static_assert(offsetof(UBUF_WaveBoots_C, EarlyAirDodgeCancelLag) == 0x000030, "Member 'UBUF_WaveBoots_C::EarlyAirDodgeCancelLag' has a wrong offset!");
static_assert(offsetof(UBUF_WaveBoots_C, HitVolumeEntity) == 0x000038, "Member 'UBUF_WaveBoots_C::HitVolumeEntity' has a wrong offset!");
static_assert(offsetof(UBUF_WaveBoots_C, AirDodgeAmpMod_Rare) == 0x000040, "Member 'UBUF_WaveBoots_C::AirDodgeAmpMod_Rare' has a wrong offset!");
static_assert(offsetof(UBUF_WaveBoots_C, AirDodgeAmpMod_Epic) == 0x000048, "Member 'UBUF_WaveBoots_C::AirDodgeAmpMod_Epic' has a wrong offset!");
static_assert(offsetof(UBUF_WaveBoots_C, AirDodgeAmpMod_Legendary) == 0x000050, "Member 'UBUF_WaveBoots_C::AirDodgeAmpMod_Legendary' has a wrong offset!");

}

