#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_GrantDisguise

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_GrantDisguise.BUF_GrantDisguise_C
// 0x0030 (0x0058 - 0x0028)
class UBUF_GrantDisguise_C : public UMatchaCharacterBuff
{
public:
	TSubclassOf<class AMatchaHitVolumeEntity>     ExplosionHitVolumeClass;                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           PeriodicEffectTag;                                 // 0x0030(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         RareHealOverTime;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EpicHealOverTime;                                  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LegendaryHealOverTime;                             // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EMatchaCharacterMontageType>           AllowedMontageTypes;                               // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnBuffApplied(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnBuffRemoved(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnCharacterCrouchEnd(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnCharacterCrouchStart(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnCharacterMontageStart(class AMatchaSnapNetCharacterEntity* BuffedCharacter, float MontageDuration, EMatchaCharacterMontageType MontageType, EMatchaCharacterMontageType PreviousMontageType, EObjectRarity BuffRarity) const;
	void OnPostApplyIncomingHit(class AMatchaSnapNetCharacterEntity* BuffedCharacter, class AActor* HitInstigator, const struct FMatchaHitData& TakenHitData, bool bDidResistWithSuperArmor, bool bWasStunHitInsteadOfKnockBack, float CombinedDamage, float CombinedShieldDamage, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_GrantDisguise_C">();
	}
	static class UBUF_GrantDisguise_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_GrantDisguise_C>();
	}
};
static_assert(alignof(UBUF_GrantDisguise_C) == 0x000008, "Wrong alignment on UBUF_GrantDisguise_C");
static_assert(sizeof(UBUF_GrantDisguise_C) == 0x000058, "Wrong size on UBUF_GrantDisguise_C");
static_assert(offsetof(UBUF_GrantDisguise_C, ExplosionHitVolumeClass) == 0x000028, "Member 'UBUF_GrantDisguise_C::ExplosionHitVolumeClass' has a wrong offset!");
static_assert(offsetof(UBUF_GrantDisguise_C, PeriodicEffectTag) == 0x000030, "Member 'UBUF_GrantDisguise_C::PeriodicEffectTag' has a wrong offset!");
static_assert(offsetof(UBUF_GrantDisguise_C, RareHealOverTime) == 0x000038, "Member 'UBUF_GrantDisguise_C::RareHealOverTime' has a wrong offset!");
static_assert(offsetof(UBUF_GrantDisguise_C, EpicHealOverTime) == 0x00003C, "Member 'UBUF_GrantDisguise_C::EpicHealOverTime' has a wrong offset!");
static_assert(offsetof(UBUF_GrantDisguise_C, LegendaryHealOverTime) == 0x000040, "Member 'UBUF_GrantDisguise_C::LegendaryHealOverTime' has a wrong offset!");
static_assert(offsetof(UBUF_GrantDisguise_C, AllowedMontageTypes) == 0x000048, "Member 'UBUF_GrantDisguise_C::AllowedMontageTypes' has a wrong offset!");

}

