#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_IsolateTeleportStun

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BUF_IsolateTeleportStun.BUF_IsolateTeleportStun_C.OnBuffApplied
// 0x0010 (0x0010 - 0x0000)
struct BUF_IsolateTeleportStun_C_OnBuffApplied final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaShieldState                            CallFunc_GetShieldState_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_IsolateTeleportStun_C_OnBuffApplied) == 0x000008, "Wrong alignment on BUF_IsolateTeleportStun_C_OnBuffApplied");
static_assert(sizeof(BUF_IsolateTeleportStun_C_OnBuffApplied) == 0x000010, "Wrong size on BUF_IsolateTeleportStun_C_OnBuffApplied");
static_assert(offsetof(BUF_IsolateTeleportStun_C_OnBuffApplied, BuffedCharacter) == 0x000000, "Member 'BUF_IsolateTeleportStun_C_OnBuffApplied::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_IsolateTeleportStun_C_OnBuffApplied, BuffRarity) == 0x000008, "Member 'BUF_IsolateTeleportStun_C_OnBuffApplied::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_IsolateTeleportStun_C_OnBuffApplied, CallFunc_GetShieldState_ReturnValue) == 0x000009, "Member 'BUF_IsolateTeleportStun_C_OnBuffApplied::CallFunc_GetShieldState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_IsolateTeleportStun_C_OnBuffApplied, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'BUF_IsolateTeleportStun_C_OnBuffApplied::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

