#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_PoisonGloves

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_PoisonGloves.BUF_PoisonGloves_C
// 0x0038 (0x0060 - 0x0028)
class UBUF_PoisonGloves_C : public UMatchaCharacterBuff
{
public:
	struct FBuffInfo                              SlowBuffInfo;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGameplayTag                           PoisonDOTTag;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         RareDamagePerTick;                                 // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EpicDamagePerTick;                                 // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LegendaryDamagePerTick;                            // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBuffInfo                              Internal_CD_Buff_Info;                             // 0x004C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void OnPostApplyOutgoingHit(class AMatchaSnapNetCharacterEntity* BuffedCharacter, class AActor* TargetHit, class AActor* PreviousTargetHit, const struct FMatchaHitData& HitData, uint8 AppliedHitFlags, EMatchaCharacterMontageType MontageDuringHit, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_PoisonGloves_C">();
	}
	static class UBUF_PoisonGloves_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_PoisonGloves_C>();
	}
};
static_assert(alignof(UBUF_PoisonGloves_C) == 0x000008, "Wrong alignment on UBUF_PoisonGloves_C");
static_assert(sizeof(UBUF_PoisonGloves_C) == 0x000060, "Wrong size on UBUF_PoisonGloves_C");
static_assert(offsetof(UBUF_PoisonGloves_C, SlowBuffInfo) == 0x000028, "Member 'UBUF_PoisonGloves_C::SlowBuffInfo' has a wrong offset!");
static_assert(offsetof(UBUF_PoisonGloves_C, PoisonDOTTag) == 0x000038, "Member 'UBUF_PoisonGloves_C::PoisonDOTTag' has a wrong offset!");
static_assert(offsetof(UBUF_PoisonGloves_C, RareDamagePerTick) == 0x000040, "Member 'UBUF_PoisonGloves_C::RareDamagePerTick' has a wrong offset!");
static_assert(offsetof(UBUF_PoisonGloves_C, EpicDamagePerTick) == 0x000044, "Member 'UBUF_PoisonGloves_C::EpicDamagePerTick' has a wrong offset!");
static_assert(offsetof(UBUF_PoisonGloves_C, LegendaryDamagePerTick) == 0x000048, "Member 'UBUF_PoisonGloves_C::LegendaryDamagePerTick' has a wrong offset!");
static_assert(offsetof(UBUF_PoisonGloves_C, Internal_CD_Buff_Info) == 0x00004C, "Member 'UBUF_PoisonGloves_C::Internal_CD_Buff_Info' has a wrong offset!");

}

