#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_Armor_FocusArmor

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_Armor_FocusArmor.BUF_Armor_FocusArmor_C
// 0x0018 (0x0040 - 0x0028)
class UBUF_Armor_FocusArmor_C : public UMatchaCharacterBuff
{
public:
	double                                        TechIntagibilityBonusDuration;                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnergyGainOnTechRare;                              // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnergyGainOnTechEpic;                              // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnergyGainOnTechLegendary;                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBuffApplied(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnBuffRemoved(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnCharacterPeformedTech(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_Armor_FocusArmor_C">();
	}
	static class UBUF_Armor_FocusArmor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_Armor_FocusArmor_C>();
	}
};
static_assert(alignof(UBUF_Armor_FocusArmor_C) == 0x000008, "Wrong alignment on UBUF_Armor_FocusArmor_C");
static_assert(sizeof(UBUF_Armor_FocusArmor_C) == 0x000040, "Wrong size on UBUF_Armor_FocusArmor_C");
static_assert(offsetof(UBUF_Armor_FocusArmor_C, TechIntagibilityBonusDuration) == 0x000028, "Member 'UBUF_Armor_FocusArmor_C::TechIntagibilityBonusDuration' has a wrong offset!");
static_assert(offsetof(UBUF_Armor_FocusArmor_C, EnergyGainOnTechRare) == 0x000030, "Member 'UBUF_Armor_FocusArmor_C::EnergyGainOnTechRare' has a wrong offset!");
static_assert(offsetof(UBUF_Armor_FocusArmor_C, EnergyGainOnTechEpic) == 0x000034, "Member 'UBUF_Armor_FocusArmor_C::EnergyGainOnTechEpic' has a wrong offset!");
static_assert(offsetof(UBUF_Armor_FocusArmor_C, EnergyGainOnTechLegendary) == 0x000038, "Member 'UBUF_Armor_FocusArmor_C::EnergyGainOnTechLegendary' has a wrong offset!");

}

