#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_Energized_GrantDisguise

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BUF_Energized_GrantDisguise.BUF_Energized_GrantDisguise_C.OnPostApplyIncomingHit
// 0x00E0 (0x00E0 - 0x0000)
struct BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitInstigator;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMatchaHitData                         TakenHitData;                                      // 0x0010(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bDidResistWithSuperArmor;                          // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasStunHitInsteadOfKnockBack;                     // 0x0089(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CombinedDamage;                                    // 0x008C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CombinedShieldDamage;                              // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDisguiseId_ReturnValue;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnOwnedEntity_ReturnValue;             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit) == 0x000008, "Wrong alignment on BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit");
static_assert(sizeof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit) == 0x0000E0, "Wrong size on BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, BuffedCharacter) == 0x000000, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, HitInstigator) == 0x000008, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::HitInstigator' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, TakenHitData) == 0x000010, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::TakenHitData' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, bDidResistWithSuperArmor) == 0x000088, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::bDidResistWithSuperArmor' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, bWasStunHitInsteadOfKnockBack) == 0x000089, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::bWasStunHitInsteadOfKnockBack' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, CombinedDamage) == 0x00008C, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::CombinedDamage' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, CombinedShieldDamage) == 0x000090, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::CombinedShieldDamage' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, BuffRarity) == 0x000094, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, CallFunc_GetDisguiseId_ReturnValue) == 0x000098, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::CallFunc_GetDisguiseId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, CallFunc_Greater_IntInt_ReturnValue) == 0x00009C, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000A0, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, CallFunc_BooleanAND_ReturnValue) == 0x0000B8, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C0, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit, CallFunc_SpawnOwnedEntity_ReturnValue) == 0x0000D8, "Member 'BUF_Energized_GrantDisguise_C_OnPostApplyIncomingHit::CallFunc_SpawnOwnedEntity_ReturnValue' has a wrong offset!");

}

