#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_Gloves_Thief

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_Gloves_Thief.BUF_Gloves_Thief_C
// 0x0030 (0x0058 - 0x0028)
class UBUF_Gloves_Thief_C : public UMatchaCharacterBuff
{
public:
	int32                                         RequiredCoinsPerDamage;                            // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CoinBonusDamage;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CoinsToSteal;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CoinMax;                                           // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RareCoinBonusDamage;                               // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EpicCoinBonusDamage;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LegendaryCoinBonusDamage;                          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	float ModifyOutGoingHitBoxDamage(class AMatchaSnapNetCharacterEntity* BuffedCharacter, float BaseHitBoxDamage, EObjectRarity BuffRarity) const;
	void OnPostApplyOutgoingHit(class AMatchaSnapNetCharacterEntity* BuffedCharacter, class AActor* TargetHit, class AActor* PreviousTargetHit, const struct FMatchaHitData& HitData, uint8 AppliedHitFlags, EMatchaCharacterMontageType MontageDuringHit, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_Gloves_Thief_C">();
	}
	static class UBUF_Gloves_Thief_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_Gloves_Thief_C>();
	}
};
static_assert(alignof(UBUF_Gloves_Thief_C) == 0x000008, "Wrong alignment on UBUF_Gloves_Thief_C");
static_assert(sizeof(UBUF_Gloves_Thief_C) == 0x000058, "Wrong size on UBUF_Gloves_Thief_C");
static_assert(offsetof(UBUF_Gloves_Thief_C, RequiredCoinsPerDamage) == 0x000028, "Member 'UBUF_Gloves_Thief_C::RequiredCoinsPerDamage' has a wrong offset!");
static_assert(offsetof(UBUF_Gloves_Thief_C, CoinBonusDamage) == 0x000030, "Member 'UBUF_Gloves_Thief_C::CoinBonusDamage' has a wrong offset!");
static_assert(offsetof(UBUF_Gloves_Thief_C, CoinsToSteal) == 0x000038, "Member 'UBUF_Gloves_Thief_C::CoinsToSteal' has a wrong offset!");
static_assert(offsetof(UBUF_Gloves_Thief_C, CoinMax) == 0x00003C, "Member 'UBUF_Gloves_Thief_C::CoinMax' has a wrong offset!");
static_assert(offsetof(UBUF_Gloves_Thief_C, RareCoinBonusDamage) == 0x000040, "Member 'UBUF_Gloves_Thief_C::RareCoinBonusDamage' has a wrong offset!");
static_assert(offsetof(UBUF_Gloves_Thief_C, EpicCoinBonusDamage) == 0x000048, "Member 'UBUF_Gloves_Thief_C::EpicCoinBonusDamage' has a wrong offset!");
static_assert(offsetof(UBUF_Gloves_Thief_C, LegendaryCoinBonusDamage) == 0x000050, "Member 'UBUF_Gloves_Thief_C::LegendaryCoinBonusDamage' has a wrong offset!");

}

