#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_Item_GlitchBeamCast

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BUF_Item_GlitchBeamCast.BUF_Item_GlitchBeamCast_C.OnBuffApplied
// 0x0090 (0x0090 - 0x0000)
struct BUF_Item_GlitchBeamCast_C_OnBuffApplied final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaInventoryItem                   CallFunc_FromItemAsset_ReturnValue;                // 0x0010(0x0058)()
	TScriptInterface<class IInventoryProvider>    CallFunc_GetInventoryComponent_self_CastInput;     // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryComponent*              CallFunc_GetInventoryComponent_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanGlitchBeamAttack_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_TryAddItem_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_Item_GlitchBeamCast_C_OnBuffApplied) == 0x000008, "Wrong alignment on BUF_Item_GlitchBeamCast_C_OnBuffApplied");
static_assert(sizeof(BUF_Item_GlitchBeamCast_C_OnBuffApplied) == 0x000090, "Wrong size on BUF_Item_GlitchBeamCast_C_OnBuffApplied");
static_assert(offsetof(BUF_Item_GlitchBeamCast_C_OnBuffApplied, BuffedCharacter) == 0x000000, "Member 'BUF_Item_GlitchBeamCast_C_OnBuffApplied::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_Item_GlitchBeamCast_C_OnBuffApplied, BuffRarity) == 0x000008, "Member 'BUF_Item_GlitchBeamCast_C_OnBuffApplied::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_Item_GlitchBeamCast_C_OnBuffApplied, CallFunc_FromItemAsset_ReturnValue) == 0x000010, "Member 'BUF_Item_GlitchBeamCast_C_OnBuffApplied::CallFunc_FromItemAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Item_GlitchBeamCast_C_OnBuffApplied, CallFunc_GetInventoryComponent_self_CastInput) == 0x000068, "Member 'BUF_Item_GlitchBeamCast_C_OnBuffApplied::CallFunc_GetInventoryComponent_self_CastInput' has a wrong offset!");
static_assert(offsetof(BUF_Item_GlitchBeamCast_C_OnBuffApplied, CallFunc_GetInventoryComponent_ReturnValue) == 0x000078, "Member 'BUF_Item_GlitchBeamCast_C_OnBuffApplied::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Item_GlitchBeamCast_C_OnBuffApplied, CallFunc_CanGlitchBeamAttack_ReturnValue) == 0x000080, "Member 'BUF_Item_GlitchBeamCast_C_OnBuffApplied::CallFunc_CanGlitchBeamAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Item_GlitchBeamCast_C_OnBuffApplied, CallFunc_TryAddItem_ReturnValue) == 0x000084, "Member 'BUF_Item_GlitchBeamCast_C_OnBuffApplied::CallFunc_TryAddItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_Item_GlitchBeamCast_C_OnBuffApplied, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BUF_Item_GlitchBeamCast_C_OnBuffApplied::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

