#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_GrantDisguise

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function BUF_GrantDisguise.BUF_GrantDisguise_C.OnBuffApplied
// 0x0010 (0x0010 - 0x0000)
struct BUF_GrantDisguise_C_OnBuffApplied final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_GrantDisguise_C_OnBuffApplied) == 0x000008, "Wrong alignment on BUF_GrantDisguise_C_OnBuffApplied");
static_assert(sizeof(BUF_GrantDisguise_C_OnBuffApplied) == 0x000010, "Wrong size on BUF_GrantDisguise_C_OnBuffApplied");
static_assert(offsetof(BUF_GrantDisguise_C_OnBuffApplied, BuffedCharacter) == 0x000000, "Member 'BUF_GrantDisguise_C_OnBuffApplied::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnBuffApplied, BuffRarity) == 0x000008, "Member 'BUF_GrantDisguise_C_OnBuffApplied::BuffRarity' has a wrong offset!");

// Function BUF_GrantDisguise.BUF_GrantDisguise_C.OnBuffRemoved
// 0x0010 (0x0010 - 0x0000)
struct BUF_GrantDisguise_C_OnBuffRemoved final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_GrantDisguise_C_OnBuffRemoved) == 0x000008, "Wrong alignment on BUF_GrantDisguise_C_OnBuffRemoved");
static_assert(sizeof(BUF_GrantDisguise_C_OnBuffRemoved) == 0x000010, "Wrong size on BUF_GrantDisguise_C_OnBuffRemoved");
static_assert(offsetof(BUF_GrantDisguise_C_OnBuffRemoved, BuffedCharacter) == 0x000000, "Member 'BUF_GrantDisguise_C_OnBuffRemoved::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnBuffRemoved, BuffRarity) == 0x000008, "Member 'BUF_GrantDisguise_C_OnBuffRemoved::BuffRarity' has a wrong offset!");

// Function BUF_GrantDisguise.BUF_GrantDisguise_C.OnCharacterCrouchEnd
// 0x0010 (0x0010 - 0x0000)
struct BUF_GrantDisguise_C_OnCharacterCrouchEnd final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSuperArmor_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisguised_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_GrantDisguise_C_OnCharacterCrouchEnd) == 0x000008, "Wrong alignment on BUF_GrantDisguise_C_OnCharacterCrouchEnd");
static_assert(sizeof(BUF_GrantDisguise_C_OnCharacterCrouchEnd) == 0x000010, "Wrong size on BUF_GrantDisguise_C_OnCharacterCrouchEnd");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchEnd, BuffedCharacter) == 0x000000, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchEnd::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchEnd, BuffRarity) == 0x000008, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchEnd::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchEnd, CallFunc_HasSuperArmor_ReturnValue) == 0x000009, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchEnd::CallFunc_HasSuperArmor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchEnd, CallFunc_IsDisguised_ReturnValue) == 0x00000A, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchEnd::CallFunc_IsDisguised_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchEnd, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchEnd::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BUF_GrantDisguise.BUF_GrantDisguise_C.OnCharacterCrouchStart
// 0x0010 (0x0010 - 0x0000)
struct BUF_GrantDisguise_C_OnCharacterCrouchStart final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDashing_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_GrantDisguise_C_OnCharacterCrouchStart) == 0x000008, "Wrong alignment on BUF_GrantDisguise_C_OnCharacterCrouchStart");
static_assert(sizeof(BUF_GrantDisguise_C_OnCharacterCrouchStart) == 0x000010, "Wrong size on BUF_GrantDisguise_C_OnCharacterCrouchStart");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchStart, BuffedCharacter) == 0x000000, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchStart::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchStart, BuffRarity) == 0x000008, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchStart::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchStart, Temp_byte_Variable) == 0x000009, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchStart::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchStart, CallFunc_IsDashing_ReturnValue) == 0x00000A, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchStart::CallFunc_IsDashing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterCrouchStart, K2Node_Select_Default) == 0x00000C, "Member 'BUF_GrantDisguise_C_OnCharacterCrouchStart::K2Node_Select_Default' has a wrong offset!");

// Function BUF_GrantDisguise.BUF_GrantDisguise_C.OnCharacterMontageStart
// 0x0010 (0x0010 - 0x0000)
struct BUF_GrantDisguise_C_OnCharacterMontageStart final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         MontageDuration;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaCharacterMontageType                   MontageType;                                       // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaCharacterMontageType                   PreviousMontageType;                               // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_GrantDisguise_C_OnCharacterMontageStart) == 0x000008, "Wrong alignment on BUF_GrantDisguise_C_OnCharacterMontageStart");
static_assert(sizeof(BUF_GrantDisguise_C_OnCharacterMontageStart) == 0x000010, "Wrong size on BUF_GrantDisguise_C_OnCharacterMontageStart");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterMontageStart, BuffedCharacter) == 0x000000, "Member 'BUF_GrantDisguise_C_OnCharacterMontageStart::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterMontageStart, MontageDuration) == 0x000008, "Member 'BUF_GrantDisguise_C_OnCharacterMontageStart::MontageDuration' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterMontageStart, MontageType) == 0x00000C, "Member 'BUF_GrantDisguise_C_OnCharacterMontageStart::MontageType' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterMontageStart, PreviousMontageType) == 0x00000D, "Member 'BUF_GrantDisguise_C_OnCharacterMontageStart::PreviousMontageType' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterMontageStart, BuffRarity) == 0x00000E, "Member 'BUF_GrantDisguise_C_OnCharacterMontageStart::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnCharacterMontageStart, CallFunc_Array_Contains_ReturnValue) == 0x00000F, "Member 'BUF_GrantDisguise_C_OnCharacterMontageStart::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BUF_GrantDisguise.BUF_GrantDisguise_C.OnPostApplyIncomingHit
// 0x00A0 (0x00A0 - 0x0000)
struct BUF_GrantDisguise_C_OnPostApplyIncomingHit final
{
public:
	class AMatchaSnapNetCharacterEntity*          BuffedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitInstigator;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMatchaHitData                         TakenHitData;                                      // 0x0010(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bDidResistWithSuperArmor;                          // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasStunHitInsteadOfKnockBack;                     // 0x0089(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CombinedDamage;                                    // 0x008C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CombinedShieldDamage;                              // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectRarity                                 BuffRarity;                                        // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUF_GrantDisguise_C_OnPostApplyIncomingHit) == 0x000008, "Wrong alignment on BUF_GrantDisguise_C_OnPostApplyIncomingHit");
static_assert(sizeof(BUF_GrantDisguise_C_OnPostApplyIncomingHit) == 0x0000A0, "Wrong size on BUF_GrantDisguise_C_OnPostApplyIncomingHit");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, BuffedCharacter) == 0x000000, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::BuffedCharacter' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, HitInstigator) == 0x000008, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::HitInstigator' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, TakenHitData) == 0x000010, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::TakenHitData' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, bDidResistWithSuperArmor) == 0x000088, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::bDidResistWithSuperArmor' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, bWasStunHitInsteadOfKnockBack) == 0x000089, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::bWasStunHitInsteadOfKnockBack' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, CombinedDamage) == 0x00008C, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::CombinedDamage' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, CombinedShieldDamage) == 0x000090, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::CombinedShieldDamage' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, BuffRarity) == 0x000094, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::BuffRarity' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000095, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BUF_GrantDisguise_C_OnPostApplyIncomingHit, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'BUF_GrantDisguise_C_OnPostApplyIncomingHit::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

