#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_GrappleGloves

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_GrappleGloves.BUF_GrappleGloves_C
// 0x0018 (0x0040 - 0x0028)
class UBUF_GrappleGloves_C : public UMatchaCharacterBuff
{
public:
	class UClass*                                 EffectAmountGE;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         EnergyGenAmp;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DashGrabAmpRare;                                   // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DashGrabAmpEpic;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DashGrabAmpLegendary;                              // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBuffApplied(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnBuffRemoved(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_GrappleGloves_C">();
	}
	static class UBUF_GrappleGloves_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_GrappleGloves_C>();
	}
};
static_assert(alignof(UBUF_GrappleGloves_C) == 0x000008, "Wrong alignment on UBUF_GrappleGloves_C");
static_assert(sizeof(UBUF_GrappleGloves_C) == 0x000040, "Wrong size on UBUF_GrappleGloves_C");
static_assert(offsetof(UBUF_GrappleGloves_C, EffectAmountGE) == 0x000028, "Member 'UBUF_GrappleGloves_C::EffectAmountGE' has a wrong offset!");
static_assert(offsetof(UBUF_GrappleGloves_C, EnergyGenAmp) == 0x000030, "Member 'UBUF_GrappleGloves_C::EnergyGenAmp' has a wrong offset!");
static_assert(offsetof(UBUF_GrappleGloves_C, DashGrabAmpRare) == 0x000034, "Member 'UBUF_GrappleGloves_C::DashGrabAmpRare' has a wrong offset!");
static_assert(offsetof(UBUF_GrappleGloves_C, DashGrabAmpEpic) == 0x000038, "Member 'UBUF_GrappleGloves_C::DashGrabAmpEpic' has a wrong offset!");
static_assert(offsetof(UBUF_GrappleGloves_C, DashGrabAmpLegendary) == 0x00003C, "Member 'UBUF_GrappleGloves_C::DashGrabAmpLegendary' has a wrong offset!");

}

