#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_OnUptiltFireball_Base

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_OnUptiltFireball_Base.BUF_OnUptiltFireball_Base_C
// 0x0018 (0x0040 - 0x0028)
class UBUF_OnUptiltFireball_Base_C : public UMatchaCharacterBuff
{
public:
	class UClass*                                 RareProjectileClass;                               // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 EpicProjectileClass;                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LegendaryProjectileClass;                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnMontageSpawnedHitBox(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EMatchaCharacterMontageType MontageType, int32 MontageHitBoxCount, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_OnUptiltFireball_Base_C">();
	}
	static class UBUF_OnUptiltFireball_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_OnUptiltFireball_Base_C>();
	}
};
static_assert(alignof(UBUF_OnUptiltFireball_Base_C) == 0x000008, "Wrong alignment on UBUF_OnUptiltFireball_Base_C");
static_assert(sizeof(UBUF_OnUptiltFireball_Base_C) == 0x000040, "Wrong size on UBUF_OnUptiltFireball_Base_C");
static_assert(offsetof(UBUF_OnUptiltFireball_Base_C, RareProjectileClass) == 0x000028, "Member 'UBUF_OnUptiltFireball_Base_C::RareProjectileClass' has a wrong offset!");
static_assert(offsetof(UBUF_OnUptiltFireball_Base_C, EpicProjectileClass) == 0x000030, "Member 'UBUF_OnUptiltFireball_Base_C::EpicProjectileClass' has a wrong offset!");
static_assert(offsetof(UBUF_OnUptiltFireball_Base_C, LegendaryProjectileClass) == 0x000038, "Member 'UBUF_OnUptiltFireball_Base_C::LegendaryProjectileClass' has a wrong offset!");

}

