#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUF_LootSuit

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BUF_LootSuit.BUF_LootSuit_C
// 0x0020 (0x0048 - 0x0028)
class UBUF_LootSuit_C : public UMatchaCharacterBuff
{
public:
	class UClass*                                 RareItemStackAmpGE;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        RareItemStackAmpAmount;                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RareCoinAmpAmount;                                 // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EpicCoinAmpAmount;                                 // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LegendaryCoinAmpAmount;                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBuffApplied(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;
	void OnBuffRemoved(class AMatchaSnapNetCharacterEntity* BuffedCharacter, EObjectRarity BuffRarity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUF_LootSuit_C">();
	}
	static class UBUF_LootSuit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUF_LootSuit_C>();
	}
};
static_assert(alignof(UBUF_LootSuit_C) == 0x000008, "Wrong alignment on UBUF_LootSuit_C");
static_assert(sizeof(UBUF_LootSuit_C) == 0x000048, "Wrong size on UBUF_LootSuit_C");
static_assert(offsetof(UBUF_LootSuit_C, RareItemStackAmpGE) == 0x000028, "Member 'UBUF_LootSuit_C::RareItemStackAmpGE' has a wrong offset!");
static_assert(offsetof(UBUF_LootSuit_C, RareItemStackAmpAmount) == 0x000030, "Member 'UBUF_LootSuit_C::RareItemStackAmpAmount' has a wrong offset!");
static_assert(offsetof(UBUF_LootSuit_C, RareCoinAmpAmount) == 0x000038, "Member 'UBUF_LootSuit_C::RareCoinAmpAmount' has a wrong offset!");
static_assert(offsetof(UBUF_LootSuit_C, EpicCoinAmpAmount) == 0x00003C, "Member 'UBUF_LootSuit_C::EpicCoinAmpAmount' has a wrong offset!");
static_assert(offsetof(UBUF_LootSuit_C, LegendaryCoinAmpAmount) == 0x000040, "Member 'UBUF_LootSuit_C::LegendaryCoinAmpAmount' has a wrong offset!");

}

