#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterRenderer_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.GetCompassIndicatorWidgetClass
// 0x0008 (0x0008 - 0x0000)
struct CharacterRenderer_Base_C_GetCompassIndicatorWidgetClass final
{
public:
	TSubclassOf<class UOdyCompassIndicatorWidget> ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_GetCompassIndicatorWidgetClass) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_GetCompassIndicatorWidgetClass");
static_assert(sizeof(CharacterRenderer_Base_C_GetCompassIndicatorWidgetClass) == 0x000008, "Wrong size on CharacterRenderer_Base_C_GetCompassIndicatorWidgetClass");
static_assert(offsetof(CharacterRenderer_Base_C_GetCompassIndicatorWidgetClass, ReturnValue) == 0x000000, "Member 'CharacterRenderer_Base_C_GetCompassIndicatorWidgetClass::ReturnValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.GetIndicatorWidgetClass
// 0x0008 (0x0008 - 0x0000)
struct CharacterRenderer_Base_C_GetIndicatorWidgetClass final
{
public:
	TSubclassOf<class UOdyMinimapIndicatorWidget> ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_GetIndicatorWidgetClass) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_GetIndicatorWidgetClass");
static_assert(sizeof(CharacterRenderer_Base_C_GetIndicatorWidgetClass) == 0x000008, "Wrong size on CharacterRenderer_Base_C_GetIndicatorWidgetClass");
static_assert(offsetof(CharacterRenderer_Base_C_GetIndicatorWidgetClass, ReturnValue) == 0x000000, "Member 'CharacterRenderer_Base_C_GetIndicatorWidgetClass::ReturnValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.TooltipUI_OnSpectatedPlayerChanged
// 0x0008 (0x0008 - 0x0000)
struct CharacterRenderer_Base_C_TooltipUI_OnSpectatedPlayerChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_TooltipUI_OnSpectatedPlayerChanged) == 0x000004, "Wrong alignment on CharacterRenderer_Base_C_TooltipUI_OnSpectatedPlayerChanged");
static_assert(sizeof(CharacterRenderer_Base_C_TooltipUI_OnSpectatedPlayerChanged) == 0x000008, "Wrong size on CharacterRenderer_Base_C_TooltipUI_OnSpectatedPlayerChanged");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_OnSpectatedPlayerChanged, OldValue) == 0x000000, "Member 'CharacterRenderer_Base_C_TooltipUI_OnSpectatedPlayerChanged::OldValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_OnSpectatedPlayerChanged, NewValue) == 0x000004, "Member 'CharacterRenderer_Base_C_TooltipUI_OnSpectatedPlayerChanged::NewValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.TooltipUI_IntroDelayComplete
// 0x0010 (0x0010 - 0x0000)
struct CharacterRenderer_Base_C_TooltipUI_IntroDelayComplete final
{
public:
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_TooltipUI_IntroDelayComplete) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_TooltipUI_IntroDelayComplete");
static_assert(sizeof(CharacterRenderer_Base_C_TooltipUI_IntroDelayComplete) == 0x000010, "Wrong size on CharacterRenderer_Base_C_TooltipUI_IntroDelayComplete");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_IntroDelayComplete, CallFunc_GetUIDataModel_ReturnValue) == 0x000000, "Member 'CharacterRenderer_Base_C_TooltipUI_IntroDelayComplete::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_IntroDelayComplete, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'CharacterRenderer_Base_C_TooltipUI_IntroDelayComplete::CallFunc_GetWidget_ReturnValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.TooltipUI_CheckForTooltip
// 0x00A8 (0x00A8 - 0x0000)
struct CharacterRenderer_Base_C_TooltipUI_CheckForTooltip final
{
public:
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemTooltip_C*                     CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_2;                  // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue;         // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_TooltipUI_CheckForTooltip");
static_assert(sizeof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip) == 0x0000A8, "Wrong size on CharacterRenderer_Base_C_TooltipUI_CheckForTooltip");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_GetTimeSeconds_ReturnValue) == 0x000000, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000008, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000009, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000010, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x000038, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_Create_ReturnValue) == 0x000058, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_GetWidget_ReturnValue) == 0x000060, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_GetWidget_ReturnValue_1) == 0x000070, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_GetUIDataModel_ReturnValue) == 0x000078, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_GetWidget_ReturnValue_2) == 0x000080, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_GetWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_IntBinding_GetValue_ReturnValue) == 0x00008C, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_IntBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_IsVisible_ReturnValue) == 0x000090, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_BoolBinding_GetValue_ReturnValue) == 0x000091, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_BoolBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_IsValid_ReturnValue_2) == 0x000092, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000093, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_BooleanAND_ReturnValue_1) == 0x000094, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_BooleanAND_ReturnValue_2) == 0x000095, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_TooltipUI_CheckForTooltip, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x0000A0, "Member 'CharacterRenderer_Base_C_TooltipUI_CheckForTooltip::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.SetupTooltipUI
// 0x0030 (0x0030 - 0x0000)
struct CharacterRenderer_Base_C_SetupTooltipUI final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_SetupTooltipUI) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_SetupTooltipUI");
static_assert(sizeof(CharacterRenderer_Base_C_SetupTooltipUI) == 0x000030, "Wrong size on CharacterRenderer_Base_C_SetupTooltipUI");
static_assert(offsetof(CharacterRenderer_Base_C_SetupTooltipUI, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'CharacterRenderer_Base_C_SetupTooltipUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_SetupTooltipUI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'CharacterRenderer_Base_C_SetupTooltipUI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_SetupTooltipUI, CallFunc_GetUIDataModel_ReturnValue) == 0x000020, "Member 'CharacterRenderer_Base_C_SetupTooltipUI::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_SetupTooltipUI, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'CharacterRenderer_Base_C_SetupTooltipUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.HandleCrackedSFX
// 0x0010 (0x0010 - 0x0000)
struct CharacterRenderer_Base_C_HandleCrackedSFX final
{
public:
	double                                        Damage_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventRendererWithInstigator_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_HandleCrackedSFX) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_HandleCrackedSFX");
static_assert(sizeof(CharacterRenderer_Base_C_HandleCrackedSFX) == 0x000010, "Wrong size on CharacterRenderer_Base_C_HandleCrackedSFX");
static_assert(offsetof(CharacterRenderer_Base_C_HandleCrackedSFX, Damage_0) == 0x000000, "Member 'CharacterRenderer_Base_C_HandleCrackedSFX::Damage_0' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_HandleCrackedSFX, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'CharacterRenderer_Base_C_HandleCrackedSFX::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_HandleCrackedSFX, CallFunc_AkEventRendererWithInstigator_ReturnValue) == 0x00000C, "Member 'CharacterRenderer_Base_C_HandleCrackedSFX::CallFunc_AkEventRendererWithInstigator_ReturnValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.FinishGlitchCannonCeremony
// 0x0098 (0x0098 - 0x0000)
struct CharacterRenderer_Base_C_FinishGlitchCannonCeremony final
{
public:
	struct FFrameNumber                           K2Node_MakeStruct_FrameNumber;                     // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlayToParams        K2Node_MakeStruct_MovieSceneSequencePlayToParams;  // 0x0004(0x0001)(NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameTime                             K2Node_MakeStruct_FrameTime;                       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams; // 0x0010(0x0038)()
	struct FFrameNumber                           K2Node_MakeStruct_FrameNumber_1;                   // 0x0048(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EnableExternalViewTargetControl_ReturnValue; // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameTime                             K2Node_MakeStruct_FrameTime_1;                     // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1; // 0x0058(0x0038)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_FinishGlitchCannonCeremony");
static_assert(sizeof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony) == 0x000098, "Wrong size on CharacterRenderer_Base_C_FinishGlitchCannonCeremony");
static_assert(offsetof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony, K2Node_MakeStruct_FrameNumber) == 0x000000, "Member 'CharacterRenderer_Base_C_FinishGlitchCannonCeremony::K2Node_MakeStruct_FrameNumber' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequencePlayToParams) == 0x000004, "Member 'CharacterRenderer_Base_C_FinishGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequencePlayToParams' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony, K2Node_MakeStruct_FrameTime) == 0x000008, "Member 'CharacterRenderer_Base_C_FinishGlitchCannonCeremony::K2Node_MakeStruct_FrameTime' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequencePlaybackParams) == 0x000010, "Member 'CharacterRenderer_Base_C_FinishGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequencePlaybackParams' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony, K2Node_MakeStruct_FrameNumber_1) == 0x000048, "Member 'CharacterRenderer_Base_C_FinishGlitchCannonCeremony::K2Node_MakeStruct_FrameNumber_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony, CallFunc_EnableExternalViewTargetControl_ReturnValue) == 0x00004C, "Member 'CharacterRenderer_Base_C_FinishGlitchCannonCeremony::CallFunc_EnableExternalViewTargetControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony, K2Node_MakeStruct_FrameTime_1) == 0x000050, "Member 'CharacterRenderer_Base_C_FinishGlitchCannonCeremony::K2Node_MakeStruct_FrameTime_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1) == 0x000058, "Member 'CharacterRenderer_Base_C_FinishGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_FinishGlitchCannonCeremony, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'CharacterRenderer_Base_C_FinishGlitchCannonCeremony::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.LoopGlitchCannonCeremony
// 0x00A8 (0x00A8 - 0x0000)
struct CharacterRenderer_Base_C_LoopGlitchCannonCeremony final
{
public:
	struct FFrameNumber                           K2Node_MakeStruct_FrameNumber;                     // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlayToParams        K2Node_MakeStruct_MovieSceneSequencePlayToParams;  // 0x0004(0x0001)(NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameTime                             K2Node_MakeStruct_FrameTime;                       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFrameNumber                           K2Node_MakeStruct_FrameNumber_1;                   // 0x0010(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams; // 0x0018(0x0038)()
	struct FFrameTime                             K2Node_MakeStruct_FrameTime_1;                     // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1; // 0x0060(0x0038)()
	class ABP_PlayerCameraManager_C*              K2Node_DynamicCast_AsBP_Player_Camera_Manager;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_LoopGlitchCannonCeremony");
static_assert(sizeof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony) == 0x0000A8, "Wrong size on CharacterRenderer_Base_C_LoopGlitchCannonCeremony");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, K2Node_MakeStruct_FrameNumber) == 0x000000, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::K2Node_MakeStruct_FrameNumber' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequencePlayToParams) == 0x000004, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequencePlayToParams' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, K2Node_MakeStruct_FrameTime) == 0x000008, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::K2Node_MakeStruct_FrameTime' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, K2Node_MakeStruct_FrameNumber_1) == 0x000010, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::K2Node_MakeStruct_FrameNumber_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequencePlaybackParams) == 0x000018, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequencePlaybackParams' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, K2Node_MakeStruct_FrameTime_1) == 0x000050, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::K2Node_MakeStruct_FrameTime_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000058, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1) == 0x000060, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, K2Node_DynamicCast_AsBP_Player_Camera_Manager) == 0x000098, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::K2Node_DynamicCast_AsBP_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_LoopGlitchCannonCeremony, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'CharacterRenderer_Base_C_LoopGlitchCannonCeremony::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.StartGlitchCannonCeremony
// 0x00C0 (0x00C0 - 0x0000)
struct CharacterRenderer_Base_C_StartGlitchCannonCeremony final
{
public:
	struct FMovieSceneSequencePlayToParams        K2Node_MakeStruct_MovieSceneSequencePlayToParams;  // 0x0000(0x0001)(NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameNumber                           K2Node_MakeStruct_FrameNumber;                     // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallySpectated_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameTime                             K2Node_MakeStruct_FrameTime;                       // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams; // 0x0018(0x0038)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EnableExternalViewTargetControl_ReturnValue; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCameraManager_C*              K2Node_DynamicCast_AsBP_Player_Camera_Manager;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	struct FMovieSceneSequenceLoopCount           K2Node_MakeStruct_MovieSceneSequenceLoopCount;     // 0x0080(0x0004)(NoDestructor)
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x0084(0x0028)(NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_StartGlitchCannonCeremony) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_StartGlitchCannonCeremony");
static_assert(sizeof(CharacterRenderer_Base_C_StartGlitchCannonCeremony) == 0x0000C0, "Wrong size on CharacterRenderer_Base_C_StartGlitchCannonCeremony");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequencePlayToParams) == 0x000000, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequencePlayToParams' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, K2Node_MakeStruct_FrameNumber) == 0x000004, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::K2Node_MakeStruct_FrameNumber' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, CallFunc_IsLocallySpectated_ReturnValue) == 0x000008, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::CallFunc_IsLocallySpectated_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, K2Node_MakeStruct_FrameTime) == 0x00000C, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::K2Node_MakeStruct_FrameTime' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequencePlaybackParams) == 0x000018, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequencePlaybackParams' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, CallFunc_BooleanOR_ReturnValue) == 0x000050, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, CallFunc_EnableExternalViewTargetControl_ReturnValue) == 0x000051, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::CallFunc_EnableExternalViewTargetControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000058, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, K2Node_DynamicCast_AsBP_Player_Camera_Manager) == 0x000060, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::K2Node_DynamicCast_AsBP_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, K2Node_MakeArray_Array) == 0x000070, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequenceLoopCount) == 0x000080, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequenceLoopCount' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, K2Node_MakeStruct_MovieSceneSequencePlaybackSettings) == 0x000084, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::K2Node_MakeStruct_MovieSceneSequencePlaybackSettings' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x0000B0, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_StartGlitchCannonCeremony, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x0000B8, "Member 'CharacterRenderer_Base_C_StartGlitchCannonCeremony::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.HandleObscuraPortalSFX
// 0x000C (0x000C - 0x0000)
struct CharacterRenderer_Base_C_HandleObscuraPortalSFX final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventRenderer_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventRenderer_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_HandleObscuraPortalSFX) == 0x000004, "Wrong alignment on CharacterRenderer_Base_C_HandleObscuraPortalSFX");
static_assert(sizeof(CharacterRenderer_Base_C_HandleObscuraPortalSFX) == 0x00000C, "Wrong size on CharacterRenderer_Base_C_HandleObscuraPortalSFX");
static_assert(offsetof(CharacterRenderer_Base_C_HandleObscuraPortalSFX, bActive) == 0x000000, "Member 'CharacterRenderer_Base_C_HandleObscuraPortalSFX::bActive' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_HandleObscuraPortalSFX, CallFunc_AkEventRenderer_ReturnValue) == 0x000004, "Member 'CharacterRenderer_Base_C_HandleObscuraPortalSFX::CallFunc_AkEventRenderer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_HandleObscuraPortalSFX, CallFunc_AkEventRenderer_ReturnValue_1) == 0x000008, "Member 'CharacterRenderer_Base_C_HandleObscuraPortalSFX::CallFunc_AkEventRenderer_ReturnValue_1' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.UpdateSoulFace
// 0x0040 (0x0040 - 0x0000)
struct CharacterRenderer_Base_C_UpdateSoulFace final
{
public:
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_UpdateSoulFace) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_UpdateSoulFace");
static_assert(sizeof(CharacterRenderer_Base_C_UpdateSoulFace) == 0x000040, "Wrong size on CharacterRenderer_Base_C_UpdateSoulFace");
static_assert(offsetof(CharacterRenderer_Base_C_UpdateSoulFace, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000000, "Member 'CharacterRenderer_Base_C_UpdateSoulFace::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_UpdateSoulFace, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'CharacterRenderer_Base_C_UpdateSoulFace::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_UpdateSoulFace, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'CharacterRenderer_Base_C_UpdateSoulFace::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_UpdateSoulFace, CallFunc_IsActive_ReturnValue) == 0x000018, "Member 'CharacterRenderer_Base_C_UpdateSoulFace::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_UpdateSoulFace, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'CharacterRenderer_Base_C_UpdateSoulFace::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_UpdateSoulFace, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000038, "Member 'CharacterRenderer_Base_C_UpdateSoulFace::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_UpdateSoulFace, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x00003C, "Member 'CharacterRenderer_Base_C_UpdateSoulFace::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.Play Glitch Grave FX
// 0x0028 (0x0028 - 0x0000)
struct CharacterRenderer_Base_C_Play_Glitch_Grave_FX final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_Play_Glitch_Grave_FX) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_Play_Glitch_Grave_FX");
static_assert(sizeof(CharacterRenderer_Base_C_Play_Glitch_Grave_FX) == 0x000028, "Wrong size on CharacterRenderer_Base_C_Play_Glitch_Grave_FX");
static_assert(offsetof(CharacterRenderer_Base_C_Play_Glitch_Grave_FX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'CharacterRenderer_Base_C_Play_Glitch_Grave_FX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_Play_Glitch_Grave_FX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000018, "Member 'CharacterRenderer_Base_C_Play_Glitch_Grave_FX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_Play_Glitch_Grave_FX, CallFunc_AkEventLocation_ReturnValue) == 0x000020, "Member 'CharacterRenderer_Base_C_Play_Glitch_Grave_FX::CallFunc_AkEventLocation_ReturnValue' has a wrong offset!");

// Function CharacterRenderer_Base.CharacterRenderer_Base_C.PlayDeathVFX
// 0x0138 (0x0138 - 0x0000)
struct CharacterRenderer_Base_C_PlayDeathVFX final
{
public:
	class UNiagaraSystem*                         Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_1;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_2;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_3;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECharacterKnockOutType                        Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventRenderer_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallySpectated_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable_4;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECharacterKnockOutType                        Temp_byte_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaSnapNetGameEntity*               CallFunc_Get_ReturnValue;                          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMatchaMatchPhase                             CallFunc_GetCurrentMatchPhase_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_1;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_ReturnValue_1;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_ReturnValue_2;            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayWorldCameraShake_OuterRadius_ImplicitCast; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRenderer_Base_C_PlayDeathVFX) == 0x000008, "Wrong alignment on CharacterRenderer_Base_C_PlayDeathVFX");
static_assert(sizeof(CharacterRenderer_Base_C_PlayDeathVFX) == 0x000138, "Wrong size on CharacterRenderer_Base_C_PlayDeathVFX");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, Temp_object_Variable) == 0x000000, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, Temp_object_Variable_1) == 0x000008, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, Temp_object_Variable_2) == 0x000010, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, Temp_object_Variable_3) == 0x000018, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, Temp_byte_Variable) == 0x000020, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000028, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_AkEventRenderer_ReturnValue) == 0x000040, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_AkEventRenderer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_IsLocallySpectated_ReturnValue) == 0x000044, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_IsLocallySpectated_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, Temp_object_Variable_4) == 0x000048, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, K2Node_Select_Default) == 0x000060, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_FClamp_ReturnValue) == 0x000070, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_Normal_ReturnValue) == 0x000078, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_Lerp_ReturnValue) == 0x000090, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000098, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000B0, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, Temp_byte_Variable_1) == 0x0000C8, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_Get_ReturnValue) == 0x0000D0, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_GetCurrentMatchPhase_ReturnValue) == 0x0000D8, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_GetCurrentMatchPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, K2Node_Select_Default_1) == 0x0000E0, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E8, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_IsValid_ReturnValue) == 0x0000E9, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRenderer_Base_C_PlayDeathVFX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'CharacterRenderer_Base_C_PlayDeathVFX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
