#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_BlockingWall_AtlasChambers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SnapNet_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_BlockingWall_AtlasChambers.E_BlockingWall_AtlasChambers_C
// 0x00A8 (0x0420 - 0x0378)
class AE_BlockingWall_AtlasChambers_C final : public AMatchaSnapNetEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PlayerCollision;                                   // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSnapNetPropertyVector                 CollisionExtents;                                  // 0x0398(0x0080)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          DidSetInitialColliderExtents;                      // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__E_TrapRoomDoor_EntityComponent_K2Node_ComponentBoundEvent_0_SnapNetPropertiesModifiedDynamicDelegate__DelegateSignature();
	void ExecuteUbergraph_E_BlockingWall_AtlasChambers(int32 EntryPoint);
	void OnEnabledChanged(bool bOldEnabled, bool bNewEnabled);
	void UpdateCollision();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_BlockingWall_AtlasChambers_C">();
	}
	static class AE_BlockingWall_AtlasChambers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_BlockingWall_AtlasChambers_C>();
	}
};
static_assert(alignof(AE_BlockingWall_AtlasChambers_C) == 0x000008, "Wrong alignment on AE_BlockingWall_AtlasChambers_C");
static_assert(sizeof(AE_BlockingWall_AtlasChambers_C) == 0x000420, "Wrong size on AE_BlockingWall_AtlasChambers_C");
static_assert(offsetof(AE_BlockingWall_AtlasChambers_C, UberGraphFrame) == 0x000378, "Member 'AE_BlockingWall_AtlasChambers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AE_BlockingWall_AtlasChambers_C, StaticMesh) == 0x000380, "Member 'AE_BlockingWall_AtlasChambers_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AE_BlockingWall_AtlasChambers_C, PlayerCollision) == 0x000388, "Member 'AE_BlockingWall_AtlasChambers_C::PlayerCollision' has a wrong offset!");
static_assert(offsetof(AE_BlockingWall_AtlasChambers_C, DefaultSceneRoot) == 0x000390, "Member 'AE_BlockingWall_AtlasChambers_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AE_BlockingWall_AtlasChambers_C, CollisionExtents) == 0x000398, "Member 'AE_BlockingWall_AtlasChambers_C::CollisionExtents' has a wrong offset!");
static_assert(offsetof(AE_BlockingWall_AtlasChambers_C, DidSetInitialColliderExtents) == 0x000418, "Member 'AE_BlockingWall_AtlasChambers_C::DidSetInitialColliderExtents' has a wrong offset!");

}

