#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_ChallengePickupCoin

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Matcha_structs.hpp"
#include "Pickup_Coin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_ChallengePickupCoin.E_ChallengePickupCoin_C
// 0x0030 (0x03F0 - 0x03C0)
class AE_ChallengePickupCoin_C final : public APickup_Coin_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_E_ChallengePickupCoin_C;            // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere1;                                           // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          EnablePickupOnMatchStart;                          // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaGameplayEvent                   GameplayEventToBroadcast;                          // 0x03D4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGameplayTag                           ChannelToBroadcastEventTo;                         // 0x03E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_E_ChallengePickupCoin(int32 EntryPoint);
	struct FGameplayTag GetBroadcastChannel();
	void ReceiveBeginPlay();
	void TryPickUpBy(class AActor* Instigator_0, bool* Success);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_ChallengePickupCoin_C">();
	}
	static class AE_ChallengePickupCoin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_ChallengePickupCoin_C>();
	}
};
static_assert(alignof(AE_ChallengePickupCoin_C) == 0x000008, "Wrong alignment on AE_ChallengePickupCoin_C");
static_assert(sizeof(AE_ChallengePickupCoin_C) == 0x0003F0, "Wrong size on AE_ChallengePickupCoin_C");
static_assert(offsetof(AE_ChallengePickupCoin_C, UberGraphFrame_E_ChallengePickupCoin_C) == 0x0003C0, "Member 'AE_ChallengePickupCoin_C::UberGraphFrame_E_ChallengePickupCoin_C' has a wrong offset!");
static_assert(offsetof(AE_ChallengePickupCoin_C, Sphere1) == 0x0003C8, "Member 'AE_ChallengePickupCoin_C::Sphere1' has a wrong offset!");
static_assert(offsetof(AE_ChallengePickupCoin_C, EnablePickupOnMatchStart) == 0x0003D0, "Member 'AE_ChallengePickupCoin_C::EnablePickupOnMatchStart' has a wrong offset!");
static_assert(offsetof(AE_ChallengePickupCoin_C, GameplayEventToBroadcast) == 0x0003D4, "Member 'AE_ChallengePickupCoin_C::GameplayEventToBroadcast' has a wrong offset!");
static_assert(offsetof(AE_ChallengePickupCoin_C, ChannelToBroadcastEventTo) == 0x0003E8, "Member 'AE_ChallengePickupCoin_C::ChannelToBroadcastEventTo' has a wrong offset!");

}

