#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_ChallengeBreakable

#include "Basic.hpp"

#include "E_BreakableBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_ChallengeBreakable.E_ChallengeBreakable_C
// 0x0018 (0x04D8 - 0x04C0)
class AE_ChallengeBreakable_C final : public AE_BreakableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_E_ChallengeBreakable_C;             // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableCollisionOnMatchStart;                       // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__E_EncounterBreakable_EntityComponent_K2Node_ComponentBoundEvent_0_SnapNetPropertiesModifiedDynamicDelegate__DelegateSignature();
	void ExecuteUbergraph_E_ChallengeBreakable(int32 EntryPoint);
	void OnEnabledChanged(bool bOldEnabled, bool bNewEnabled);
	void UpdateCollision();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_ChallengeBreakable_C">();
	}
	static class AE_ChallengeBreakable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_ChallengeBreakable_C>();
	}
};
static_assert(alignof(AE_ChallengeBreakable_C) == 0x000008, "Wrong alignment on AE_ChallengeBreakable_C");
static_assert(sizeof(AE_ChallengeBreakable_C) == 0x0004D8, "Wrong size on AE_ChallengeBreakable_C");
static_assert(offsetof(AE_ChallengeBreakable_C, UberGraphFrame_E_ChallengeBreakable_C) == 0x0004C0, "Member 'AE_ChallengeBreakable_C::UberGraphFrame_E_ChallengeBreakable_C' has a wrong offset!");
static_assert(offsetof(AE_ChallengeBreakable_C, StaticMesh) == 0x0004C8, "Member 'AE_ChallengeBreakable_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AE_ChallengeBreakable_C, EnableCollisionOnMatchStart) == 0x0004D0, "Member 'AE_ChallengeBreakable_C::EnableCollisionOnMatchStart' has a wrong offset!");

}

