#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_ChallengeRewardChest

#include "Basic.hpp"

#include "E_BreakableBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_ChallengeRewardChest.E_ChallengeRewardChest_C
// 0x0020 (0x04E0 - 0x04C0)
class AE_ChallengeRewardChest_C final : public AE_BreakableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_E_ChallengeRewardChest_C;           // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMatchaLootComponent*                   MatchaLoot;                                        // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_HitChest;                                       // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_E_ChallengeRewardChest(int32 EntryPoint);
	void OnEnabledChanged(bool bOldEnabled, bool bNewEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_ChallengeRewardChest_C">();
	}
	static class AE_ChallengeRewardChest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_ChallengeRewardChest_C>();
	}
};
static_assert(alignof(AE_ChallengeRewardChest_C) == 0x000008, "Wrong alignment on AE_ChallengeRewardChest_C");
static_assert(sizeof(AE_ChallengeRewardChest_C) == 0x0004E0, "Wrong size on AE_ChallengeRewardChest_C");
static_assert(offsetof(AE_ChallengeRewardChest_C, UberGraphFrame_E_ChallengeRewardChest_C) == 0x0004C0, "Member 'AE_ChallengeRewardChest_C::UberGraphFrame_E_ChallengeRewardChest_C' has a wrong offset!");
static_assert(offsetof(AE_ChallengeRewardChest_C, MatchaLoot) == 0x0004C8, "Member 'AE_ChallengeRewardChest_C::MatchaLoot' has a wrong offset!");
static_assert(offsetof(AE_ChallengeRewardChest_C, NS_HitChest) == 0x0004D0, "Member 'AE_ChallengeRewardChest_C::NS_HitChest' has a wrong offset!");
static_assert(offsetof(AE_ChallengeRewardChest_C, StaticMesh) == 0x0004D8, "Member 'AE_ChallengeRewardChest_C::StaticMesh' has a wrong offset!");

}

