#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_ControlPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function E_ControlPanel.E_ControlPanel_C.ExecuteUbergraph_E_ControlPanel
// 0x0058 (0x0058 - 0x0000)
struct E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_SnapNetPropertyFloatToFloat_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractingActor;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOldEnabled;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewEnabled;                          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_value_ImplicitCast;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel) == 0x000008, "Wrong alignment on E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel");
static_assert(sizeof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel) == 0x000058, "Wrong size on E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, EntryPoint) == 0x000000, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, CallFunc_Conv_SnapNetPropertyFloatToFloat_ReturnValue) == 0x000004, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::CallFunc_Conv_SnapNetPropertyFloatToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, K2Node_Event_InteractingActor) == 0x000020, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::K2Node_Event_InteractingActor' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, K2Node_Event_bOldEnabled) == 0x000028, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::K2Node_Event_bOldEnabled' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, K2Node_Event_bNewEnabled) == 0x000029, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::K2Node_Event_bNewEnabled' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1) == 0x000040, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel, CallFunc_SetValue_value_ImplicitCast) == 0x000050, "Member 'E_ControlPanel_C_ExecuteUbergraph_E_ControlPanel::CallFunc_SetValue_value_ImplicitCast' has a wrong offset!");

// Function E_ControlPanel.E_ControlPanel_C.InteractionCompleted
// 0x0008 (0x0008 - 0x0000)
struct E_ControlPanel_C_InteractionCompleted final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_ControlPanel_C_InteractionCompleted) == 0x000008, "Wrong alignment on E_ControlPanel_C_InteractionCompleted");
static_assert(sizeof(E_ControlPanel_C_InteractionCompleted) == 0x000008, "Wrong size on E_ControlPanel_C_InteractionCompleted");
static_assert(offsetof(E_ControlPanel_C_InteractionCompleted, InteractingActor) == 0x000000, "Member 'E_ControlPanel_C_InteractionCompleted::InteractingActor' has a wrong offset!");

// Function E_ControlPanel.E_ControlPanel_C.OnEnabledChanged
// 0x0002 (0x0002 - 0x0000)
struct E_ControlPanel_C_OnEnabledChanged final
{
public:
	bool                                          bOldEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewEnabled;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_ControlPanel_C_OnEnabledChanged) == 0x000001, "Wrong alignment on E_ControlPanel_C_OnEnabledChanged");
static_assert(sizeof(E_ControlPanel_C_OnEnabledChanged) == 0x000002, "Wrong size on E_ControlPanel_C_OnEnabledChanged");
static_assert(offsetof(E_ControlPanel_C_OnEnabledChanged, bOldEnabled) == 0x000000, "Member 'E_ControlPanel_C_OnEnabledChanged::bOldEnabled' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_OnEnabledChanged, bNewEnabled) == 0x000001, "Member 'E_ControlPanel_C_OnEnabledChanged::bNewEnabled' has a wrong offset!");

// Function E_ControlPanel.E_ControlPanel_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct E_ControlPanel_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_ControlPanel_C_ReceiveTick) == 0x000004, "Wrong alignment on E_ControlPanel_C_ReceiveTick");
static_assert(sizeof(E_ControlPanel_C_ReceiveTick) == 0x000004, "Wrong size on E_ControlPanel_C_ReceiveTick");
static_assert(offsetof(E_ControlPanel_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'E_ControlPanel_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function E_ControlPanel.E_ControlPanel_C.UpdateCollision
// 0x0001 (0x0001 - 0x0000)
struct E_ControlPanel_C_UpdateCollision final
{
public:
	bool                                          CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_ControlPanel_C_UpdateCollision) == 0x000001, "Wrong alignment on E_ControlPanel_C_UpdateCollision");
static_assert(sizeof(E_ControlPanel_C_UpdateCollision) == 0x000001, "Wrong size on E_ControlPanel_C_UpdateCollision");
static_assert(offsetof(E_ControlPanel_C_UpdateCollision, CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue) == 0x000000, "Member 'E_ControlPanel_C_UpdateCollision::CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue' has a wrong offset!");

// Function E_ControlPanel.E_ControlPanel_C.CanStartInteraction
// 0x0028 (0x0028 - 0x0000)
struct E_ControlPanel_C_CanStartInteraction final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_SnapNetPropertyEntityIndexToInt_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_SnapNetPropertyFloatToFloat_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_ControlPanel_C_CanStartInteraction) == 0x000008, "Wrong alignment on E_ControlPanel_C_CanStartInteraction");
static_assert(sizeof(E_ControlPanel_C_CanStartInteraction) == 0x000028, "Wrong size on E_ControlPanel_C_CanStartInteraction");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, InteractingActor) == 0x000000, "Member 'E_ControlPanel_C_CanStartInteraction::InteractingActor' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, ReturnValue) == 0x000008, "Member 'E_ControlPanel_C_CanStartInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue) == 0x000009, "Member 'E_ControlPanel_C_CanStartInteraction::CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, CallFunc_Conv_SnapNetPropertyEntityIndexToInt_ReturnValue) == 0x00000C, "Member 'E_ControlPanel_C_CanStartInteraction::CallFunc_Conv_SnapNetPropertyEntityIndexToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'E_ControlPanel_C_CanStartInteraction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, CallFunc_Conv_SnapNetPropertyFloatToFloat_ReturnValue) == 0x000014, "Member 'E_ControlPanel_C_CanStartInteraction::CallFunc_Conv_SnapNetPropertyFloatToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000018, "Member 'E_ControlPanel_C_CanStartInteraction::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'E_ControlPanel_C_CanStartInteraction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, CallFunc_BooleanAND_ReturnValue_1) == 0x00001A, "Member 'E_ControlPanel_C_CanStartInteraction::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(E_ControlPanel_C_CanStartInteraction, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'E_ControlPanel_C_CanStartInteraction::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

