#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_GlitchCloudDamageVolume

#include "Basic.hpp"

#include "SnapNet_structs.hpp"
#include "E_DamageVolumeBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_GlitchCloudDamageVolume.E_GlitchCloudDamageVolume_C
// 0x0090 (0x0458 - 0x03C8)
class AE_GlitchCloudDamageVolume_C final : public AE_DamageVolumeBase_C
{
public:
	class UStaticMeshComponent*                   Cube;                                              // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DamageZoneBound;                                   // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSnapNetPropertyVector                 BoxExtents;                                        // 0x03D8(0x0080)(Edit, BlueprintVisible)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_GlitchCloudDamageVolume_C">();
	}
	static class AE_GlitchCloudDamageVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_GlitchCloudDamageVolume_C>();
	}
};
static_assert(alignof(AE_GlitchCloudDamageVolume_C) == 0x000008, "Wrong alignment on AE_GlitchCloudDamageVolume_C");
static_assert(sizeof(AE_GlitchCloudDamageVolume_C) == 0x000458, "Wrong size on AE_GlitchCloudDamageVolume_C");
static_assert(offsetof(AE_GlitchCloudDamageVolume_C, Cube) == 0x0003C8, "Member 'AE_GlitchCloudDamageVolume_C::Cube' has a wrong offset!");
static_assert(offsetof(AE_GlitchCloudDamageVolume_C, DamageZoneBound) == 0x0003D0, "Member 'AE_GlitchCloudDamageVolume_C::DamageZoneBound' has a wrong offset!");
static_assert(offsetof(AE_GlitchCloudDamageVolume_C, BoxExtents) == 0x0003D8, "Member 'AE_GlitchCloudDamageVolume_C::BoxExtents' has a wrong offset!");

}

