#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_GlitchCloudDamageVolume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function E_GlitchCloudDamageVolume.E_GlitchCloudDamageVolume_C.UserConstructionScript
// 0x0160 (0x0160 - 0x0000)
struct E_GlitchCloudDamageVolume_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue; // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_2;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUnscaledBoxExtent_ReturnValue;         // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_GlitchCloudDamageVolume_C_UserConstructionScript) == 0x000008, "Wrong alignment on E_GlitchCloudDamageVolume_C_UserConstructionScript");
static_assert(sizeof(E_GlitchCloudDamageVolume_C_UserConstructionScript) == 0x000160, "Wrong size on E_GlitchCloudDamageVolume_C_UserConstructionScript");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue) == 0x000000, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_GetLocalBounds_Min) == 0x000018, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_GetLocalBounds_Max) == 0x000030, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000048, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000050, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000058, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000060, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000068, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000070, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue) == 0x000078, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue_1) == 0x00007C, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Divide_IntInt_ReturnValue) == 0x000080, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000084, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000088, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000090, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue_2) == 0x000098, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x0000A0, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x0000A8, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x0000B0, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Divide_IntInt_ReturnValue_2) == 0x0000B8, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Divide_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0000C8, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000D0, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x0000E8, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_GetUnscaledBoxExtent_ReturnValue) == 0x000100, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_GetUnscaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000118, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Divide_VectorVector_ReturnValue) == 0x000130, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_GlitchCloudDamageVolume_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000148, "Member 'E_GlitchCloudDamageVolume_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

}

