#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_Interactable_VaultTerminal

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function E_Interactable_VaultTerminal.E_Interactable_VaultTerminal_C.AfterInteractionCancelledOrCompleted
// 0x0010 (0x0010 - 0x0000)
struct E_Interactable_VaultTerminal_C_AfterInteractionCancelledOrCompleted final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasCancelled;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Interactable_VaultTerminal_C_AfterInteractionCancelledOrCompleted) == 0x000008, "Wrong alignment on E_Interactable_VaultTerminal_C_AfterInteractionCancelledOrCompleted");
static_assert(sizeof(E_Interactable_VaultTerminal_C_AfterInteractionCancelledOrCompleted) == 0x000010, "Wrong size on E_Interactable_VaultTerminal_C_AfterInteractionCancelledOrCompleted");
static_assert(offsetof(E_Interactable_VaultTerminal_C_AfterInteractionCancelledOrCompleted, InteractingActor) == 0x000000, "Member 'E_Interactable_VaultTerminal_C_AfterInteractionCancelledOrCompleted::InteractingActor' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_AfterInteractionCancelledOrCompleted, bWasCancelled) == 0x000008, "Member 'E_Interactable_VaultTerminal_C_AfterInteractionCancelledOrCompleted::bWasCancelled' has a wrong offset!");

// Function E_Interactable_VaultTerminal.E_Interactable_VaultTerminal_C.AfterInteractionStarted
// 0x0008 (0x0008 - 0x0000)
struct E_Interactable_VaultTerminal_C_AfterInteractionStarted final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Interactable_VaultTerminal_C_AfterInteractionStarted) == 0x000008, "Wrong alignment on E_Interactable_VaultTerminal_C_AfterInteractionStarted");
static_assert(sizeof(E_Interactable_VaultTerminal_C_AfterInteractionStarted) == 0x000008, "Wrong size on E_Interactable_VaultTerminal_C_AfterInteractionStarted");
static_assert(offsetof(E_Interactable_VaultTerminal_C_AfterInteractionStarted, InteractingActor) == 0x000000, "Member 'E_Interactable_VaultTerminal_C_AfterInteractionStarted::InteractingActor' has a wrong offset!");

// Function E_Interactable_VaultTerminal.E_Interactable_VaultTerminal_C.ExecuteUbergraph_E_Interactable_VaultTerminal
// 0x00B0 (0x00B0 - 0x0000)
struct E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractingActor;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaSnapNetCharacterEntity*          K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractingActor_1;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInventoryProvider>    K2Node_DynamicCast_AsInventory_Provider;           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryComponent*              CallFunc_GetInventoryComponent_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMatchaInventoryItem                   CallFunc_FromItemAsset_ReturnValue;                // 0x0050(0x0058)()
	bool                                          CallFunc_TryRemoveItemInCategory_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOldEnabled;                          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewEnabled;                          // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal) == 0x000008, "Wrong alignment on E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal");
static_assert(sizeof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal) == 0x0000B0, "Wrong size on E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, EntryPoint) == 0x000000, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::EntryPoint' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, K2Node_Event_InteractingActor) == 0x000008, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::K2Node_Event_InteractingActor' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, K2Node_Event_bWasCancelled) == 0x000010, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity) == 0x000018, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, K2Node_Event_InteractingActor_1) == 0x000028, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::K2Node_Event_InteractingActor_1' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, K2Node_DynamicCast_AsInventory_Provider) == 0x000030, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::K2Node_DynamicCast_AsInventory_Provider' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, CallFunc_GetInventoryComponent_ReturnValue) == 0x000048, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, CallFunc_FromItemAsset_ReturnValue) == 0x000050, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::CallFunc_FromItemAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, CallFunc_TryRemoveItemInCategory_ReturnValue) == 0x0000A8, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::CallFunc_TryRemoveItemInCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, CallFunc_Not_PreBool_ReturnValue) == 0x0000A9, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, K2Node_Event_bOldEnabled) == 0x0000AA, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::K2Node_Event_bOldEnabled' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal, K2Node_Event_bNewEnabled) == 0x0000AB, "Member 'E_Interactable_VaultTerminal_C_ExecuteUbergraph_E_Interactable_VaultTerminal::K2Node_Event_bNewEnabled' has a wrong offset!");

// Function E_Interactable_VaultTerminal.E_Interactable_VaultTerminal_C.OnEnabledChanged
// 0x0002 (0x0002 - 0x0000)
struct E_Interactable_VaultTerminal_C_OnEnabledChanged final
{
public:
	bool                                          bOldEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewEnabled;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Interactable_VaultTerminal_C_OnEnabledChanged) == 0x000001, "Wrong alignment on E_Interactable_VaultTerminal_C_OnEnabledChanged");
static_assert(sizeof(E_Interactable_VaultTerminal_C_OnEnabledChanged) == 0x000002, "Wrong size on E_Interactable_VaultTerminal_C_OnEnabledChanged");
static_assert(offsetof(E_Interactable_VaultTerminal_C_OnEnabledChanged, bOldEnabled) == 0x000000, "Member 'E_Interactable_VaultTerminal_C_OnEnabledChanged::bOldEnabled' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_OnEnabledChanged, bNewEnabled) == 0x000001, "Member 'E_Interactable_VaultTerminal_C_OnEnabledChanged::bNewEnabled' has a wrong offset!");

// Function E_Interactable_VaultTerminal.E_Interactable_VaultTerminal_C.UpdateCollision
// 0x0001 (0x0001 - 0x0000)
struct E_Interactable_VaultTerminal_C_UpdateCollision final
{
public:
	bool                                          CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Interactable_VaultTerminal_C_UpdateCollision) == 0x000001, "Wrong alignment on E_Interactable_VaultTerminal_C_UpdateCollision");
static_assert(sizeof(E_Interactable_VaultTerminal_C_UpdateCollision) == 0x000001, "Wrong size on E_Interactable_VaultTerminal_C_UpdateCollision");
static_assert(offsetof(E_Interactable_VaultTerminal_C_UpdateCollision, CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue) == 0x000000, "Member 'E_Interactable_VaultTerminal_C_UpdateCollision::CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue' has a wrong offset!");

// Function E_Interactable_VaultTerminal.E_Interactable_VaultTerminal_C.CanStartInteraction
// 0x00B0 (0x00B0 - 0x0000)
struct E_Interactable_VaultTerminal_C_CanStartInteraction final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaSnapNetCharacterEntity*          K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_SnapNetPropertyFloatToFloat_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInventoryProvider>    K2Node_DynamicCast_AsInventory_Provider;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryComponent*              CallFunc_GetInventoryComponent_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_SnapNetPropertyEntityIndexToInt_ReturnValue; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaInventoryItem                   CallFunc_FromItemAsset_ReturnValue;                // 0x0048(0x0058)()
	bool                                          CallFunc_HasItemInCategory_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue; // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Interactable_VaultTerminal_C_CanStartInteraction) == 0x000008, "Wrong alignment on E_Interactable_VaultTerminal_C_CanStartInteraction");
static_assert(sizeof(E_Interactable_VaultTerminal_C_CanStartInteraction) == 0x0000B0, "Wrong size on E_Interactable_VaultTerminal_C_CanStartInteraction");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, InteractingActor) == 0x000000, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::InteractingActor' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, ReturnValue) == 0x000008, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity) == 0x000010, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_Conv_SnapNetPropertyFloatToFloat_ReturnValue) == 0x00001C, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_Conv_SnapNetPropertyFloatToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, K2Node_DynamicCast_AsInventory_Provider) == 0x000020, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::K2Node_DynamicCast_AsInventory_Provider' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000031, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_GetInventoryComponent_ReturnValue) == 0x000038, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_Conv_SnapNetPropertyEntityIndexToInt_ReturnValue) == 0x000040, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_Conv_SnapNetPropertyEntityIndexToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_BooleanAND_ReturnValue) == 0x000045, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_FromItemAsset_ReturnValue) == 0x000048, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_FromItemAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_HasItemInCategory_ReturnValue) == 0x0000A0, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_HasItemInCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue) == 0x0000A1, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A2, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(E_Interactable_VaultTerminal_C_CanStartInteraction, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'E_Interactable_VaultTerminal_C_CanStartInteraction::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

