#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_KOVolumeKnockedInto_Box

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function E_KOVolumeKnockedInto_Box.E_KOVolumeKnockedInto_Box_C.ExecuteUbergraph_E_KOVolumeKnockedInto_Box
// 0x0020 (0x0020 - 0x0000)
struct E_KOVolumeKnockedInto_Box_C_ExecuteUbergraph_E_KOVolumeKnockedInto_Box final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue; // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_KOVolumeKnockedInto_Box_C_ExecuteUbergraph_E_KOVolumeKnockedInto_Box) == 0x000008, "Wrong alignment on E_KOVolumeKnockedInto_Box_C_ExecuteUbergraph_E_KOVolumeKnockedInto_Box");
static_assert(sizeof(E_KOVolumeKnockedInto_Box_C_ExecuteUbergraph_E_KOVolumeKnockedInto_Box) == 0x000020, "Wrong size on E_KOVolumeKnockedInto_Box_C_ExecuteUbergraph_E_KOVolumeKnockedInto_Box");
static_assert(offsetof(E_KOVolumeKnockedInto_Box_C_ExecuteUbergraph_E_KOVolumeKnockedInto_Box, EntryPoint) == 0x000000, "Member 'E_KOVolumeKnockedInto_Box_C_ExecuteUbergraph_E_KOVolumeKnockedInto_Box::EntryPoint' has a wrong offset!");
static_assert(offsetof(E_KOVolumeKnockedInto_Box_C_ExecuteUbergraph_E_KOVolumeKnockedInto_Box, CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue) == 0x000008, "Member 'E_KOVolumeKnockedInto_Box_C_ExecuteUbergraph_E_KOVolumeKnockedInto_Box::CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue' has a wrong offset!");

// Function E_KOVolumeKnockedInto_Box.E_KOVolumeKnockedInto_Box_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct E_KOVolumeKnockedInto_Box_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue; // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_KOVolumeKnockedInto_Box_C_UserConstructionScript) == 0x000008, "Wrong alignment on E_KOVolumeKnockedInto_Box_C_UserConstructionScript");
static_assert(sizeof(E_KOVolumeKnockedInto_Box_C_UserConstructionScript) == 0x000018, "Wrong size on E_KOVolumeKnockedInto_Box_C_UserConstructionScript");
static_assert(offsetof(E_KOVolumeKnockedInto_Box_C_UserConstructionScript, CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue) == 0x000000, "Member 'E_KOVolumeKnockedInto_Box_C_UserConstructionScript::CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue' has a wrong offset!");

}

