#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_KOVolumeAlways_Box

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_KOVolumeAlways_Base_classes.hpp"
#include "SnapNet_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_KOVolumeAlways_Box.E_KOVolumeAlways_Box_C
// 0x0090 (0x0498 - 0x0408)
class AE_KOVolumeAlways_Box_C : public AE_KOVolumeAlways_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          KOBounds;                                          // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSnapNetPropertyVector                 KOExtents;                                         // 0x0418(0x0080)(Edit, BlueprintVisible)

public:
	void BndEvt__E_KOVolumeAlways_Box_EntityComponent_K2Node_ComponentBoundEvent_0_SnapNetPropertiesModifiedDynamicDelegate__DelegateSignature();
	void ExecuteUbergraph_E_KOVolumeAlways_Box(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_KOVolumeAlways_Box_C">();
	}
	static class AE_KOVolumeAlways_Box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_KOVolumeAlways_Box_C>();
	}
};
static_assert(alignof(AE_KOVolumeAlways_Box_C) == 0x000008, "Wrong alignment on AE_KOVolumeAlways_Box_C");
static_assert(sizeof(AE_KOVolumeAlways_Box_C) == 0x000498, "Wrong size on AE_KOVolumeAlways_Box_C");
static_assert(offsetof(AE_KOVolumeAlways_Box_C, UberGraphFrame) == 0x000408, "Member 'AE_KOVolumeAlways_Box_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AE_KOVolumeAlways_Box_C, KOBounds) == 0x000410, "Member 'AE_KOVolumeAlways_Box_C::KOBounds' has a wrong offset!");
static_assert(offsetof(AE_KOVolumeAlways_Box_C, KOExtents) == 0x000418, "Member 'AE_KOVolumeAlways_Box_C::KOExtents' has a wrong offset!");

}

