#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_Pickup_Common

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ItemPickup_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_Pickup_Common.E_Pickup_Common_C
// 0x0020 (0x03D8 - 0x03B8)
class AE_Pickup_Common_C : public ABP_ItemPickup_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_E_Pickup_Common_C;                  // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   RenderPreview;                                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryComponent*              Inventory;                                         // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         InitialItemCount;                                  // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_E_Pickup_Common(int32 EntryPoint);
	class UMatchaInventoryComponent* GetInventoryComponent();
	void GetItem(class UMatchaItemAsset** Item_0);
	void GetItemCount(int32* Count);
	void PopulateDropInventory();
	void ReceiveBeginPlay();
	void TryPickUpBy(class AActor* Instigator_0, bool* Success);
	void TryRemoveQuantity(int32 QuantityToRemove, bool* Success);
	void UserConstructionScript();

	int32 GetInteractionPriority(class AActor* InteractingActor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_Pickup_Common_C">();
	}
	static class AE_Pickup_Common_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_Pickup_Common_C>();
	}
};
static_assert(alignof(AE_Pickup_Common_C) == 0x000008, "Wrong alignment on AE_Pickup_Common_C");
static_assert(sizeof(AE_Pickup_Common_C) == 0x0003D8, "Wrong size on AE_Pickup_Common_C");
static_assert(offsetof(AE_Pickup_Common_C, UberGraphFrame_E_Pickup_Common_C) == 0x0003B8, "Member 'AE_Pickup_Common_C::UberGraphFrame_E_Pickup_Common_C' has a wrong offset!");
static_assert(offsetof(AE_Pickup_Common_C, RenderPreview) == 0x0003C0, "Member 'AE_Pickup_Common_C::RenderPreview' has a wrong offset!");
static_assert(offsetof(AE_Pickup_Common_C, Inventory) == 0x0003C8, "Member 'AE_Pickup_Common_C::Inventory' has a wrong offset!");
static_assert(offsetof(AE_Pickup_Common_C, InitialItemCount) == 0x0003D0, "Member 'AE_Pickup_Common_C::InitialItemCount' has a wrong offset!");

}

