#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_Pickup_CoinStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SnapNet_structs.hpp"
#include "Pickup_Base_classes.hpp"
#include "Matcha_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_Pickup_CoinStack.E_Pickup_CoinStack_C
// 0x0050 (0x03F8 - 0x03A8)
class AE_Pickup_CoinStack_C final : public APickup_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_E_Pickup_CoinStack_C;               // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSnapNetPropertyInt32                  Coins;                                             // 0x03B0(0x0038)(Edit, BlueprintVisible)
	double                                        InitialPickupDelaySeconds;                         // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           InitialPickupDelayTimerHandle;                     // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_E_Pickup_CoinStack(int32 EntryPoint);
	void OnPickupDelayFinished();
	void OnReceiveIntContext(int32 Context);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void TryPickUpBy(class AActor* Instigator_0, bool* Success);

	int32 GetInteractionPriority(class AActor* InteractingActor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_Pickup_CoinStack_C">();
	}
	static class AE_Pickup_CoinStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_Pickup_CoinStack_C>();
	}
};
static_assert(alignof(AE_Pickup_CoinStack_C) == 0x000008, "Wrong alignment on AE_Pickup_CoinStack_C");
static_assert(sizeof(AE_Pickup_CoinStack_C) == 0x0003F8, "Wrong size on AE_Pickup_CoinStack_C");
static_assert(offsetof(AE_Pickup_CoinStack_C, UberGraphFrame_E_Pickup_CoinStack_C) == 0x0003A8, "Member 'AE_Pickup_CoinStack_C::UberGraphFrame_E_Pickup_CoinStack_C' has a wrong offset!");
static_assert(offsetof(AE_Pickup_CoinStack_C, Coins) == 0x0003B0, "Member 'AE_Pickup_CoinStack_C::Coins' has a wrong offset!");
static_assert(offsetof(AE_Pickup_CoinStack_C, InitialPickupDelaySeconds) == 0x0003E8, "Member 'AE_Pickup_CoinStack_C::InitialPickupDelaySeconds' has a wrong offset!");
static_assert(offsetof(AE_Pickup_CoinStack_C, InitialPickupDelayTimerHandle) == 0x0003F0, "Member 'AE_Pickup_CoinStack_C::InitialPickupDelayTimerHandle' has a wrong offset!");

}

