#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_Teleporter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function E_Teleporter.E_Teleporter_C.ExecuteUbergraph_E_Teleporter
// 0x0100 (0x0100 - 0x0000)
struct E_Teleporter_C_ExecuteUbergraph_E_Teleporter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue; // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsZero_ReturnValue;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0068(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaSnapNetCharacterEntity*          K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter) == 0x000008, "Wrong alignment on E_Teleporter_C_ExecuteUbergraph_E_Teleporter");
static_assert(sizeof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter) == 0x000100, "Wrong size on E_Teleporter_C_ExecuteUbergraph_E_Teleporter");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, EntryPoint) == 0x000000, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::EntryPoint' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, Temp_int_Array_Index_Variable) == 0x000004, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue) == 0x000008, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_Conv_SnapNetPropertyVectorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, K2Node_Event_InteractingActor) == 0x000020, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::K2Node_Event_InteractingActor' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_Vector_IsZero_ReturnValue) == 0x000044, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_Vector_IsZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, Temp_object_Variable) == 0x000068, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_BoxOverlapActors_OutActors) == 0x000090, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_BoxOverlapActors_ReturnValue) == 0x0000A0, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_SelectVector_ReturnValue) == 0x0000A8, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity) == 0x0000D0, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_Less_IntInt_ReturnValue) == 0x0000D9, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000E0, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_ExecuteUbergraph_E_Teleporter, CallFunc_K2_TeleportTo_ReturnValue) == 0x0000F8, "Member 'E_Teleporter_C_ExecuteUbergraph_E_Teleporter::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");

// Function E_Teleporter.E_Teleporter_C.InteractionCompleted
// 0x0008 (0x0008 - 0x0000)
struct E_Teleporter_C_InteractionCompleted final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Teleporter_C_InteractionCompleted) == 0x000008, "Wrong alignment on E_Teleporter_C_InteractionCompleted");
static_assert(sizeof(E_Teleporter_C_InteractionCompleted) == 0x000008, "Wrong size on E_Teleporter_C_InteractionCompleted");
static_assert(offsetof(E_Teleporter_C_InteractionCompleted, InteractingActor) == 0x000000, "Member 'E_Teleporter_C_InteractionCompleted::InteractingActor' has a wrong offset!");

// Function E_Teleporter.E_Teleporter_C.UserConstructionScript
// 0x0340 (0x0340 - 0x0000)
struct E_Teleporter_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Conv_SnapNetPropertyInt32ToInt_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_SnapNetPropertyStringToString_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0050(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0148(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0240(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Teleporter_C_UserConstructionScript) == 0x000008, "Wrong alignment on E_Teleporter_C_UserConstructionScript");
static_assert(sizeof(E_Teleporter_C_UserConstructionScript) == 0x000340, "Wrong size on E_Teleporter_C_UserConstructionScript");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_Conv_SnapNetPropertyInt32ToInt_ReturnValue) == 0x000000, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_Conv_SnapNetPropertyInt32ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_RotatorFromAxisAndAngle_ReturnValue) == 0x000010, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_RotatorFromAxisAndAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_Conv_SnapNetPropertyStringToString_ReturnValue) == 0x000028, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_Conv_SnapNetPropertyStringToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue) == 0x000038, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000050, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000148, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000240, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(E_Teleporter_C_UserConstructionScript, CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast) == 0x000338, "Member 'E_Teleporter_C_UserConstructionScript::CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast' has a wrong offset!");

}

