#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_Trap_BurstingBoba_Heal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Trap_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_Trap_BurstingBoba_Heal.E_Trap_BurstingBoba_Heal_C
// 0x0020 (0x03F8 - 0x03D8)
class AE_Trap_BurstingBoba_Heal_C final : public AE_Trap_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_E_Trap_BurstingBoba_Heal_C;         // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          TriggerOnce;                                       // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaServerScript*                    ServerScript;                                      // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_E_Trap_BurstingBoba_Heal(int32 EntryPoint);
	void OnPeriodicEffectInterval();
	void OnSpawnFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_Trap_BurstingBoba_Heal_C">();
	}
	static class AE_Trap_BurstingBoba_Heal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_Trap_BurstingBoba_Heal_C>();
	}
};
static_assert(alignof(AE_Trap_BurstingBoba_Heal_C) == 0x000008, "Wrong alignment on AE_Trap_BurstingBoba_Heal_C");
static_assert(sizeof(AE_Trap_BurstingBoba_Heal_C) == 0x0003F8, "Wrong size on AE_Trap_BurstingBoba_Heal_C");
static_assert(offsetof(AE_Trap_BurstingBoba_Heal_C, UberGraphFrame_E_Trap_BurstingBoba_Heal_C) == 0x0003D8, "Member 'AE_Trap_BurstingBoba_Heal_C::UberGraphFrame_E_Trap_BurstingBoba_Heal_C' has a wrong offset!");
static_assert(offsetof(AE_Trap_BurstingBoba_Heal_C, Sphere) == 0x0003E0, "Member 'AE_Trap_BurstingBoba_Heal_C::Sphere' has a wrong offset!");
static_assert(offsetof(AE_Trap_BurstingBoba_Heal_C, TriggerOnce) == 0x0003E8, "Member 'AE_Trap_BurstingBoba_Heal_C::TriggerOnce' has a wrong offset!");
static_assert(offsetof(AE_Trap_BurstingBoba_Heal_C, ServerScript) == 0x0003F0, "Member 'AE_Trap_BurstingBoba_Heal_C::ServerScript' has a wrong offset!");

}

