#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_TrapRoomTrigger

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_TrapRoomTrigger.E_TrapRoomTrigger_C
// 0x0038 (0x03B0 - 0x0378)
class AE_TrapRoomTrigger_C final : public AMatchaSnapNetEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          PlayerCollision;                                   // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ChannelToBroadcastTo;                              // 0x0390(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMatchaGameplayEvent                   GameplayEventToBroadcast;                          // 0x0398(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          HasTriggeredThisMatch;                             // 0x03AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterInteractionCancelledOrCompleted(class AActor* InteractingActor, bool bWasCancelled);
	void AfterInteractionStarted(class AActor* InteractingActor);
	void ExecuteUbergraph_E_TrapRoomTrigger(int32 EntryPoint);
	struct FGameplayTag GetBroadcastChannel();
	void InteractionCancelled(class AActor* InteractingActor);
	void InteractionCompleted(class AActor* InteractingActor);
	void InteractionProgressed(class AActor* InteractingActor, float InteractionProgressTimeSeconds);
	void OnEnabledChanged(bool bOldEnabled, bool bNewEnabled);
	void ReceiveBeginPlay();
	void UpdateCollision(bool EnableCollision);

	bool CanStartInteraction(class AActor* InteractingActor) const;
	int32 GetInteractionPriority(class AActor* InteractingActor) const;
	struct FMatchaInteractionRequirements GetInteractionRequirements() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_TrapRoomTrigger_C">();
	}
	static class AE_TrapRoomTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_TrapRoomTrigger_C>();
	}
};
static_assert(alignof(AE_TrapRoomTrigger_C) == 0x000008, "Wrong alignment on AE_TrapRoomTrigger_C");
static_assert(sizeof(AE_TrapRoomTrigger_C) == 0x0003B0, "Wrong size on AE_TrapRoomTrigger_C");
static_assert(offsetof(AE_TrapRoomTrigger_C, UberGraphFrame) == 0x000378, "Member 'AE_TrapRoomTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AE_TrapRoomTrigger_C, PlayerCollision) == 0x000380, "Member 'AE_TrapRoomTrigger_C::PlayerCollision' has a wrong offset!");
static_assert(offsetof(AE_TrapRoomTrigger_C, DefaultSceneRoot) == 0x000388, "Member 'AE_TrapRoomTrigger_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AE_TrapRoomTrigger_C, ChannelToBroadcastTo) == 0x000390, "Member 'AE_TrapRoomTrigger_C::ChannelToBroadcastTo' has a wrong offset!");
static_assert(offsetof(AE_TrapRoomTrigger_C, GameplayEventToBroadcast) == 0x000398, "Member 'AE_TrapRoomTrigger_C::GameplayEventToBroadcast' has a wrong offset!");
static_assert(offsetof(AE_TrapRoomTrigger_C, HasTriggeredThisMatch) == 0x0003AC, "Member 'AE_TrapRoomTrigger_C::HasTriggeredThisMatch' has a wrong offset!");

}

