#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_Trap_ProximityMine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function E_Trap_ProximityMine.E_Trap_ProximityMine_C.ExecuteUbergraph_E_Trap_ProximityMine
// 0x0168 (0x0168 - 0x0000)
struct E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerEntity_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerEntity_ReturnValue_1;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AMatchaSnapNetCharacterEntity*          K2Node_Event_OverlappedCharacter;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnOwnedEntity_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombinedFXInfo                        K2Node_MakeStruct_CombinedFXInfo;                  // 0x0058(0x0088)(NoDestructor)
	struct FCombinedFXInfo                        K2Node_MakeStruct_CombinedFXInfo_1;                // 0x00E0(0x0088)(NoDestructor)
};
static_assert(alignof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine) == 0x000008, "Wrong alignment on E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine");
static_assert(sizeof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine) == 0x000168, "Wrong size on E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine");
static_assert(offsetof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine, EntryPoint) == 0x000000, "Member 'E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine::EntryPoint' has a wrong offset!");
static_assert(offsetof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine, CallFunc_GetOwnerEntity_ReturnValue) == 0x000008, "Member 'E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine::CallFunc_GetOwnerEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine, CallFunc_GetOwnerEntity_ReturnValue_1) == 0x000010, "Member 'E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine::CallFunc_GetOwnerEntity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000030, "Member 'E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine, K2Node_Event_OverlappedCharacter) == 0x000048, "Member 'E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine::K2Node_Event_OverlappedCharacter' has a wrong offset!");
static_assert(offsetof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine, CallFunc_SpawnOwnedEntity_ReturnValue) == 0x000050, "Member 'E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine::CallFunc_SpawnOwnedEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine, K2Node_MakeStruct_CombinedFXInfo) == 0x000058, "Member 'E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine::K2Node_MakeStruct_CombinedFXInfo' has a wrong offset!");
static_assert(offsetof(E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine, K2Node_MakeStruct_CombinedFXInfo_1) == 0x0000E0, "Member 'E_Trap_ProximityMine_C_ExecuteUbergraph_E_Trap_ProximityMine::K2Node_MakeStruct_CombinedFXInfo_1' has a wrong offset!");

// Function E_Trap_ProximityMine.E_Trap_ProximityMine_C.OnTriggerTrapFromOverlap
// 0x0008 (0x0008 - 0x0000)
struct E_Trap_ProximityMine_C_OnTriggerTrapFromOverlap final
{
public:
	class AMatchaSnapNetCharacterEntity*          OverlappedCharacter;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(E_Trap_ProximityMine_C_OnTriggerTrapFromOverlap) == 0x000008, "Wrong alignment on E_Trap_ProximityMine_C_OnTriggerTrapFromOverlap");
static_assert(sizeof(E_Trap_ProximityMine_C_OnTriggerTrapFromOverlap) == 0x000008, "Wrong size on E_Trap_ProximityMine_C_OnTriggerTrapFromOverlap");
static_assert(offsetof(E_Trap_ProximityMine_C_OnTriggerTrapFromOverlap, OverlappedCharacter) == 0x000000, "Member 'E_Trap_ProximityMine_C_OnTriggerTrapFromOverlap::OverlappedCharacter' has a wrong offset!");

}

