#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_VaultDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function E_VaultDoor.E_VaultDoor_C.UserConstructionScript
// 0x0160 (0x0160 - 0x0000)
struct E_VaultDoor_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult;         // 0x0068(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(E_VaultDoor_C_UserConstructionScript) == 0x000008, "Wrong alignment on E_VaultDoor_C_UserConstructionScript");
static_assert(sizeof(E_VaultDoor_C_UserConstructionScript) == 0x000160, "Wrong size on E_VaultDoor_C_UserConstructionScript");
static_assert(offsetof(E_VaultDoor_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'E_VaultDoor_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_VaultDoor_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin) == 0x000018, "Member 'E_VaultDoor_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(E_VaultDoor_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent) == 0x000030, "Member 'E_VaultDoor_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(E_VaultDoor_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius) == 0x000048, "Member 'E_VaultDoor_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(E_VaultDoor_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000050, "Member 'E_VaultDoor_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(E_VaultDoor_C_UserConstructionScript, CallFunc_K2_AddWorldOffset_SweepHitResult) == 0x000068, "Member 'E_VaultDoor_C_UserConstructionScript::CallFunc_K2_AddWorldOffset_SweepHitResult' has a wrong offset!");

}

