#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_VendingMachine_Food

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SnapNet_structs.hpp"
#include "InteractiveEntity_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass E_VendingMachine_Food.E_VendingMachine_Food_C
// 0x0038 (0x04F8 - 0x04C0)
class AE_VendingMachine_Food_C final : public AInteractiveEntity_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_E_VendingMachine_Food_C;            // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMatchaLootComponent*                   MatchaLoot;                                        // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSnapNetPropertyBoolean                IsBeingInteracted;                                 // 0x04D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CoinCostToUse;                                     // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterInteractionCancelledOrCompleted(class AActor* InteractingActor, bool bWasCancelled);
	void AfterInteractionStarted(class AActor* InteractingActor);
	void ExecuteUbergraph_E_VendingMachine_Food(int32 EntryPoint);

	bool CanStartInteraction(class AActor* InteractingActor) const;
	void GetIsBeingInteracted(bool* bIsBeingInteracted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"E_VendingMachine_Food_C">();
	}
	static class AE_VendingMachine_Food_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AE_VendingMachine_Food_C>();
	}
};
static_assert(alignof(AE_VendingMachine_Food_C) == 0x000008, "Wrong alignment on AE_VendingMachine_Food_C");
static_assert(sizeof(AE_VendingMachine_Food_C) == 0x0004F8, "Wrong size on AE_VendingMachine_Food_C");
static_assert(offsetof(AE_VendingMachine_Food_C, UberGraphFrame_E_VendingMachine_Food_C) == 0x0004C0, "Member 'AE_VendingMachine_Food_C::UberGraphFrame_E_VendingMachine_Food_C' has a wrong offset!");
static_assert(offsetof(AE_VendingMachine_Food_C, StaticMesh) == 0x0004C8, "Member 'AE_VendingMachine_Food_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AE_VendingMachine_Food_C, MatchaLoot) == 0x0004D0, "Member 'AE_VendingMachine_Food_C::MatchaLoot' has a wrong offset!");
static_assert(offsetof(AE_VendingMachine_Food_C, IsBeingInteracted) == 0x0004D8, "Member 'AE_VendingMachine_Food_C::IsBeingInteracted' has a wrong offset!");
static_assert(offsetof(AE_VendingMachine_Food_C, CoinCostToUse) == 0x0004F0, "Member 'AE_VendingMachine_Food_C::CoinCostToUse' has a wrong offset!");

}

