#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractiveEntity_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SnapNet_structs.hpp"
#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass InteractiveEntity_Base.InteractiveEntity_Base_C
// 0x0128 (0x04C0 - 0x0398)
class AInteractiveEntity_Base_C : public AMatchaSnapNetInteractiveEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSnapNetPropertyEntityIndex            InteractorEntityIndex;                             // 0x03A0(0x0068)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	struct FSnapNetPropertyFloat                  InteractionProgress;                               // 0x0408(0x0040)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	struct FGameplayTag                           InteractionCompletedBroadcastChannel;              // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMatchaGameplayEvent                   GameplayEventToBroadcast;                          // 0x0450(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSnapNetPropertyInt32                  EnableTimeMilliseconds;                            // 0x0468(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        CooldownSeconds;                                   // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InteractStartAudioEventID;                         // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InteractCompleteAudioEventID;                      // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInteractCompleteAudioFollowCharacter;             // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterInteractionCancelledOrCompleted(class AActor* InteractingActor, bool bWasCancelled);
	void AfterInteractionStarted(class AActor* InteractingActor);
	void ExecuteUbergraph_InteractiveEntity_Base(int32 EntryPoint);
	struct FGameplayTag GetBroadcastChannel();
	void InteractionProgressed(class AActor* InteractingActor, float InteractionProgressTimeSeconds);
	void ReceiveBeginPlay();
	void Try_Broadcast_Interaction_Complete_Event();

	bool CanStartInteraction(class AActor* InteractingActor) const;
	int32 GetInteractionPriority(class AActor* InteractingActor) const;
	void GetRemainingCooldownTime(double* RemainingCooldownSeconds) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InteractiveEntity_Base_C">();
	}
	static class AInteractiveEntity_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractiveEntity_Base_C>();
	}
};
static_assert(alignof(AInteractiveEntity_Base_C) == 0x000008, "Wrong alignment on AInteractiveEntity_Base_C");
static_assert(sizeof(AInteractiveEntity_Base_C) == 0x0004C0, "Wrong size on AInteractiveEntity_Base_C");
static_assert(offsetof(AInteractiveEntity_Base_C, UberGraphFrame) == 0x000398, "Member 'AInteractiveEntity_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AInteractiveEntity_Base_C, InteractorEntityIndex) == 0x0003A0, "Member 'AInteractiveEntity_Base_C::InteractorEntityIndex' has a wrong offset!");
static_assert(offsetof(AInteractiveEntity_Base_C, InteractionProgress) == 0x000408, "Member 'AInteractiveEntity_Base_C::InteractionProgress' has a wrong offset!");
static_assert(offsetof(AInteractiveEntity_Base_C, InteractionCompletedBroadcastChannel) == 0x000448, "Member 'AInteractiveEntity_Base_C::InteractionCompletedBroadcastChannel' has a wrong offset!");
static_assert(offsetof(AInteractiveEntity_Base_C, GameplayEventToBroadcast) == 0x000450, "Member 'AInteractiveEntity_Base_C::GameplayEventToBroadcast' has a wrong offset!");
static_assert(offsetof(AInteractiveEntity_Base_C, EnableTimeMilliseconds) == 0x000468, "Member 'AInteractiveEntity_Base_C::EnableTimeMilliseconds' has a wrong offset!");
static_assert(offsetof(AInteractiveEntity_Base_C, CooldownSeconds) == 0x0004A0, "Member 'AInteractiveEntity_Base_C::CooldownSeconds' has a wrong offset!");
static_assert(offsetof(AInteractiveEntity_Base_C, InteractStartAudioEventID) == 0x0004A8, "Member 'AInteractiveEntity_Base_C::InteractStartAudioEventID' has a wrong offset!");
static_assert(offsetof(AInteractiveEntity_Base_C, InteractCompleteAudioEventID) == 0x0004B0, "Member 'AInteractiveEntity_Base_C::InteractCompleteAudioEventID' has a wrong offset!");
static_assert(offsetof(AInteractiveEntity_Base_C, bInteractCompleteAudioFollowCharacter) == 0x0004B8, "Member 'AInteractiveEntity_Base_C::bInteractCompleteAudioFollowCharacter' has a wrong offset!");

}

