#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Matcha

#include "Basic.hpp"

#include "MatchaGameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OdyServices_structs.hpp"
#include "SnapNet_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Matcha.EMatchaCameraMode
// NumValues: 0x0003
enum class EMatchaCameraMode : uint8
{
	Combat                                   = 0,
	Explore                                  = 1,
	EMatchaCameraMode_MAX                    = 2,
};

// Enum Matcha.ESpawnRegion
// NumValues: 0x0014
enum class ESpawnRegion : uint8
{
	None                                     = 0,
	KaiTower                                 = 1,
	ClarionCorp                              = 2,
	Biosphere                                = 3,
	CoreStrikeArena                          = 4,
	ObeliskOfLight                           = 5,
	AtlasLab                                 = 6,
	ShoppingCenter                           = 7,
	Beach                                    = 8,
	ParkingGarage                            = 9,
	AhtenSewers                              = 10,
	Factory                                  = 11,
	Casino                                   = 12,
	Arcade                                   = 13,
	WaitingRoom                              = 14,
	OniMountain                              = 15,
	FloatingForest                           = 16,
	Random                                   = 17,
	Count                                    = 18,
	ESpawnRegion_MAX                         = 19,
};

// Enum Matcha.EMatchaGameplayEventType
// NumValues: 0x0004
enum class EMatchaGameplayEventType : uint8
{
	None                                     = 0,
	TimedChestSpawned                        = 1,
	TimedChestUnlockStart                    = 2,
	EMatchaGameplayEventType_MAX             = 3,
};

// Enum Matcha.EIdentityState
// NumValues: 0x0007
enum class EIdentityState : uint8
{
	Unknown                                  = 0,
	Processing                               = 1,
	Known                                    = 2,
	None                                     = 3,
	Banned                                   = 4,
	LoggedOut                                = 5,
	EIdentityState_MAX                       = 6,
};

// Enum Matcha.EMatchaMatchPhase
// NumValues: 0x0008
enum class EMatchaMatchPhase : uint8
{
	MatchPhase_NotStarted                    = 0,
	MatchPhase_SpawnInSelect                 = 1,
	MatchPhase_SpawnInSelectOutro            = 2,
	MatchPhase_InProgress                    = 3,
	MatchPhase_Completed                     = 4,
	MatchPhase_AutoStartCountdown            = 5,
	MatchPhase_ShuttingDown                  = 6,
	MatchPhase_MAX                           = 7,
};

// Enum Matcha.EAIMontageType
// NumValues: 0x0006
enum class EAIMontageType : uint8
{
	None                                     = 0,
	KnockBack                                = 1,
	Ability                                  = 2,
	Movement                                 = 3,
	Death                                    = 4,
	EAIMontageType_MAX                       = 5,
};

// Enum Matcha.EAIAbilityDirectionConstraint
// NumValues: 0x0008
enum class EAIAbilityDirectionConstraint : uint8
{
	None                                     = 0,
	Any                                      = 1,
	Above                                    = 2,
	Below                                    = 3,
	AnyLateral                               = 4,
	Front                                    = 5,
	Behind                                   = 6,
	EAIAbilityDirectionConstraint_MAX        = 7,
};

// Enum Matcha.ERootMotionForceApplicationCondition
// NumValues: 0x0003
enum class ERootMotionForceApplicationCondition : uint8
{
	None                                     = 0,
	CompanionAttached                        = 1,
	ERootMotionForceApplicationCondition_MAX = 2,
};

// Enum Matcha.EAutoTravelRootMotionType
// NumValues: 0x0004
enum class EAutoTravelRootMotionType : uint8
{
	None                                     = 0,
	Launch                                   = 1,
	TraversalEntity                          = 2,
	EAutoTravelRootMotionType_MAX            = 3,
};

// Enum Matcha.EMatchaInputAction
// NumValues: 0x001D
enum class EMatchaInputAction : uint8
{
	Invalid                                  = 0,
	MoveRight                                = 1,
	MoveLeft                                 = 2,
	MoveUp                                   = 3,
	MoveDown                                 = 4,
	MoveStick                                = 5,
	AttackStick                              = 6,
	Jump                                     = 7,
	Attack                                   = 8,
	SpecialAttack                            = 9,
	Shield                                   = 10,
	Grab                                     = 11,
	Interact                                 = 12,
	OpenMap                                  = 13,
	KeyboardForceWalkModifier                = 14,
	KeyboardHeavyAttack                      = 15,
	KeyboardHeavyAttackModifier              = 16,
	KeyboardMoveDownTap                      = 17,
	KeyboardStartDash                        = 18,
	KeyboardTeamAttack                       = 19,
	KeyboardEnergyBurst                      = 20,
	ShortJump                                = 21,
	CameraMode                               = 22,
	DPadLeft                                 = 23,
	DPadUp                                   = 24,
	DPadRight                                = 25,
	DPadDown                                 = 26,
	EnergyModifier                           = 27,
	EMatchaInputAction_MAX                   = 28,
};

// Enum Matcha.ECardinalInputDirection
// NumValues: 0x000A
enum class ECardinalInputDirection : uint8
{
	None                                     = 0,
	North                                    = 1,
	South                                    = 2,
	West                                     = 3,
	East                                     = 4,
	NorthWest                                = 5,
	NorthEast                                = 6,
	SouthWest                                = 7,
	SouthEast                                = 8,
	ECardinalInputDirection_MAX              = 9,
};

// Enum Matcha.EScheduledObjectiveType
// NumValues: 0x0004
enum class EScheduledObjectiveType : uint8
{
	None                                     = 0,
	LegendaryChest                           = 1,
	HackChest                                = 2,
	EScheduledObjectiveType_MAX              = 3,
};

// Enum Matcha.EInventoryHeldSlotStackingMode
// NumValues: 0x0003
enum class EInventoryHeldSlotStackingMode : uint8
{
	FullStack                                = 0,
	Incremental                              = 1,
	EInventoryHeldSlotStackingMode_MAX       = 2,
};

// Enum Matcha.EAttackStickMoveType
// NumValues: 0x0003
enum class EAttackStickMoveType : uint8
{
	SmashAttacks                             = 0,
	TiltAttacks                              = 1,
	EAttackStickMoveType_MAX                 = 2,
};

// Enum Matcha.EHitTargetType
// NumValues: 0x0004
enum class EHitTargetType : uint8
{
	GroundedOnly                             = 0,
	AirborneOnly                             = 1,
	Both                                     = 2,
	EHitTargetType_MAX                       = 3,
};

// Enum Matcha.EHitCollisionType
// NumValues: 0x0007
enum class EHitCollisionType : uint8
{
	Damage                                   = 0,
	Grab                                     = 1,
	Throw                                    = 2,
	Grounded                                 = 3,
	Aerial                                   = 4,
	Projectile                               = 5,
	EHitCollisionType_MAX                    = 6,
};

// Enum Matcha.EMatchaHitBoxType
// NumValues: 0x0004
enum class EMatchaHitBoxType : uint8
{
	Sphere                                   = 0,
	Box                                      = 1,
	Capsule                                  = 2,
	EMatchaHitBoxType_MAX                    = 3,
};

// Enum Matcha.EMatchaCharacterMontageType
// NumValues: 0x005C
enum class EMatchaCharacterMontageType : uint8
{
	None                                     = 0,
	GroundJump                               = 1,
	AirJump                                  = 2,
	FinalAirJump                             = 3,
	WallJump                                 = 4,
	LedgeGrab                                = 5,
	LedgeJumpGetUp                           = 6,
	LedgeJump                                = 7,
	LedgeGetUp                               = 8,
	LedgeRoll                                = 9,
	LedgeAttack                              = 10,
	LedgeSpecialAttack                       = 11,
	Landing                                  = 12,
	Counter                                  = 13,
	DiveBomb                                 = 14,
	Jab                                      = 15,
	ForwardTilt                              = 16,
	UpTilt                                   = 17,
	DownTilt                                 = 18,
	ForwardSmash                             = 19,
	UpSmash                                  = 20,
	DownSmash                                = 21,
	NeutralAir                               = 22,
	ForwardAir                               = 23,
	BackAir                                  = 24,
	UpAir                                    = 25,
	DownAir                                  = 26,
	DashStart                                = 27,
	DashAttack                               = 28,
	NeutralSpecial                           = 29,
	SideSpecial                              = 30,
	UpSpecial                                = 31,
	DownSpecial                              = 32,
	LightHurtAir                             = 33,
	LightHurtGround                          = 34,
	HurtLaunchPose                           = 35,
	HurtLaunch                               = 36,
	HurtLaunchToTumble                       = 37,
	Tumble                                   = 38,
	WallBounceHurtPose                       = 39,
	Tech                                     = 40,
	KnockDown                                = 41,
	KnockDownGetUp                           = 42,
	ShieldUp                                 = 43,
	ShieldDrop                               = 44,
	AirDodge                                 = 45,
	GroundForwardDodge                       = 46,
	GroundBackwardsDodge                     = 47,
	GroundSpotDodge                          = 48,
	Bounce                                   = 49,
	GrabBounce                               = 50,
	Grab                                     = 51,
	DashGrab                                 = 52,
	GrabLoop                                 = 53,
	Grabbed                                  = 54,
	Throw                                    = 55,
	BeingThrown                              = 56,
	ShieldBreak                              = 57,
	Dizzy                                    = 58,
	Stun                                     = 59,
	Interact                                 = 60,
	InteractCancel                           = 61,
	DropItem                                 = 62,
	ThrowItem                                = 63,
	FirePistolItem                           = 64,
	ConsumeFoodItem                          = 65,
	ConsumeDeployItem                        = 66,
	CompleteConsumeFoodItem                  = 67,
	CompleteConsumeDeployItem                = 68,
	CancelConsumeItem                        = 69,
	TeamAttack                               = 70,
	EmpoweredNeutralSpecial                  = 71,
	EmpoweredSideSpecial                     = 72,
	EmpoweredUpSpecial                       = 73,
	EmpoweredDownSpecial                     = 74,
	NeutralSpecialAerial                     = 75,
	SideSpecialAerial                        = 76,
	UpSpecialAerial                          = 77,
	DownSpecialAerial                        = 78,
	EmpoweredNeutralSpecialAerial            = 79,
	EmpoweredSideSpecialAerial               = 80,
	EmpoweredUpSpecialAerial                 = 81,
	EmpoweredDownSpecialAerial               = 82,
	EnergyBurst                              = 83,
	AirGrab                                  = 84,
	DashAirGrab                              = 85,
	Zipline                                  = 86,
	GlitchStepAttack                         = 87,
	GlitchBeam                               = 88,
	TurnAround                               = 89,
	DashTurnAround                           = 90,
	EMatchaCharacterMontageType_MAX          = 91,
};

// Enum Matcha.EMatchaRootMotionType
// NumValues: 0x002C
enum class EMatchaRootMotionType : uint8
{
	None                                     = 0,
	DashStart                                = 1,
	DashAttack                               = 2,
	GroundForwardDodge                       = 3,
	GroundBackwardsDodge                     = 4,
	AirDodge                                 = 5,
	NeutralAir                               = 6,
	ForwardAir                               = 7,
	BackAir                                  = 8,
	UpAir                                    = 9,
	DownAir                                  = 10,
	NeutralSpecial                           = 11,
	SideSpecial                              = 12,
	UpSpecial                                = 13,
	DownSpecial                              = 14,
	ForwardSmash                             = 15,
	UpSmash                                  = 16,
	DownSmash                                = 17,
	ForwardTilt                              = 18,
	UpTilt                                   = 19,
	DownTilt                                 = 20,
	KnockDownGetUpForward                    = 21,
	KnockDownGetUpBackwards                  = 22,
	TechGroundForward                        = 23,
	TechGroundBackwards                      = 24,
	TeamAttackIntro                          = 25,
	TeamAttackTeleport                       = 26,
	EmpoweredNeutralSpecial                  = 27,
	EmpoweredSideSpecial                     = 28,
	EmpoweredUpSpecial                       = 29,
	EmpoweredDownSpecial                     = 30,
	NeutralSpecialAerial                     = 31,
	SideSpecialAerial                        = 32,
	UpSpecialAerial                          = 33,
	DownSpecialAerial                        = 34,
	EmpoweredNeutralSpecialAerial            = 35,
	EmpoweredSideSpecialAerial               = 36,
	EmpoweredUpSpecialAerial                 = 37,
	EmpoweredDownSpecialAerial               = 38,
	DiveBomb                                 = 39,
	DashGrab                                 = 40,
	AirDashGrab                              = 41,
	DashTurnAround                           = 42,
	EMatchaRootMotionType_MAX                = 43,
};

// Enum Matcha.EClankResultType
// NumValues: 0x0006
enum class EClankResultType : uint8
{
	None                                     = 0,
	Continue                                 = 1,
	Bounce                                   = 2,
	GrabBounce                               = 3,
	Fizzle                                   = 4,
	EClankResultType_MAX                     = 5,
};

// Enum Matcha.EAttackDirection
// NumValues: 0x0006
enum class EAttackDirection : uint8
{
	Neutral                                  = 0,
	Up                                       = 1,
	Down                                     = 2,
	Forward                                  = 3,
	Backwards                                = 4,
	EAttackDirection_MAX                     = 5,
};

// Enum Matcha.EMatchaShieldState
// NumValues: 0x0004
enum class EMatchaShieldState : uint8
{
	Inactive                                 = 0,
	Active                                   = 1,
	Broken                                   = 2,
	EMatchaShieldState_MAX                   = 3,
};

// Enum Matcha.EQueuedJumpFlags
// NumValues: 0x0005
enum class EQueuedJumpFlags : uint8
{
	None                                     = 0,
	ShortGroundJump                          = 1,
	FullGroundJump                           = 2,
	LedgeJump                                = 4,
	EQueuedJumpFlags_MAX                     = 5,
};

// Enum Matcha.EAppliedHitFlags
// NumValues: 0x0007
enum class EAppliedHitFlags : uint8
{
	None                                     = 0,
	Shield                                   = 1,
	PerfectShield                            = 2,
	Counter                                  = 4,
	LethalKnockBack                          = 8,
	OwnedEntityHit                           = 16,
	EAppliedHitFlags_MAX                     = 17,
};

// Enum Matcha.ELedgePropertyFlags
// NumValues: 0x0004
enum class ELedgePropertyFlags : uint8
{
	None                                     = 0,
	GrantsIntangibility                      = 1,
	OnlyAllowsLedgeJump                      = 2,
	ELedgePropertyFlags_MAX                  = 3,
};

// Enum Matcha.EPlayerGlobalCombatStatus
// NumValues: 0x0008
enum class EPlayerGlobalCombatStatus : uint8
{
	KnockedOut                               = 0,
	Respawning                               = 1,
	InTransitionToArena                      = 2,
	InTransitionOutOfArena                   = 3,
	InOverWorld                              = 4,
	FightingInArena                          = 5,
	WaitingInArena                           = 6,
	EPlayerGlobalCombatStatus_MAX            = 7,
};

// Enum Matcha.ECompanionAttachState
// NumValues: 0x0006
enum class ECompanionAttachState : uint8
{
	None                                     = 0,
	Attached                                 = 1,
	Detached                                 = 2,
	Attaching                                = 3,
	Detaching                                = 4,
	ECompanionAttachState_MAX                = 5,
};

// Enum Matcha.EVisibilityOverrideTargetType
// NumValues: 0x0005
enum class EVisibilityOverrideTargetType : uint8
{
	MeshBone                                 = 0,
	AttachableCompanion                      = 1,
	StaticMeshAttachment                     = 2,
	SkeletalMeshAttachment                   = 3,
	EVisibilityOverrideTargetType_MAX        = 4,
};

// Enum Matcha.EGrabHeightType
// NumValues: 0x0005
enum class EGrabHeightType : uint8
{
	None                                     = 0,
	Low                                      = 1,
	Medium                                   = 2,
	High                                     = 3,
	EGrabHeightType_MAX                      = 4,
};

// Enum Matcha.EThrowDirection
// NumValues: 0x0006
enum class EThrowDirection : uint8
{
	None                                     = 0,
	Up                                       = 1,
	Down                                     = 2,
	Forward                                  = 3,
	Backwards                                = 4,
	EThrowDirection_MAX                      = 5,
};

// Enum Matcha.EThrowType
// NumValues: 0x0008
enum class EThrowType : uint8
{
	None                                     = 0,
	Chest                                    = 1,
	Feet                                     = 2,
	FeetBendRight                            = 3,
	Waist                                    = 4,
	WaistBendForward                         = 5,
	WaistBendBack                            = 6,
	EThrowType_MAX                           = 7,
};

// Enum Matcha.EItemDefaultNeutralThrowDirection
// NumValues: 0x0005
enum class EItemDefaultNeutralThrowDirection : uint8
{
	Facing                                   = 0,
	Up                                       = 1,
	Down                                     = 2,
	Backwards                                = 3,
	EItemDefaultNeutralThrowDirection_MAX    = 4,
};

// Enum Matcha.EItemAllowedThrowOrFireDirectionType
// NumValues: 0x0003
enum class EItemAllowedThrowOrFireDirectionType : uint8
{
	FacingOnly                               = 0,
	OmniDirection                            = 1,
	EItemAllowedThrowOrFireDirectionType_MAX = 2,
};

// Enum Matcha.EItemUsageType
// NumValues: 0x0005
enum class EItemUsageType : uint8
{
	None                                     = 0,
	Consumable                               = 1,
	Throwable                                = 2,
	Gun                                      = 3,
	EItemUsageType_MAX                       = 4,
};

// Enum Matcha.EItemConsumableType
// NumValues: 0x0005
enum class EItemConsumableType : uint8
{
	None                                     = 0,
	Edible                                   = 1,
	Trap                                     = 2,
	Tech                                     = 3,
	EItemConsumableType_MAX                  = 4,
};

// Enum Matcha.EItemConsumeAnimationType
// NumValues: 0x0005
enum class EItemConsumeAnimationType : uint8
{
	None                                     = 0,
	Food                                     = 1,
	Drink                                    = 2,
	Deploy                                   = 3,
	EItemConsumeAnimationType_MAX            = 4,
};

// Enum Matcha.ETechType
// NumValues: 0x0008
enum class ETechType : uint8
{
	None                                     = 0,
	Ceiling                                  = 1,
	Wall                                     = 2,
	WallJump                                 = 3,
	Ground                                   = 4,
	GroundForward                            = 5,
	GroundBackwards                          = 6,
	ETechType_MAX                            = 7,
};

// Enum Matcha.EKnockDownGetUpType
// NumValues: 0x0006
enum class EKnockDownGetUpType : uint8
{
	None                                     = 0,
	Front                                    = 1,
	Forward                                  = 2,
	Backwards                                = 3,
	Attack                                   = 4,
	EKnockDownGetUpType_MAX                  = 5,
};

// Enum Matcha.ESpecialAttackType
// NumValues: 0x0006
enum class ESpecialAttackType : uint8
{
	Invalid                                  = 0,
	Up                                       = 1,
	Down                                     = 2,
	Side                                     = 3,
	Neutral                                  = 4,
	ESpecialAttackType_MAX                   = 5,
};

// Enum Matcha.EAliveState
// NumValues: 0x0005
enum class EAliveState : uint8
{
	Alive                                    = 0,
	SoulComplete                             = 1,
	SoulBroken                               = 2,
	Dead                                     = 3,
	EAliveState_MAX                          = 4,
};

// Enum Matcha.EMatchaProfileType
// NumValues: 0x0006
enum class EMatchaProfileType : uint8
{
	CSV                                      = 0,
	Insights                                 = 1,
	Network                                  = 2,
	Stat                                     = 3,
	Memory                                   = 4,
	EMatchaProfileType_MAX                   = 5,
};

// Enum Matcha.EObjectRarity
// NumValues: 0x0006
enum class EObjectRarity : uint8
{
	None                                     = 0,
	Common                                   = 1,
	Rare                                     = 2,
	Epic                                     = 3,
	Legendary                                = 4,
	EObjectRarity_MAX                        = 5,
};

// Enum Matcha.EInGameCurrencyType
// NumValues: 0x0004
enum class EInGameCurrencyType : uint8
{
	None                                     = 0,
	Coins                                    = 1,
	PowerSparks                              = 2,
	EInGameCurrencyType_MAX                  = 3,
};

// Enum Matcha.EFallType
// NumValues: 0x0004
enum class EFallType : uint8
{
	Normal                                   = 0,
	Fast                                     = 1,
	DiveBomb                                 = 2,
	EFallType_MAX                            = 3,
};

// Enum Matcha.EJumpType
// NumValues: 0x0008
enum class EJumpType : uint8
{
	Invalid                                  = 0,
	GroundedShortJump                        = 1,
	GroundedFullJump                         = 2,
	AirJump                                  = 3,
	LedgeGetUpJump                           = 4,
	EnvironmentLaunch                        = 5,
	WallJump                                 = 6,
	EJumpType_MAX                            = 7,
};

// Enum Matcha.ETeleportSettingsType
// NumValues: 0x0006
enum class ETeleportSettingsType : uint8
{
	SetLocation                              = 0,
	OffsetFromCharacter                      = 1,
	DistanceTowardsInput                     = 2,
	CompanionEntity                          = 3,
	GlitchMark                               = 4,
	ETeleportSettingsType_MAX                = 5,
};

// Enum Matcha.ELaunchType
// NumValues: 0x0003
enum class ELaunchType : uint8
{
	RootMotion                               = 0,
	CharacterDefault                         = 1,
	ELaunchType_MAX                          = 2,
};

// Enum Matcha.ELaunchActionRestrictionType
// NumValues: 0x0004
enum class ELaunchActionRestrictionType : uint8
{
	None                                     = 0,
	Duration                                 = 1,
	UntilLanding                             = 2,
	ELaunchActionRestrictionType_MAX         = 3,
};

// Enum Matcha.EFrameRateCap
// NumValues: 0x0005
enum class EFrameRateCap : uint8
{
	Unlimited                                = 0,
	Sixty                                    = 1,
	HundredTwenty                            = 2,
	HundredFortyFour                         = 3,
	EFrameRateCap_MAX                        = 4,
};

// Enum Matcha.ETargetedGlitchDashFacingType
// NumValues: 0x0003
enum class ETargetedGlitchDashFacingType : uint8
{
	TowardsTarget                            = 0,
	AwayFromTarget                           = 1,
	ETargetedGlitchDashFacingType_MAX        = 2,
};

// Enum Matcha.ETargetedGlitchDashTargetType
// NumValues: 0x0005
enum class ETargetedGlitchDashTargetType : uint8
{
	GlitchMark                               = 0,
	AimiMark                                 = 1,
	Custom                                   = 2,
	TeamAttack                               = 3,
	ETargetedGlitchDashTargetType_MAX        = 4,
};

// Enum Matcha.EEntitySpawnCondition
// NumValues: 0x0004
enum class EEntitySpawnCondition : uint8
{
	None                                     = 0,
	AliveQuantityLimit                       = 1,
	DoNotSpawnThroughDoors                   = 2,
	EEntitySpawnCondition_MAX                = 3,
};

// Enum Matcha.ETeamFilter
// NumValues: 0x0004
enum class ETeamFilter : uint8
{
	None                                     = 0,
	AlliesOnly                               = 1,
	EnemiesOnly                              = 2,
	ETeamFilter_MAX                          = 3,
};

// Enum Matcha.EEffectEventType
// NumValues: 0x0004
enum class EEffectEventType : uint8
{
	Character                                = 0,
	Hit                                      = 1,
	Generic                                  = 2,
	EEffectEventType_MAX                     = 3,
};

// Enum Matcha.ECharacterKnockOutType
// NumValues: 0x0005
enum class ECharacterKnockOutType : uint8
{
	Default                                  = 0,
	KnockedIntoZone                          = 1,
	KnockedInsideZone                        = 2,
	DamagedInsideZone                        = 3,
	ECharacterKnockOutType_MAX               = 4,
};

// Enum Matcha.ETraversalEntityType
// NumValues: 0x0004
enum class ETraversalEntityType : uint8
{
	None                                     = 0,
	DataStream                               = 1,
	Zipline                                  = 2,
	ETraversalEntityType_MAX                 = 3,
};

// Enum Matcha.EHackType
// NumValues: 0x0006
enum class EHackType : uint8
{
	None                                     = 0,
	Asher                                    = 1,
	Estelle                                  = 2,
	Juliette                                 = 3,
	Luna                                     = 4,
	EHackType_MAX                            = 5,
};

// Enum Matcha.EMatchaEntityRelevanceMode
// NumValues: 0x0006
enum class EMatchaEntityRelevanceMode : uint8
{
	Always                                   = 0,
	OwnerOnly                                = 1,
	TeamOnly                                 = 2,
	Distance                                 = 3,
	Never                                    = 4,
	EMatchaEntityRelevanceMode_MAX           = 5,
};

// Enum Matcha.EMatchaInteractionTriggerMode
// NumValues: 0x0003
enum class EMatchaInteractionTriggerMode : uint8
{
	OverlapOnly                              = 0,
	RequiresInput                            = 1,
	EMatchaInteractionTriggerMode_MAX        = 2,
};

// Enum Matcha.EKnockoutProcessingMode
// NumValues: 0x0004
enum class EKnockoutProcessingMode : uint8
{
	None                                     = 0,
	Always                                   = 1,
	MinimumDamageThreshold                   = 2,
	EKnockoutProcessingMode_MAX              = 3,
};

// Enum Matcha.EMatchaClientServerConnectionTarget
// NumValues: 0x0004
enum class EMatchaClientServerConnectionTarget : uint8
{
	None                                     = 0,
	Local                                    = 1,
	Remote                                   = 2,
	EMatchaClientServerConnectionTarget_MAX  = 3,
};

// Enum Matcha.EMatchaClientRemoteConnectionStatus
// NumValues: 0x0008
enum class EMatchaClientRemoteConnectionStatus : uint8
{
	None                                     = 0,
	WaitingToConnect                         = 1,
	Connecting                               = 2,
	Joining                                  = 3,
	Joined                                   = 4,
	FailedToJoin                             = 5,
	Disconnecting                            = 6,
	EMatchaClientRemoteConnectionStatus_MAX  = 7,
};

// Enum Matcha.EMatchaSplineLoopMode
// NumValues: 0x0004
enum class EMatchaSplineLoopMode : uint8
{
	Default                                  = 0,
	AlwaysFromStart                          = 1,
	PingPong                                 = 2,
	EMatchaSplineLoopMode_MAX                = 3,
};

// Enum Matcha.EMatchaMovingPlatformPhase
// NumValues: 0x0005
enum class EMatchaMovingPlatformPhase : uint8
{
	WaitingToStart                           = 0,
	HoldingAtStart                           = 1,
	Moving                                   = 2,
	HoldingAtEnd                             = 3,
	EMatchaMovingPlatformPhase_MAX           = 4,
};

// Enum Matcha.EMatchaPlayerSlotStatus
// NumValues: 0x0004
enum class EMatchaPlayerSlotStatus : uint8
{
	Empty                                    = 0,
	Human                                    = 1,
	Bot                                      = 2,
	EMatchaPlayerSlotStatus_MAX              = 3,
};

// Enum Matcha.EFallLoopDirection
// NumValues: 0x0004
enum class EFallLoopDirection : uint8
{
	Center                                   = 0,
	Forward                                  = 1,
	Backwards                                = 2,
	EFallLoopDirection_MAX                   = 3,
};

// Enum Matcha.EBufferedInputType
// NumValues: 0x0011
enum class EBufferedInputType : uint8
{
	Invalid                                  = 0,
	MoveStickRightFlick                      = 1,
	MoveStickLeftFlick                       = 2,
	MoveStickUpFlick                         = 3,
	MoveStickDownFlick                       = 4,
	AttackStickRightFlick                    = 5,
	AttackStickLeftFlick                     = 6,
	AttackStickUpFlick                       = 7,
	AttackStickDownFlick                     = 8,
	Attack                                   = 9,
	SpecialAttack                            = 10,
	Jump                                     = 11,
	ShortJump                                = 12,
	Shield                                   = 13,
	Grab                                     = 14,
	TeamAttack                               = 15,
	EBufferedInputType_MAX                   = 16,
};

// Enum Matcha.EBasicAttackType
// NumValues: 0x0004
enum class EBasicAttackType : uint8
{
	Normal                                   = 0,
	Smash                                    = 1,
	Team                                     = 2,
	EBasicAttackType_MAX                     = 3,
};

// Enum Matcha.EHelplessConditionType
// NumValues: 0x0005
enum class EHelplessConditionType : uint8
{
	Default                                  = 0,
	AnySpecialAttackRestrictionMet           = 1,
	AllSpecialAttacksRestrictionsMet         = 2,
	None                                     = 3,
	EHelplessConditionType_MAX               = 4,
};

// Enum Matcha.ESpecialAttackRestrictionUsageType
// NumValues: 0x0004
enum class ESpecialAttackRestrictionUsageType : uint8
{
	Grounded                                 = 0,
	Aerial                                   = 1,
	Both                                     = 2,
	ESpecialAttackRestrictionUsageType_MAX   = 3,
};

// Enum Matcha.ETimedBuffApplicationSource
// NumValues: 0x0003
enum class ETimedBuffApplicationSource : uint8
{
	Thrown                                   = 0,
	Consumed                                 = 1,
	ETimedBuffApplicationSource_MAX          = 2,
};

// Enum Matcha.ETeamAttackTargetSearchType
// NumValues: 0x0004
enum class ETeamAttackTargetSearchType : uint8
{
	ClosestEnemyWithinRange                  = 0,
	ClosestAllyWithinRange                   = 1,
	ClosestEnemyWithinAllyRange              = 2,
	ETeamAttackTargetSearchType_MAX          = 3,
};

// Enum Matcha.ETeamAttackOffsetType
// NumValues: 0x0003
enum class ETeamAttackOffsetType : uint8
{
	FromEnemy                                = 0,
	FromAlly                                 = 1,
	ETeamAttackOffsetType_MAX                = 2,
};

// Enum Matcha.ETeamAttackFacingType
// NumValues: 0x0003
enum class ETeamAttackFacingType : uint8
{
	TowardsTarget                            = 0,
	AwayFromTarget                           = 1,
	ETeamAttackFacingType_MAX                = 2,
};

// Enum Matcha.ESnapNetWorldType
// NumValues: 0x0004
enum class ESnapNetWorldType : uint8
{
	Server                                   = 0,
	Client                                   = 1,
	Render                                   = 2,
	ESnapNetWorldType_MAX                    = 3,
};

// Enum Matcha.ETraversalDirectionType
// NumValues: 0x0003
enum class ETraversalDirectionType : uint8
{
	StartToEndOnly                           = 0,
	AnyDirection                             = 1,
	ETraversalDirectionType_MAX              = 2,
};

// ScriptStruct Matcha.MatchaServicesWebSocketMessageBase
// 0x0008 (0x0008 - 0x0000)
struct FMatchaServicesWebSocketMessageBase
{
public:
	class FName                                   Type;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMatchaServicesWebSocketMessageBase) == 0x000004, "Wrong alignment on FMatchaServicesWebSocketMessageBase");
static_assert(sizeof(FMatchaServicesWebSocketMessageBase) == 0x000008, "Wrong size on FMatchaServicesWebSocketMessageBase");
static_assert(offsetof(FMatchaServicesWebSocketMessageBase, Type) == 0x000000, "Member 'FMatchaServicesWebSocketMessageBase::Type' has a wrong offset!");

// ScriptStruct Matcha.PartyMember
// 0x0008 (0x0008 - 0x0000)
struct FPartyMember final
{
public:
	class FName                                   PlayerId;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPartyMember) == 0x000004, "Wrong alignment on FPartyMember");
static_assert(sizeof(FPartyMember) == 0x000008, "Wrong size on FPartyMember");
static_assert(offsetof(FPartyMember, PlayerId) == 0x000000, "Member 'FPartyMember::PlayerId' has a wrong offset!");

// ScriptStruct Matcha.PlayerInputValues
// 0x003C (0x003C - 0x0000)
struct FPlayerInputValues final
{
public:
	float                                         MoveStickX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveStickY;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttackStickX;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttackStickY;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeSinceLastMoveStickFlick;                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMoveStickUpFlick;                                 // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMoveStickDownFlick;                               // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMoveStickRightFlick;                              // 0x0016(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMoveStickLeftFlick;                               // 0x0017(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttackStickUpFlick;                               // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttackStickDownFlick;                             // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttackStickRightFlick;                            // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttackStickLeftFlick;                             // 0x001B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJump;                                             // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShortJump;                                        // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttack;                                           // 0x001E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpecialAttack;                                    // 0x001F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnergyModifier;                                   // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShield;                                           // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGrab;                                             // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInteract;                                         // 0x0023(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenMap;                                          // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCameraMode;                                       // 0x0025(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDPadLeft;                                         // 0x0026(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDPadUp;                                           // 0x0027(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDPadRight;                                        // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDPadDown;                                         // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoDashSettingEnabled;                           // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeyboardMostRecentVerticalMoveWasUp;              // 0x002B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeyboardMostRecentHorizontalMoveWasRight;         // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeyboardForceWalkModifier;                        // 0x002D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeyboardHeavyAttack;                              // 0x002E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeyboardHeavyAttackModifier;                      // 0x002F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeyboardStartDash;                                // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeyboardTeamAttack;                               // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeyboardEnergyBurst;                              // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveRight;                                         // 0x0033(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveLeft;                                          // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveUp;                                            // 0x0035(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveDown;                                          // 0x0036(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeyboardMoveDownTap;                              // 0x0037(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseIncrementalHeldItemMode;                       // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttackStickCastsTiltAttacks;                      // 0x0039(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlayerInputValues) == 0x000004, "Wrong alignment on FPlayerInputValues");
static_assert(sizeof(FPlayerInputValues) == 0x00003C, "Wrong size on FPlayerInputValues");
static_assert(offsetof(FPlayerInputValues, MoveStickX) == 0x000000, "Member 'FPlayerInputValues::MoveStickX' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, MoveStickY) == 0x000004, "Member 'FPlayerInputValues::MoveStickY' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, AttackStickX) == 0x000008, "Member 'FPlayerInputValues::AttackStickX' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, AttackStickY) == 0x00000C, "Member 'FPlayerInputValues::AttackStickY' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, TimeSinceLastMoveStickFlick) == 0x000010, "Member 'FPlayerInputValues::TimeSinceLastMoveStickFlick' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bMoveStickUpFlick) == 0x000014, "Member 'FPlayerInputValues::bMoveStickUpFlick' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bMoveStickDownFlick) == 0x000015, "Member 'FPlayerInputValues::bMoveStickDownFlick' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bMoveStickRightFlick) == 0x000016, "Member 'FPlayerInputValues::bMoveStickRightFlick' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bMoveStickLeftFlick) == 0x000017, "Member 'FPlayerInputValues::bMoveStickLeftFlick' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bAttackStickUpFlick) == 0x000018, "Member 'FPlayerInputValues::bAttackStickUpFlick' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bAttackStickDownFlick) == 0x000019, "Member 'FPlayerInputValues::bAttackStickDownFlick' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bAttackStickRightFlick) == 0x00001A, "Member 'FPlayerInputValues::bAttackStickRightFlick' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bAttackStickLeftFlick) == 0x00001B, "Member 'FPlayerInputValues::bAttackStickLeftFlick' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bJump) == 0x00001C, "Member 'FPlayerInputValues::bJump' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bShortJump) == 0x00001D, "Member 'FPlayerInputValues::bShortJump' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bAttack) == 0x00001E, "Member 'FPlayerInputValues::bAttack' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bSpecialAttack) == 0x00001F, "Member 'FPlayerInputValues::bSpecialAttack' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bEnergyModifier) == 0x000020, "Member 'FPlayerInputValues::bEnergyModifier' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bShield) == 0x000021, "Member 'FPlayerInputValues::bShield' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bGrab) == 0x000022, "Member 'FPlayerInputValues::bGrab' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bInteract) == 0x000023, "Member 'FPlayerInputValues::bInteract' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bOpenMap) == 0x000024, "Member 'FPlayerInputValues::bOpenMap' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bCameraMode) == 0x000025, "Member 'FPlayerInputValues::bCameraMode' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bDPadLeft) == 0x000026, "Member 'FPlayerInputValues::bDPadLeft' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bDPadUp) == 0x000027, "Member 'FPlayerInputValues::bDPadUp' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bDPadRight) == 0x000028, "Member 'FPlayerInputValues::bDPadRight' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bDPadDown) == 0x000029, "Member 'FPlayerInputValues::bDPadDown' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bAutoDashSettingEnabled) == 0x00002A, "Member 'FPlayerInputValues::bAutoDashSettingEnabled' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bKeyboardMostRecentVerticalMoveWasUp) == 0x00002B, "Member 'FPlayerInputValues::bKeyboardMostRecentVerticalMoveWasUp' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bKeyboardMostRecentHorizontalMoveWasRight) == 0x00002C, "Member 'FPlayerInputValues::bKeyboardMostRecentHorizontalMoveWasRight' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bKeyboardForceWalkModifier) == 0x00002D, "Member 'FPlayerInputValues::bKeyboardForceWalkModifier' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bKeyboardHeavyAttack) == 0x00002E, "Member 'FPlayerInputValues::bKeyboardHeavyAttack' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bKeyboardHeavyAttackModifier) == 0x00002F, "Member 'FPlayerInputValues::bKeyboardHeavyAttackModifier' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bKeyboardStartDash) == 0x000030, "Member 'FPlayerInputValues::bKeyboardStartDash' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bKeyboardTeamAttack) == 0x000031, "Member 'FPlayerInputValues::bKeyboardTeamAttack' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bKeyboardEnergyBurst) == 0x000032, "Member 'FPlayerInputValues::bKeyboardEnergyBurst' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, MoveRight) == 0x000033, "Member 'FPlayerInputValues::MoveRight' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, MoveLeft) == 0x000034, "Member 'FPlayerInputValues::MoveLeft' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, MoveUp) == 0x000035, "Member 'FPlayerInputValues::MoveUp' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, MoveDown) == 0x000036, "Member 'FPlayerInputValues::MoveDown' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bKeyboardMoveDownTap) == 0x000037, "Member 'FPlayerInputValues::bKeyboardMoveDownTap' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bUseIncrementalHeldItemMode) == 0x000038, "Member 'FPlayerInputValues::bUseIncrementalHeldItemMode' has a wrong offset!");
static_assert(offsetof(FPlayerInputValues, bAttackStickCastsTiltAttacks) == 0x000039, "Member 'FPlayerInputValues::bAttackStickCastsTiltAttacks' has a wrong offset!");

// ScriptStruct Matcha.ShieldInfo
// 0x00D8 (0x00D8 - 0x0000)
struct FShieldInfo final
{
public:
	struct FSnapNetPropertyEnum                   State;                                             // 0x0000(0x0048)(NativeAccessSpecifierPublic)
	struct FSnapNetPropertyFloat                  Health;                                            // 0x0048(0x0040)(NativeAccessSpecifierPublic)
	struct FSnapNetPropertyInt32                  LastInputTime;                                     // 0x0088(0x0038)(NativeAccessSpecifierPublic)
	struct FSnapNetPropertyBoolean                bIsShieldInvincible;                               // 0x00C0(0x0018)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FShieldInfo) == 0x000008, "Wrong alignment on FShieldInfo");
static_assert(sizeof(FShieldInfo) == 0x0000D8, "Wrong size on FShieldInfo");
static_assert(offsetof(FShieldInfo, State) == 0x000000, "Member 'FShieldInfo::State' has a wrong offset!");
static_assert(offsetof(FShieldInfo, Health) == 0x000048, "Member 'FShieldInfo::Health' has a wrong offset!");
static_assert(offsetof(FShieldInfo, LastInputTime) == 0x000088, "Member 'FShieldInfo::LastInputTime' has a wrong offset!");
static_assert(offsetof(FShieldInfo, bIsShieldInvincible) == 0x0000C0, "Member 'FShieldInfo::bIsShieldInvincible' has a wrong offset!");

// ScriptStruct Matcha.MatchaGameplayAnalyticsV1MontageStat
// 0x0008 (0x0008 - 0x0000)
struct FMatchaGameplayAnalyticsV1MontageStat final
{
public:
	EMatchaCharacterMontageType                   Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMatchaGameplayAnalyticsV1MontageStat) == 0x000004, "Wrong alignment on FMatchaGameplayAnalyticsV1MontageStat");
static_assert(sizeof(FMatchaGameplayAnalyticsV1MontageStat) == 0x000008, "Wrong size on FMatchaGameplayAnalyticsV1MontageStat");
static_assert(offsetof(FMatchaGameplayAnalyticsV1MontageStat, Type) == 0x000000, "Member 'FMatchaGameplayAnalyticsV1MontageStat::Type' has a wrong offset!");
static_assert(offsetof(FMatchaGameplayAnalyticsV1MontageStat, Count) == 0x000004, "Member 'FMatchaGameplayAnalyticsV1MontageStat::Count' has a wrong offset!");

// ScriptStruct Matcha.MatchaGameplayAnalyticsV1PlayerStats
// 0x0028 (0x0028 - 0x0000)
struct FMatchaGameplayAnalyticsV1PlayerStats final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerName;                                        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMatchaGameplayAnalyticsV1MontageStat> MontageStats;                                      // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMatchaGameplayAnalyticsV1PlayerStats) == 0x000008, "Wrong alignment on FMatchaGameplayAnalyticsV1PlayerStats");
static_assert(sizeof(FMatchaGameplayAnalyticsV1PlayerStats) == 0x000028, "Wrong size on FMatchaGameplayAnalyticsV1PlayerStats");
static_assert(offsetof(FMatchaGameplayAnalyticsV1PlayerStats, PlayerIndex) == 0x000000, "Member 'FMatchaGameplayAnalyticsV1PlayerStats::PlayerIndex' has a wrong offset!");
static_assert(offsetof(FMatchaGameplayAnalyticsV1PlayerStats, PlayerName) == 0x000008, "Member 'FMatchaGameplayAnalyticsV1PlayerStats::PlayerName' has a wrong offset!");
static_assert(offsetof(FMatchaGameplayAnalyticsV1PlayerStats, MontageStats) == 0x000018, "Member 'FMatchaGameplayAnalyticsV1PlayerStats::MontageStats' has a wrong offset!");

// ScriptStruct Matcha.MatchaGameplayAnalyticsV1
// 0x0010 (0x0010 - 0x0000)
struct FMatchaGameplayAnalyticsV1 final
{
public:
	TArray<struct FMatchaGameplayAnalyticsV1PlayerStats> PlayerStats;                                       // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMatchaGameplayAnalyticsV1) == 0x000008, "Wrong alignment on FMatchaGameplayAnalyticsV1");
static_assert(sizeof(FMatchaGameplayAnalyticsV1) == 0x000010, "Wrong size on FMatchaGameplayAnalyticsV1");
static_assert(offsetof(FMatchaGameplayAnalyticsV1, PlayerStats) == 0x000000, "Member 'FMatchaGameplayAnalyticsV1::PlayerStats' has a wrong offset!");

// ScriptStruct Matcha.MatchaFlickConfiguration
// 0x000C (0x000C - 0x0000)
struct FMatchaFlickConfiguration final
{
public:
	float                                         StickTravelDistance;                               // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeWindow;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseNewFlickMethod;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMatchaFlickConfiguration) == 0x000004, "Wrong alignment on FMatchaFlickConfiguration");
static_assert(sizeof(FMatchaFlickConfiguration) == 0x00000C, "Wrong size on FMatchaFlickConfiguration");
static_assert(offsetof(FMatchaFlickConfiguration, StickTravelDistance) == 0x000000, "Member 'FMatchaFlickConfiguration::StickTravelDistance' has a wrong offset!");
static_assert(offsetof(FMatchaFlickConfiguration, TimeWindow) == 0x000004, "Member 'FMatchaFlickConfiguration::TimeWindow' has a wrong offset!");
