#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Matcha

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "OdyUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OdyServices_structs.hpp"
#include "SnapNet_structs.hpp"


namespace SDK::Params
{

// Function Matcha.LegacyMatchaServicesConfiguration.GetWebSocketUrlClient
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaServicesConfiguration_GetWebSocketUrlClient final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaServicesConfiguration_GetWebSocketUrlClient) == 0x000008, "Wrong alignment on LegacyMatchaServicesConfiguration_GetWebSocketUrlClient");
static_assert(sizeof(LegacyMatchaServicesConfiguration_GetWebSocketUrlClient) == 0x000010, "Wrong size on LegacyMatchaServicesConfiguration_GetWebSocketUrlClient");
static_assert(offsetof(LegacyMatchaServicesConfiguration_GetWebSocketUrlClient, ReturnValue) == 0x000000, "Member 'LegacyMatchaServicesConfiguration_GetWebSocketUrlClient::ReturnValue' has a wrong offset!");

// Function Matcha.LegacyMatchaServicesConfiguration.GetWebSocketUrlServer
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaServicesConfiguration_GetWebSocketUrlServer final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaServicesConfiguration_GetWebSocketUrlServer) == 0x000008, "Wrong alignment on LegacyMatchaServicesConfiguration_GetWebSocketUrlServer");
static_assert(sizeof(LegacyMatchaServicesConfiguration_GetWebSocketUrlServer) == 0x000010, "Wrong size on LegacyMatchaServicesConfiguration_GetWebSocketUrlServer");
static_assert(offsetof(LegacyMatchaServicesConfiguration_GetWebSocketUrlServer, ReturnValue) == 0x000000, "Member 'LegacyMatchaServicesConfiguration_GetWebSocketUrlServer::ReturnValue' has a wrong offset!");

// Function Matcha.LegacyMatchaServicesConfiguration.GetWebSocketUrlServices
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaServicesConfiguration_GetWebSocketUrlServices final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaServicesConfiguration_GetWebSocketUrlServices) == 0x000008, "Wrong alignment on LegacyMatchaServicesConfiguration_GetWebSocketUrlServices");
static_assert(sizeof(LegacyMatchaServicesConfiguration_GetWebSocketUrlServices) == 0x000010, "Wrong size on LegacyMatchaServicesConfiguration_GetWebSocketUrlServices");
static_assert(offsetof(LegacyMatchaServicesConfiguration_GetWebSocketUrlServices, ReturnValue) == 0x000000, "Member 'LegacyMatchaServicesConfiguration_GetWebSocketUrlServices::ReturnValue' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.Get
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaQueueServices_Get final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULegacyMatchaQueueServices*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaQueueServices_Get) == 0x000008, "Wrong alignment on LegacyMatchaQueueServices_Get");
static_assert(sizeof(LegacyMatchaQueueServices_Get) == 0x000010, "Wrong size on LegacyMatchaQueueServices_Get");
static_assert(offsetof(LegacyMatchaQueueServices_Get, WorldContextObject) == 0x000000, "Member 'LegacyMatchaQueueServices_Get::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LegacyMatchaQueueServices_Get, ReturnValue) == 0x000008, "Member 'LegacyMatchaQueueServices_Get::ReturnValue' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.GetServicesConfiguration
// 0x0008 (0x0008 - 0x0000)
struct LegacyMatchaQueueServices_GetServicesConfiguration final
{
public:
	const class ULegacyMatchaServicesConfiguration* ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaQueueServices_GetServicesConfiguration) == 0x000008, "Wrong alignment on LegacyMatchaQueueServices_GetServicesConfiguration");
static_assert(sizeof(LegacyMatchaQueueServices_GetServicesConfiguration) == 0x000008, "Wrong size on LegacyMatchaQueueServices_GetServicesConfiguration");
static_assert(offsetof(LegacyMatchaQueueServices_GetServicesConfiguration, ReturnValue) == 0x000000, "Member 'LegacyMatchaQueueServices_GetServicesConfiguration::ReturnValue' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.AcceptInvite
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaQueueServices_AcceptInvite final
{
public:
	class FString                                 Target;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaQueueServices_AcceptInvite) == 0x000008, "Wrong alignment on LegacyMatchaQueueServices_AcceptInvite");
static_assert(sizeof(LegacyMatchaQueueServices_AcceptInvite) == 0x000010, "Wrong size on LegacyMatchaQueueServices_AcceptInvite");
static_assert(offsetof(LegacyMatchaQueueServices_AcceptInvite, Target) == 0x000000, "Member 'LegacyMatchaQueueServices_AcceptInvite::Target' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.CancelInvite
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaQueueServices_CancelInvite final
{
public:
	class FString                                 Target;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaQueueServices_CancelInvite) == 0x000008, "Wrong alignment on LegacyMatchaQueueServices_CancelInvite");
static_assert(sizeof(LegacyMatchaQueueServices_CancelInvite) == 0x000010, "Wrong size on LegacyMatchaQueueServices_CancelInvite");
static_assert(offsetof(LegacyMatchaQueueServices_CancelInvite, Target) == 0x000000, "Member 'LegacyMatchaQueueServices_CancelInvite::Target' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.RejectInvite
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaQueueServices_RejectInvite final
{
public:
	class FString                                 Target;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaQueueServices_RejectInvite) == 0x000008, "Wrong alignment on LegacyMatchaQueueServices_RejectInvite");
static_assert(sizeof(LegacyMatchaQueueServices_RejectInvite) == 0x000010, "Wrong size on LegacyMatchaQueueServices_RejectInvite");
static_assert(offsetof(LegacyMatchaQueueServices_RejectInvite, Target) == 0x000000, "Member 'LegacyMatchaQueueServices_RejectInvite::Target' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.SendInvite
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaQueueServices_SendInvite final
{
public:
	class FString                                 Target;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaQueueServices_SendInvite) == 0x000008, "Wrong alignment on LegacyMatchaQueueServices_SendInvite");
static_assert(sizeof(LegacyMatchaQueueServices_SendInvite) == 0x000010, "Wrong size on LegacyMatchaQueueServices_SendInvite");
static_assert(offsetof(LegacyMatchaQueueServices_SendInvite, Target) == 0x000000, "Member 'LegacyMatchaQueueServices_SendInvite::Target' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.SetConnectedPlayerIds
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaQueueServices_SetConnectedPlayerIds final
{
public:
	TArray<class FName>                           PlayerIds;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaQueueServices_SetConnectedPlayerIds) == 0x000008, "Wrong alignment on LegacyMatchaQueueServices_SetConnectedPlayerIds");
static_assert(sizeof(LegacyMatchaQueueServices_SetConnectedPlayerIds) == 0x000010, "Wrong size on LegacyMatchaQueueServices_SetConnectedPlayerIds");
static_assert(offsetof(LegacyMatchaQueueServices_SetConnectedPlayerIds, PlayerIds) == 0x000000, "Member 'LegacyMatchaQueueServices_SetConnectedPlayerIds::PlayerIds' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.SetIdentification
// 0x0028 (0x0028 - 0x0000)
struct LegacyMatchaQueueServices_SetIdentification final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMatchServer;                                     // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LegacyMatchaQueueServices_SetIdentification) == 0x000008, "Wrong alignment on LegacyMatchaQueueServices_SetIdentification");
static_assert(sizeof(LegacyMatchaQueueServices_SetIdentification) == 0x000028, "Wrong size on LegacyMatchaQueueServices_SetIdentification");
static_assert(offsetof(LegacyMatchaQueueServices_SetIdentification, Name_0) == 0x000000, "Member 'LegacyMatchaQueueServices_SetIdentification::Name_0' has a wrong offset!");
static_assert(offsetof(LegacyMatchaQueueServices_SetIdentification, URL) == 0x000010, "Member 'LegacyMatchaQueueServices_SetIdentification::URL' has a wrong offset!");
static_assert(offsetof(LegacyMatchaQueueServices_SetIdentification, IsMatchServer) == 0x000020, "Member 'LegacyMatchaQueueServices_SetIdentification::IsMatchServer' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.SetMatchPhase
// 0x0001 (0x0001 - 0x0000)
struct LegacyMatchaQueueServices_SetMatchPhase final
{
public:
	EMatchaMatchPhase                             MatchPhase;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaQueueServices_SetMatchPhase) == 0x000001, "Wrong alignment on LegacyMatchaQueueServices_SetMatchPhase");
static_assert(sizeof(LegacyMatchaQueueServices_SetMatchPhase) == 0x000001, "Wrong size on LegacyMatchaQueueServices_SetMatchPhase");
static_assert(offsetof(LegacyMatchaQueueServices_SetMatchPhase, MatchPhase) == 0x000000, "Member 'LegacyMatchaQueueServices_SetMatchPhase::MatchPhase' has a wrong offset!");

// Function Matcha.LegacyMatchaQueueServices.SetName
// 0x0010 (0x0010 - 0x0000)
struct LegacyMatchaQueueServices_SetName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LegacyMatchaQueueServices_SetName) == 0x000008, "Wrong alignment on LegacyMatchaQueueServices_SetName");
static_assert(sizeof(LegacyMatchaQueueServices_SetName) == 0x000010, "Wrong size on LegacyMatchaQueueServices_SetName");
static_assert(offsetof(LegacyMatchaQueueServices_SetName, Name_0) == 0x000000, "Member 'LegacyMatchaQueueServices_SetName::Name_0' has a wrong offset!");

// Function Matcha.MatchaAICharacterEntity.Get
// 0x0018 (0x0018 - 0x0000)
struct MatchaAICharacterEntity_Get final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          WorldContextObject;                                // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMatchaAICharacterEntity*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAICharacterEntity_Get) == 0x000008, "Wrong alignment on MatchaAICharacterEntity_Get");
static_assert(sizeof(MatchaAICharacterEntity_Get) == 0x000018, "Wrong size on MatchaAICharacterEntity_Get");
static_assert(offsetof(MatchaAICharacterEntity_Get, PlayerIndex) == 0x000000, "Member 'MatchaAICharacterEntity_Get::PlayerIndex' has a wrong offset!");
static_assert(offsetof(MatchaAICharacterEntity_Get, WorldContextObject) == 0x000008, "Member 'MatchaAICharacterEntity_Get::WorldContextObject' has a wrong offset!");
static_assert(offsetof(MatchaAICharacterEntity_Get, ReturnValue) == 0x000010, "Member 'MatchaAICharacterEntity_Get::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaAICharacterEntity.GetFromSimulation
// 0x0018 (0x0018 - 0x0000)
struct MatchaAICharacterEntity_GetFromSimulation final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USnapNetSimulation*               SnapNetSimulation;                                 // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMatchaAICharacterEntity*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAICharacterEntity_GetFromSimulation) == 0x000008, "Wrong alignment on MatchaAICharacterEntity_GetFromSimulation");
static_assert(sizeof(MatchaAICharacterEntity_GetFromSimulation) == 0x000018, "Wrong size on MatchaAICharacterEntity_GetFromSimulation");
static_assert(offsetof(MatchaAICharacterEntity_GetFromSimulation, PlayerIndex) == 0x000000, "Member 'MatchaAICharacterEntity_GetFromSimulation::PlayerIndex' has a wrong offset!");
static_assert(offsetof(MatchaAICharacterEntity_GetFromSimulation, SnapNetSimulation) == 0x000008, "Member 'MatchaAICharacterEntity_GetFromSimulation::SnapNetSimulation' has a wrong offset!");
static_assert(offsetof(MatchaAICharacterEntity_GetFromSimulation, ReturnValue) == 0x000010, "Member 'MatchaAICharacterEntity_GetFromSimulation::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaAICharacterEntity.CharacterTeleport
// 0x0038 (0x0038 - 0x0000)
struct MatchaAICharacterEntity_CharacterTeleport final
{
public:
	struct FVector                                DestinationLocation;                               // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               DestinationRotation;                               // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsATest;                                          // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoCheck;                                          // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaAICharacterEntity_CharacterTeleport) == 0x000008, "Wrong alignment on MatchaAICharacterEntity_CharacterTeleport");
static_assert(sizeof(MatchaAICharacterEntity_CharacterTeleport) == 0x000038, "Wrong size on MatchaAICharacterEntity_CharacterTeleport");
static_assert(offsetof(MatchaAICharacterEntity_CharacterTeleport, DestinationLocation) == 0x000000, "Member 'MatchaAICharacterEntity_CharacterTeleport::DestinationLocation' has a wrong offset!");
static_assert(offsetof(MatchaAICharacterEntity_CharacterTeleport, DestinationRotation) == 0x000018, "Member 'MatchaAICharacterEntity_CharacterTeleport::DestinationRotation' has a wrong offset!");
static_assert(offsetof(MatchaAICharacterEntity_CharacterTeleport, bIsATest) == 0x000030, "Member 'MatchaAICharacterEntity_CharacterTeleport::bIsATest' has a wrong offset!");
static_assert(offsetof(MatchaAICharacterEntity_CharacterTeleport, bNoCheck) == 0x000031, "Member 'MatchaAICharacterEntity_CharacterTeleport::bNoCheck' has a wrong offset!");
static_assert(offsetof(MatchaAICharacterEntity_CharacterTeleport, ReturnValue) == 0x000032, "Member 'MatchaAICharacterEntity_CharacterTeleport::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaAICharacterEntity.PlayAnimationAtIndex
// 0x0004 (0x0004 - 0x0000)
struct MatchaAICharacterEntity_PlayAnimationAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAICharacterEntity_PlayAnimationAtIndex) == 0x000004, "Wrong alignment on MatchaAICharacterEntity_PlayAnimationAtIndex");
static_assert(sizeof(MatchaAICharacterEntity_PlayAnimationAtIndex) == 0x000004, "Wrong size on MatchaAICharacterEntity_PlayAnimationAtIndex");
static_assert(offsetof(MatchaAICharacterEntity_PlayAnimationAtIndex, Index_0) == 0x000000, "Member 'MatchaAICharacterEntity_PlayAnimationAtIndex::Index_0' has a wrong offset!");

// Function Matcha.MatchaAICharacterEntity.SetInvulnerable
// 0x0001 (0x0001 - 0x0000)
struct MatchaAICharacterEntity_SetInvulnerable final
{
public:
	bool                                          bShouldBeInvulnerable;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAICharacterEntity_SetInvulnerable) == 0x000001, "Wrong alignment on MatchaAICharacterEntity_SetInvulnerable");
static_assert(sizeof(MatchaAICharacterEntity_SetInvulnerable) == 0x000001, "Wrong size on MatchaAICharacterEntity_SetInvulnerable");
static_assert(offsetof(MatchaAICharacterEntity_SetInvulnerable, bShouldBeInvulnerable) == 0x000000, "Member 'MatchaAICharacterEntity_SetInvulnerable::bShouldBeInvulnerable' has a wrong offset!");

// Function Matcha.MatchaAICharacterEntity.GetAggroDistance
// 0x0004 (0x0004 - 0x0000)
struct MatchaAICharacterEntity_GetAggroDistance final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAICharacterEntity_GetAggroDistance) == 0x000004, "Wrong alignment on MatchaAICharacterEntity_GetAggroDistance");
static_assert(sizeof(MatchaAICharacterEntity_GetAggroDistance) == 0x000004, "Wrong size on MatchaAICharacterEntity_GetAggroDistance");
static_assert(offsetof(MatchaAICharacterEntity_GetAggroDistance, ReturnValue) == 0x000000, "Member 'MatchaAICharacterEntity_GetAggroDistance::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaAICharacterEntity.GetSpawnLocation
// 0x0018 (0x0018 - 0x0000)
struct MatchaAICharacterEntity_GetSpawnLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAICharacterEntity_GetSpawnLocation) == 0x000008, "Wrong alignment on MatchaAICharacterEntity_GetSpawnLocation");
static_assert(sizeof(MatchaAICharacterEntity_GetSpawnLocation) == 0x000018, "Wrong size on MatchaAICharacterEntity_GetSpawnLocation");
static_assert(offsetof(MatchaAICharacterEntity_GetSpawnLocation, ReturnValue) == 0x000000, "Member 'MatchaAICharacterEntity_GetSpawnLocation::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaAICharacterEntity.ToggleBehaviorTree
// 0x0001 (0x0001 - 0x0000)
struct MatchaAICharacterEntity_ToggleBehaviorTree final
{
public:
	bool                                          bShouldEnable;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAICharacterEntity_ToggleBehaviorTree) == 0x000001, "Wrong alignment on MatchaAICharacterEntity_ToggleBehaviorTree");
static_assert(sizeof(MatchaAICharacterEntity_ToggleBehaviorTree) == 0x000001, "Wrong size on MatchaAICharacterEntity_ToggleBehaviorTree");
static_assert(offsetof(MatchaAICharacterEntity_ToggleBehaviorTree, bShouldEnable) == 0x000000, "Member 'MatchaAICharacterEntity_ToggleBehaviorTree::bShouldEnable' has a wrong offset!");

// Function Matcha.MatchaSnapNetEntity.OnEnabledChanged
// 0x0002 (0x0002 - 0x0000)
struct MatchaSnapNetEntity_OnEnabledChanged final
{
public:
	bool                                          bOldEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewEnabled;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetEntity_OnEnabledChanged) == 0x000001, "Wrong alignment on MatchaSnapNetEntity_OnEnabledChanged");
static_assert(sizeof(MatchaSnapNetEntity_OnEnabledChanged) == 0x000002, "Wrong size on MatchaSnapNetEntity_OnEnabledChanged");
static_assert(offsetof(MatchaSnapNetEntity_OnEnabledChanged, bOldEnabled) == 0x000000, "Member 'MatchaSnapNetEntity_OnEnabledChanged::bOldEnabled' has a wrong offset!");
static_assert(offsetof(MatchaSnapNetEntity_OnEnabledChanged, bNewEnabled) == 0x000001, "Member 'MatchaSnapNetEntity_OnEnabledChanged::bNewEnabled' has a wrong offset!");

// Function Matcha.MatchaSnapNetEntity.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct MatchaSnapNetEntity_SetEnabled final
{
public:
	bool                                          bShouldEnable;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetEntity_SetEnabled) == 0x000001, "Wrong alignment on MatchaSnapNetEntity_SetEnabled");
static_assert(sizeof(MatchaSnapNetEntity_SetEnabled) == 0x000001, "Wrong size on MatchaSnapNetEntity_SetEnabled");
static_assert(offsetof(MatchaSnapNetEntity_SetEnabled, bShouldEnable) == 0x000000, "Member 'MatchaSnapNetEntity_SetEnabled::bShouldEnable' has a wrong offset!");

// Function Matcha.MatchaSnapNetEntity.GetCurrentEntityTimeInMilliseconds
// 0x0004 (0x0004 - 0x0000)
struct MatchaSnapNetEntity_GetCurrentEntityTimeInMilliseconds final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetEntity_GetCurrentEntityTimeInMilliseconds) == 0x000004, "Wrong alignment on MatchaSnapNetEntity_GetCurrentEntityTimeInMilliseconds");
static_assert(sizeof(MatchaSnapNetEntity_GetCurrentEntityTimeInMilliseconds) == 0x000004, "Wrong size on MatchaSnapNetEntity_GetCurrentEntityTimeInMilliseconds");
static_assert(offsetof(MatchaSnapNetEntity_GetCurrentEntityTimeInMilliseconds, ReturnValue) == 0x000000, "Member 'MatchaSnapNetEntity_GetCurrentEntityTimeInMilliseconds::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaSnapNetEntity.GetMillisecondsSinceCreation
// 0x0004 (0x0004 - 0x0000)
struct MatchaSnapNetEntity_GetMillisecondsSinceCreation final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetEntity_GetMillisecondsSinceCreation) == 0x000004, "Wrong alignment on MatchaSnapNetEntity_GetMillisecondsSinceCreation");
static_assert(sizeof(MatchaSnapNetEntity_GetMillisecondsSinceCreation) == 0x000004, "Wrong size on MatchaSnapNetEntity_GetMillisecondsSinceCreation");
static_assert(offsetof(MatchaSnapNetEntity_GetMillisecondsSinceCreation, ReturnValue) == 0x000000, "Member 'MatchaSnapNetEntity_GetMillisecondsSinceCreation::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaSnapNetEntity.GetOwnerEntity
// 0x0008 (0x0008 - 0x0000)
struct MatchaSnapNetEntity_GetOwnerEntity final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetEntity_GetOwnerEntity) == 0x000008, "Wrong alignment on MatchaSnapNetEntity_GetOwnerEntity");
static_assert(sizeof(MatchaSnapNetEntity_GetOwnerEntity) == 0x000008, "Wrong size on MatchaSnapNetEntity_GetOwnerEntity");
static_assert(offsetof(MatchaSnapNetEntity_GetOwnerEntity, ReturnValue) == 0x000000, "Member 'MatchaSnapNetEntity_GetOwnerEntity::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaSnapNetEntity.GetOwnerEntityIndex
// 0x0004 (0x0004 - 0x0000)
struct MatchaSnapNetEntity_GetOwnerEntityIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetEntity_GetOwnerEntityIndex) == 0x000004, "Wrong alignment on MatchaSnapNetEntity_GetOwnerEntityIndex");
static_assert(sizeof(MatchaSnapNetEntity_GetOwnerEntityIndex) == 0x000004, "Wrong size on MatchaSnapNetEntity_GetOwnerEntityIndex");
static_assert(offsetof(MatchaSnapNetEntity_GetOwnerEntityIndex, ReturnValue) == 0x000000, "Member 'MatchaSnapNetEntity_GetOwnerEntityIndex::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaSnapNetEntity.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct MatchaSnapNetEntity_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetEntity_IsEnabled) == 0x000001, "Wrong alignment on MatchaSnapNetEntity_IsEnabled");
static_assert(sizeof(MatchaSnapNetEntity_IsEnabled) == 0x000001, "Wrong size on MatchaSnapNetEntity_IsEnabled");
static_assert(offsetof(MatchaSnapNetEntity_IsEnabled, ReturnValue) == 0x000000, "Member 'MatchaSnapNetEntity_IsEnabled::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaSnapNetGameEntity.Get
// 0x0010 (0x0010 - 0x0000)
struct MatchaSnapNetGameEntity_Get final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMatchaSnapNetGameEntity*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetGameEntity_Get) == 0x000008, "Wrong alignment on MatchaSnapNetGameEntity_Get");
static_assert(sizeof(MatchaSnapNetGameEntity_Get) == 0x000010, "Wrong size on MatchaSnapNetGameEntity_Get");
static_assert(offsetof(MatchaSnapNetGameEntity_Get, WorldContextObject) == 0x000000, "Member 'MatchaSnapNetGameEntity_Get::WorldContextObject' has a wrong offset!");
static_assert(offsetof(MatchaSnapNetGameEntity_Get, ReturnValue) == 0x000008, "Member 'MatchaSnapNetGameEntity_Get::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaSnapNetGameEntity.OnAnyActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct MatchaSnapNetGameEntity_OnAnyActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetGameEntity_OnAnyActorDestroyed) == 0x000008, "Wrong alignment on MatchaSnapNetGameEntity_OnAnyActorDestroyed");
static_assert(sizeof(MatchaSnapNetGameEntity_OnAnyActorDestroyed) == 0x000008, "Wrong size on MatchaSnapNetGameEntity_OnAnyActorDestroyed");
static_assert(offsetof(MatchaSnapNetGameEntity_OnAnyActorDestroyed, DestroyedActor) == 0x000000, "Member 'MatchaSnapNetGameEntity_OnAnyActorDestroyed::DestroyedActor' has a wrong offset!");

// Function Matcha.MatchaSnapNetGameEntity.OnAnyActorSpawned
// 0x0008 (0x0008 - 0x0000)
struct MatchaSnapNetGameEntity_OnAnyActorSpawned final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetGameEntity_OnAnyActorSpawned) == 0x000008, "Wrong alignment on MatchaSnapNetGameEntity_OnAnyActorSpawned");
static_assert(sizeof(MatchaSnapNetGameEntity_OnAnyActorSpawned) == 0x000008, "Wrong size on MatchaSnapNetGameEntity_OnAnyActorSpawned");
static_assert(offsetof(MatchaSnapNetGameEntity_OnAnyActorSpawned, SpawnedActor) == 0x000000, "Member 'MatchaSnapNetGameEntity_OnAnyActorSpawned::SpawnedActor' has a wrong offset!");

// Function Matcha.MatchaSnapNetGameEntity.GetCurrentMatchPhase
// 0x0001 (0x0001 - 0x0000)
struct MatchaSnapNetGameEntity_GetCurrentMatchPhase final
{
public:
	EMatchaMatchPhase                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaSnapNetGameEntity_GetCurrentMatchPhase) == 0x000001, "Wrong alignment on MatchaSnapNetGameEntity_GetCurrentMatchPhase");
static_assert(sizeof(MatchaSnapNetGameEntity_GetCurrentMatchPhase) == 0x000001, "Wrong size on MatchaSnapNetGameEntity_GetCurrentMatchPhase");
static_assert(offsetof(MatchaSnapNetGameEntity_GetCurrentMatchPhase, ReturnValue) == 0x000000, "Member 'MatchaSnapNetGameEntity_GetCurrentMatchPhase::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaAnalyticsManager.OnCharacterMontageStarted
// 0x0010 (0x0010 - 0x0000)
struct MatchaAnalyticsManager_OnCharacterMontageStarted final
{
public:
	class AMatchaCharacterBase*                   CharacterEntity;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MontageDuration;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMatchaCharacterMontageType                   MontageType;                                       // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMatchaCharacterMontageType                   PreviousMontageType;                               // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaAnalyticsManager_OnCharacterMontageStarted) == 0x000008, "Wrong alignment on MatchaAnalyticsManager_OnCharacterMontageStarted");
static_assert(sizeof(MatchaAnalyticsManager_OnCharacterMontageStarted) == 0x000010, "Wrong size on MatchaAnalyticsManager_OnCharacterMontageStarted");
static_assert(offsetof(MatchaAnalyticsManager_OnCharacterMontageStarted, CharacterEntity) == 0x000000, "Member 'MatchaAnalyticsManager_OnCharacterMontageStarted::CharacterEntity' has a wrong offset!");
static_assert(offsetof(MatchaAnalyticsManager_OnCharacterMontageStarted, MontageDuration) == 0x000008, "Member 'MatchaAnalyticsManager_OnCharacterMontageStarted::MontageDuration' has a wrong offset!");
static_assert(offsetof(MatchaAnalyticsManager_OnCharacterMontageStarted, MontageType) == 0x00000C, "Member 'MatchaAnalyticsManager_OnCharacterMontageStarted::MontageType' has a wrong offset!");
static_assert(offsetof(MatchaAnalyticsManager_OnCharacterMontageStarted, PreviousMontageType) == 0x00000D, "Member 'MatchaAnalyticsManager_OnCharacterMontageStarted::PreviousMontageType' has a wrong offset!");

// Function Matcha.MatchaAnalyticsManager.OnMatchPhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct MatchaAnalyticsManager_OnMatchPhaseChanged final
{
public:
	EMatchaMatchPhase                             MatchPhase;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAnalyticsManager_OnMatchPhaseChanged) == 0x000001, "Wrong alignment on MatchaAnalyticsManager_OnMatchPhaseChanged");
static_assert(sizeof(MatchaAnalyticsManager_OnMatchPhaseChanged) == 0x000001, "Wrong size on MatchaAnalyticsManager_OnMatchPhaseChanged");
static_assert(offsetof(MatchaAnalyticsManager_OnMatchPhaseChanged, MatchPhase) == 0x000000, "Member 'MatchaAnalyticsManager_OnMatchPhaseChanged::MatchPhase' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.AddHitBox
// 0x00C8 (0x00C8 - 0x0000)
struct MatchaCharacterBase_AddHitBox final
{
public:
	struct FMatchaHitBoxData                      HitBoxData;                                        // 0x0000(0x00A8)(Parm, NativeAccessSpecifierPublic)
	class UObject*                                Source;                                            // 0x00A8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x00B0(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaCharacterBase_AddHitBox) == 0x000008, "Wrong alignment on MatchaCharacterBase_AddHitBox");
static_assert(sizeof(MatchaCharacterBase_AddHitBox) == 0x0000C8, "Wrong size on MatchaCharacterBase_AddHitBox");
static_assert(offsetof(MatchaCharacterBase_AddHitBox, HitBoxData) == 0x000000, "Member 'MatchaCharacterBase_AddHitBox::HitBoxData' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_AddHitBox, Source) == 0x0000A8, "Member 'MatchaCharacterBase_AddHitBox::Source' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_AddHitBox, Location) == 0x0000B0, "Member 'MatchaCharacterBase_AddHitBox::Location' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.CharacterMovementUpdated
// 0x0038 (0x0038 - 0x0000)
struct MatchaCharacterBase_CharacterMovementUpdated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OldLocation;                                       // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldVelocity;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaCharacterBase_CharacterMovementUpdated) == 0x000008, "Wrong alignment on MatchaCharacterBase_CharacterMovementUpdated");
static_assert(sizeof(MatchaCharacterBase_CharacterMovementUpdated) == 0x000038, "Wrong size on MatchaCharacterBase_CharacterMovementUpdated");
static_assert(offsetof(MatchaCharacterBase_CharacterMovementUpdated, DeltaSeconds) == 0x000000, "Member 'MatchaCharacterBase_CharacterMovementUpdated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_CharacterMovementUpdated, OldLocation) == 0x000008, "Member 'MatchaCharacterBase_CharacterMovementUpdated::OldLocation' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_CharacterMovementUpdated, OldVelocity) == 0x000020, "Member 'MatchaCharacterBase_CharacterMovementUpdated::OldVelocity' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.CharacterTeleport
// 0x0038 (0x0038 - 0x0000)
struct MatchaCharacterBase_CharacterTeleport final
{
public:
	struct FVector                                DestinationLocation;                               // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               DestinationRotation;                               // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsATest;                                          // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoCheck;                                          // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaCharacterBase_CharacterTeleport) == 0x000008, "Wrong alignment on MatchaCharacterBase_CharacterTeleport");
static_assert(sizeof(MatchaCharacterBase_CharacterTeleport) == 0x000038, "Wrong size on MatchaCharacterBase_CharacterTeleport");
static_assert(offsetof(MatchaCharacterBase_CharacterTeleport, DestinationLocation) == 0x000000, "Member 'MatchaCharacterBase_CharacterTeleport::DestinationLocation' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_CharacterTeleport, DestinationRotation) == 0x000018, "Member 'MatchaCharacterBase_CharacterTeleport::DestinationRotation' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_CharacterTeleport, bIsATest) == 0x000030, "Member 'MatchaCharacterBase_CharacterTeleport::bIsATest' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_CharacterTeleport, bNoCheck) == 0x000031, "Member 'MatchaCharacterBase_CharacterTeleport::bNoCheck' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_CharacterTeleport, ReturnValue) == 0x000032, "Member 'MatchaCharacterBase_CharacterTeleport::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.DestroyTrackedEntity
// 0x0008 (0x0008 - 0x0000)
struct MatchaCharacterBase_DestroyTrackedEntity final
{
public:
	struct FGameplayTag                           EntityTag;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaCharacterBase_DestroyTrackedEntity) == 0x000004, "Wrong alignment on MatchaCharacterBase_DestroyTrackedEntity");
static_assert(sizeof(MatchaCharacterBase_DestroyTrackedEntity) == 0x000008, "Wrong size on MatchaCharacterBase_DestroyTrackedEntity");
static_assert(offsetof(MatchaCharacterBase_DestroyTrackedEntity, EntityTag) == 0x000000, "Member 'MatchaCharacterBase_DestroyTrackedEntity::EntityTag' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.GetTrackedEntity
// 0x0010 (0x0010 - 0x0000)
struct MatchaCharacterBase_GetTrackedEntity final
{
public:
	struct FGameplayTag                           EntityTag;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaCharacterBase_GetTrackedEntity) == 0x000008, "Wrong alignment on MatchaCharacterBase_GetTrackedEntity");
static_assert(sizeof(MatchaCharacterBase_GetTrackedEntity) == 0x000010, "Wrong size on MatchaCharacterBase_GetTrackedEntity");
static_assert(offsetof(MatchaCharacterBase_GetTrackedEntity, EntityTag) == 0x000000, "Member 'MatchaCharacterBase_GetTrackedEntity::EntityTag' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_GetTrackedEntity, ReturnValue) == 0x000008, "Member 'MatchaCharacterBase_GetTrackedEntity::ReturnValue' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.InflictDamage
// 0x0010 (0x0010 - 0x0000)
struct MatchaCharacterBase_InflictDamage final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaCharacterBase_InflictDamage) == 0x000008, "Wrong alignment on MatchaCharacterBase_InflictDamage");
static_assert(sizeof(MatchaCharacterBase_InflictDamage) == 0x000010, "Wrong size on MatchaCharacterBase_InflictDamage");
static_assert(offsetof(MatchaCharacterBase_InflictDamage, DamageInstigator) == 0x000000, "Member 'MatchaCharacterBase_InflictDamage::DamageInstigator' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_InflictDamage, Damage) == 0x000008, "Member 'MatchaCharacterBase_InflictDamage::Damage' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.PerformAoEHeal
// 0x0010 (0x0010 - 0x0000)
struct MatchaCharacterBase_PerformAoEHeal final
{
public:
	struct FActorFilterInfo                       ActorFilterInfo;                                   // 0x0000(0x0006)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HealAmount;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Range;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaCharacterBase_PerformAoEHeal) == 0x000004, "Wrong alignment on MatchaCharacterBase_PerformAoEHeal");
static_assert(sizeof(MatchaCharacterBase_PerformAoEHeal) == 0x000010, "Wrong size on MatchaCharacterBase_PerformAoEHeal");
static_assert(offsetof(MatchaCharacterBase_PerformAoEHeal, ActorFilterInfo) == 0x000000, "Member 'MatchaCharacterBase_PerformAoEHeal::ActorFilterInfo' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformAoEHeal, HealAmount) == 0x000008, "Member 'MatchaCharacterBase_PerformAoEHeal::HealAmount' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformAoEHeal, Range) == 0x00000C, "Member 'MatchaCharacterBase_PerformAoEHeal::Range' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.PerformAoEStun
// 0x0020 (0x0020 - 0x0000)
struct MatchaCharacterBase_PerformAoEStun final
{
public:
	struct FActorFilterInfo                       ActorFilterInfo;                                   // 0x0000(0x0006)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StunTimeInSeconds;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Range;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              OffsetFromCharacter;                               // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaCharacterBase_PerformAoEStun) == 0x000008, "Wrong alignment on MatchaCharacterBase_PerformAoEStun");
static_assert(sizeof(MatchaCharacterBase_PerformAoEStun) == 0x000020, "Wrong size on MatchaCharacterBase_PerformAoEStun");
static_assert(offsetof(MatchaCharacterBase_PerformAoEStun, ActorFilterInfo) == 0x000000, "Member 'MatchaCharacterBase_PerformAoEStun::ActorFilterInfo' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformAoEStun, StunTimeInSeconds) == 0x000008, "Member 'MatchaCharacterBase_PerformAoEStun::StunTimeInSeconds' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformAoEStun, Range) == 0x00000C, "Member 'MatchaCharacterBase_PerformAoEStun::Range' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformAoEStun, OffsetFromCharacter) == 0x000010, "Member 'MatchaCharacterBase_PerformAoEStun::OffsetFromCharacter' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.PerformCharacterLaunchAngleSpeed
// 0x001C (0x001C - 0x0000)
struct MatchaCharacterBase_PerformCharacterLaunchAngleSpeed final
{
public:
	ELaunchType                                   LaunchType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELaunchActionRestrictionType                  ActionRestrictionType;                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LaunchSpeed;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LaunchAngle;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration_0;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Gravity;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActionRestrictionDuration;                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyIntangibility;                               // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed) == 0x000004, "Wrong alignment on MatchaCharacterBase_PerformCharacterLaunchAngleSpeed");
static_assert(sizeof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed) == 0x00001C, "Wrong size on MatchaCharacterBase_PerformCharacterLaunchAngleSpeed");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed, LaunchType) == 0x000000, "Member 'MatchaCharacterBase_PerformCharacterLaunchAngleSpeed::LaunchType' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed, ActionRestrictionType) == 0x000001, "Member 'MatchaCharacterBase_PerformCharacterLaunchAngleSpeed::ActionRestrictionType' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed, LaunchSpeed) == 0x000004, "Member 'MatchaCharacterBase_PerformCharacterLaunchAngleSpeed::LaunchSpeed' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed, LaunchAngle) == 0x000008, "Member 'MatchaCharacterBase_PerformCharacterLaunchAngleSpeed::LaunchAngle' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed, Acceleration_0) == 0x00000C, "Member 'MatchaCharacterBase_PerformCharacterLaunchAngleSpeed::Acceleration_0' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed, Gravity) == 0x000010, "Member 'MatchaCharacterBase_PerformCharacterLaunchAngleSpeed::Gravity' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed, ActionRestrictionDuration) == 0x000014, "Member 'MatchaCharacterBase_PerformCharacterLaunchAngleSpeed::ActionRestrictionDuration' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchAngleSpeed, bApplyIntangibility) == 0x000018, "Member 'MatchaCharacterBase_PerformCharacterLaunchAngleSpeed::bApplyIntangibility' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.PerformCharacterLaunchVelocity
// 0x0030 (0x0030 - 0x0000)
struct MatchaCharacterBase_PerformCharacterLaunchVelocity final
{
public:
	ELaunchType                                   LaunchType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELaunchActionRestrictionType                  ActionRestrictionType;                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LaunchVelocity;                                    // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration_0;                                    // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Gravity;                                           // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActionRestrictionDuration;                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyIntangibility;                               // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearCurrentMontage;                              // 0x002D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaCharacterBase_PerformCharacterLaunchVelocity) == 0x000008, "Wrong alignment on MatchaCharacterBase_PerformCharacterLaunchVelocity");
static_assert(sizeof(MatchaCharacterBase_PerformCharacterLaunchVelocity) == 0x000030, "Wrong size on MatchaCharacterBase_PerformCharacterLaunchVelocity");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchVelocity, LaunchType) == 0x000000, "Member 'MatchaCharacterBase_PerformCharacterLaunchVelocity::LaunchType' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchVelocity, ActionRestrictionType) == 0x000001, "Member 'MatchaCharacterBase_PerformCharacterLaunchVelocity::ActionRestrictionType' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchVelocity, LaunchVelocity) == 0x000008, "Member 'MatchaCharacterBase_PerformCharacterLaunchVelocity::LaunchVelocity' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchVelocity, Acceleration_0) == 0x000020, "Member 'MatchaCharacterBase_PerformCharacterLaunchVelocity::Acceleration_0' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchVelocity, Gravity) == 0x000024, "Member 'MatchaCharacterBase_PerformCharacterLaunchVelocity::Gravity' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchVelocity, ActionRestrictionDuration) == 0x000028, "Member 'MatchaCharacterBase_PerformCharacterLaunchVelocity::ActionRestrictionDuration' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchVelocity, bApplyIntangibility) == 0x00002C, "Member 'MatchaCharacterBase_PerformCharacterLaunchVelocity::bApplyIntangibility' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_PerformCharacterLaunchVelocity, bClearCurrentMontage) == 0x00002D, "Member 'MatchaCharacterBase_PerformCharacterLaunchVelocity::bClearCurrentMontage' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.RequestHitFreeze
// 0x0008 (0x0008 - 0x0000)
struct MatchaCharacterBase_RequestHitFreeze final
{
public:
	int32                                         HitFreezeMilliseconds;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldShake;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPetrify;                                    // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaCharacterBase_RequestHitFreeze) == 0x000004, "Wrong alignment on MatchaCharacterBase_RequestHitFreeze");
static_assert(sizeof(MatchaCharacterBase_RequestHitFreeze) == 0x000008, "Wrong size on MatchaCharacterBase_RequestHitFreeze");
static_assert(offsetof(MatchaCharacterBase_RequestHitFreeze, HitFreezeMilliseconds) == 0x000000, "Member 'MatchaCharacterBase_RequestHitFreeze::HitFreezeMilliseconds' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_RequestHitFreeze, bShouldShake) == 0x000004, "Member 'MatchaCharacterBase_RequestHitFreeze::bShouldShake' has a wrong offset!");
static_assert(offsetof(MatchaCharacterBase_RequestHitFreeze, bShouldPetrify) == 0x000005, "Member 'MatchaCharacterBase_RequestHitFreeze::bShouldPetrify' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.RequestStun
// 0x0004 (0x0004 - 0x0000)
struct MatchaCharacterBase_RequestStun final
{
public:
	float                                         DurationSeconds;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaCharacterBase_RequestStun) == 0x000004, "Wrong alignment on MatchaCharacterBase_RequestStun");
static_assert(sizeof(MatchaCharacterBase_RequestStun) == 0x000004, "Wrong size on MatchaCharacterBase_RequestStun");
static_assert(offsetof(MatchaCharacterBase_RequestStun, DurationSeconds) == 0x000000, "Member 'MatchaCharacterBase_RequestStun::DurationSeconds' has a wrong offset!");

// Function Matcha.MatchaCharacterBase.RequestTargetedGlitchDash
// 0x0028 (0x0028 - 0x0000)
