#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchaGameplayAbilities

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "MatchaGameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MatchaGameplayAbilities.MatchaGameplayEffectOwner.ApplyGameplayEffectClassToSelf
// 0x0030 (0x0030 - 0x0000)
struct MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf final
{
public:
	TSubclassOf<class UMatchaGameplayEffect>      GameplayEffectClass;                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMatchaActiveGameplayEffectHandle      ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf) == 0x000008, "Wrong alignment on MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf");
static_assert(sizeof(MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf) == 0x000030, "Wrong size on MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf, GameplayEffectClass) == 0x000000, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf::GameplayEffectClass' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf, Level) == 0x000008, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf::Level' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf, EffectContext) == 0x000010, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf, ReturnValue) == 0x000028, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectClassToSelf::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaGameplayEffectOwner.ApplyGameplayEffectSpecHandleToSelf
// 0x0018 (0x0018 - 0x0000)
struct MatchaGameplayEffectOwner_ApplyGameplayEffectSpecHandleToSelf final
{
public:
	struct FMatchaGameplayEffectSpecHandle        GameplayEffectHandle;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMatchaActiveGameplayEffectHandle      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaGameplayEffectOwner_ApplyGameplayEffectSpecHandleToSelf) == 0x000008, "Wrong alignment on MatchaGameplayEffectOwner_ApplyGameplayEffectSpecHandleToSelf");
static_assert(sizeof(MatchaGameplayEffectOwner_ApplyGameplayEffectSpecHandleToSelf) == 0x000018, "Wrong size on MatchaGameplayEffectOwner_ApplyGameplayEffectSpecHandleToSelf");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectSpecHandleToSelf, GameplayEffectHandle) == 0x000000, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectSpecHandleToSelf::GameplayEffectHandle' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectSpecHandleToSelf, ReturnValue) == 0x000010, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectSpecHandleToSelf::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaGameplayEffectOwner.ApplyGameplayEffectSpecToSelf
// 0x0238 (0x0238 - 0x0000)
struct MatchaGameplayEffectOwner_ApplyGameplayEffectSpecToSelf final
{
public:
	struct FMatchaGameplayEffectSpec              GameplayEffect;                                    // 0x0000(0x0230)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMatchaActiveGameplayEffectHandle      ReturnValue;                                       // 0x0230(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaGameplayEffectOwner_ApplyGameplayEffectSpecToSelf) == 0x000008, "Wrong alignment on MatchaGameplayEffectOwner_ApplyGameplayEffectSpecToSelf");
static_assert(sizeof(MatchaGameplayEffectOwner_ApplyGameplayEffectSpecToSelf) == 0x000238, "Wrong size on MatchaGameplayEffectOwner_ApplyGameplayEffectSpecToSelf");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectSpecToSelf, GameplayEffect) == 0x000000, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectSpecToSelf::GameplayEffect' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectSpecToSelf, ReturnValue) == 0x000230, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectSpecToSelf::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaGameplayEffectOwner.ApplyGameplayEffectToSelf
// 0x0030 (0x0030 - 0x0000)
struct MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf final
{
public:
	const class UMatchaGameplayEffect*            GameplayEffect;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMatchaActiveGameplayEffectHandle      ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf) == 0x000008, "Wrong alignment on MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf");
static_assert(sizeof(MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf) == 0x000030, "Wrong size on MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf, GameplayEffect) == 0x000000, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf::GameplayEffect' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf, Level) == 0x000008, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf::Level' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf, EffectContext) == 0x000010, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf, ReturnValue) == 0x000028, "Member 'MatchaGameplayEffectOwner_ApplyGameplayEffectToSelf::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaGameplayEffectOwner.RemoveGameplayEffectFromSelf
// 0x000C (0x000C - 0x0000)
struct MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelf final
{
public:
	struct FMatchaActiveGameplayEffectHandle      Handle;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelf) == 0x000004, "Wrong alignment on MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelf");
static_assert(sizeof(MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelf) == 0x00000C, "Wrong size on MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelf");
static_assert(offsetof(MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelf, Handle) == 0x000000, "Member 'MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelf::Handle' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelf, Stacks) == 0x000008, "Member 'MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelf::Stacks' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaGameplayEffectOwner.RemoveGameplayEffectFromSelfByClass
// 0x0010 (0x0010 - 0x0000)
struct MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass final
{
public:
	TSubclassOf<class UMatchaGameplayEffect>      GameplayEffectClass;                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass) == 0x000008, "Wrong alignment on MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass");
static_assert(sizeof(MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass) == 0x000010, "Wrong size on MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass");
static_assert(offsetof(MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass, GameplayEffectClass) == 0x000000, "Member 'MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass::GameplayEffectClass' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass, Level) == 0x000008, "Member 'MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass::Level' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass, Stacks) == 0x00000C, "Member 'MatchaGameplayEffectOwner_RemoveGameplayEffectFromSelfByClass::Stacks' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaGameplayEffectOwner.GetAggregatedStackCount
// 0x01A0 (0x01A0 - 0x0000)
struct MatchaGameplayEffectOwner_GetAggregatedStackCount final
{
public:
	struct FMatchaGameplayEffectQuery             Query;                                             // 0x0000(0x0198)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0198(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaGameplayEffectOwner_GetAggregatedStackCount) == 0x000008, "Wrong alignment on MatchaGameplayEffectOwner_GetAggregatedStackCount");
static_assert(sizeof(MatchaGameplayEffectOwner_GetAggregatedStackCount) == 0x0001A0, "Wrong size on MatchaGameplayEffectOwner_GetAggregatedStackCount");
static_assert(offsetof(MatchaGameplayEffectOwner_GetAggregatedStackCount, Query) == 0x000000, "Member 'MatchaGameplayEffectOwner_GetAggregatedStackCount::Query' has a wrong offset!");
static_assert(offsetof(MatchaGameplayEffectOwner_GetAggregatedStackCount, ReturnValue) == 0x000198, "Member 'MatchaGameplayEffectOwner_GetAggregatedStackCount::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaGameplayEffectOwner.MakeEffectContext
// 0x0018 (0x0018 - 0x0000)
struct MatchaGameplayEffectOwner_MakeEffectContext final
{
public:
	struct FMatchaGameplayEffectContextHandle     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaGameplayEffectOwner_MakeEffectContext) == 0x000008, "Wrong alignment on MatchaGameplayEffectOwner_MakeEffectContext");
static_assert(sizeof(MatchaGameplayEffectOwner_MakeEffectContext) == 0x000018, "Wrong size on MatchaGameplayEffectOwner_MakeEffectContext");
static_assert(offsetof(MatchaGameplayEffectOwner_MakeEffectContext, ReturnValue) == 0x000000, "Member 'MatchaGameplayEffectOwner_MakeEffectContext::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaGameplayEffectOwnerProvider.GetGameplayEffectOwner
// 0x0010 (0x0010 - 0x0000)
struct MatchaGameplayEffectOwnerProvider_GetGameplayEffectOwner final
{
public:
	TScriptInterface<class IMatchaGameplayEffectOwner> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaGameplayEffectOwnerProvider_GetGameplayEffectOwner) == 0x000008, "Wrong alignment on MatchaGameplayEffectOwnerProvider_GetGameplayEffectOwner");
static_assert(sizeof(MatchaGameplayEffectOwnerProvider_GetGameplayEffectOwner) == 0x000010, "Wrong size on MatchaGameplayEffectOwnerProvider_GetGameplayEffectOwner");
static_assert(offsetof(MatchaGameplayEffectOwnerProvider_GetGameplayEffectOwner, ReturnValue) == 0x000000, "Member 'MatchaGameplayEffectOwnerProvider_GetGameplayEffectOwner::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.AddAssetTag
// 0x0028 (0x0028 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_AddAssetTag final
{
public:
	struct FMatchaGameplayEffectSpecHandle        SpecHandle;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NewGameplayTag;                                    // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchaGameplayEffectSpecHandle        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_AddAssetTag) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_AddAssetTag");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_AddAssetTag) == 0x000028, "Wrong size on MatchaAbilitySystemBlueprintLibrary_AddAssetTag");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddAssetTag, SpecHandle) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_AddAssetTag::SpecHandle' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddAssetTag, NewGameplayTag) == 0x000010, "Member 'MatchaAbilitySystemBlueprintLibrary_AddAssetTag::NewGameplayTag' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddAssetTag, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_AddAssetTag::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.AddAssetTags
// 0x0040 (0x0040 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_AddAssetTags final
{
public:
	struct FMatchaGameplayEffectSpecHandle        SpecHandle;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  NewGameplayTags;                                   // 0x0010(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FMatchaGameplayEffectSpecHandle        ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_AddAssetTags) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_AddAssetTags");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_AddAssetTags) == 0x000040, "Wrong size on MatchaAbilitySystemBlueprintLibrary_AddAssetTags");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddAssetTags, SpecHandle) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_AddAssetTags::SpecHandle' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddAssetTags, NewGameplayTags) == 0x000010, "Member 'MatchaAbilitySystemBlueprintLibrary_AddAssetTags::NewGameplayTags' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddAssetTags, ReturnValue) == 0x000030, "Member 'MatchaAbilitySystemBlueprintLibrary_AddAssetTags::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.AddGrantedTag
// 0x0028 (0x0028 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_AddGrantedTag final
{
public:
	struct FMatchaGameplayEffectSpecHandle        SpecHandle;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NewGameplayTag;                                    // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchaGameplayEffectSpecHandle        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTag) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_AddGrantedTag");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTag) == 0x000028, "Wrong size on MatchaAbilitySystemBlueprintLibrary_AddGrantedTag");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTag, SpecHandle) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_AddGrantedTag::SpecHandle' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTag, NewGameplayTag) == 0x000010, "Member 'MatchaAbilitySystemBlueprintLibrary_AddGrantedTag::NewGameplayTag' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTag, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_AddGrantedTag::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.AddGrantedTags
// 0x0040 (0x0040 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_AddGrantedTags final
{
public:
	struct FMatchaGameplayEffectSpecHandle        SpecHandle;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  NewGameplayTags;                                   // 0x0010(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FMatchaGameplayEffectSpecHandle        ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTags) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_AddGrantedTags");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTags) == 0x000040, "Wrong size on MatchaAbilitySystemBlueprintLibrary_AddGrantedTags");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTags, SpecHandle) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_AddGrantedTags::SpecHandle' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTags, NewGameplayTags) == 0x000010, "Member 'MatchaAbilitySystemBlueprintLibrary_AddGrantedTags::NewGameplayTags' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AddGrantedTags, ReturnValue) == 0x000030, "Member 'MatchaAbilitySystemBlueprintLibrary_AddGrantedTags::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.AssignSetByCallerMagnitude
// 0x0030 (0x0030 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude final
{
public:
	struct FMatchaGameplayEffectSpecHandle        SpecHandle;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	class FName                                   DataName;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaGameplayEffectSpecHandle        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude) == 0x000030, "Wrong size on MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude, SpecHandle) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude::SpecHandle' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude, DataName) == 0x000010, "Member 'MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude::DataName' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude, Magnitude) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude::Magnitude' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude, ReturnValue) == 0x000020, "Member 'MatchaAbilitySystemBlueprintLibrary_AssignSetByCallerMagnitude::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.AssignTagSetByCallerMagnitude
// 0x0030 (0x0030 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude final
{
public:
	struct FMatchaGameplayEffectSpecHandle        SpecHandle;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DataTag;                                           // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaGameplayEffectSpecHandle        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude) == 0x000030, "Wrong size on MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude, SpecHandle) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude::SpecHandle' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude, DataTag) == 0x000010, "Member 'MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude::DataTag' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude, Magnitude) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude::Magnitude' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude, ReturnValue) == 0x000020, "Member 'MatchaAbilitySystemBlueprintLibrary_AssignTagSetByCallerMagnitude::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.CloneSpecHandle
// 0x0030 (0x0030 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle final
{
public:
	class AActor*                                 InNewInstigator;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InEffectCauser;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchaGameplayEffectSpecHandle        GameplayEffectSpecHandle_Clone;                    // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FMatchaGameplayEffectSpecHandle        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle) == 0x000030, "Wrong size on MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle, InNewInstigator) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle::InNewInstigator' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle, InEffectCauser) == 0x000008, "Member 'MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle::InEffectCauser' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle, GameplayEffectSpecHandle_Clone) == 0x000010, "Member 'MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle::GameplayEffectSpecHandle_Clone' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle, ReturnValue) == 0x000020, "Member 'MatchaAbilitySystemBlueprintLibrary_CloneSpecHandle::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextAddHitResult
// 0x0118 (0x0118 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResult;                                         // 0x0018(0x00F8)(Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bReset;                                            // 0x0110(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult) == 0x000118, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult, HitResult) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult::HitResult' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult, bReset) == 0x000110, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextAddHitResult::bReset' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextGetEffectCauser
// 0x0020 (0x0020 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextGetEffectCauser final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetEffectCauser) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextGetEffectCauser");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetEffectCauser) == 0x000020, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextGetEffectCauser");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetEffectCauser, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetEffectCauser::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetEffectCauser, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetEffectCauser::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextGetHitResult
// 0x0110 (0x0110 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextGetHitResult final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FHitResult                             ReturnValue;                                       // 0x0018(0x00F8)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetHitResult) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextGetHitResult");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetHitResult) == 0x000110, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextGetHitResult");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetHitResult, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetHitResult::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetHitResult, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetHitResult::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextGetInstigatorActor
// 0x0020 (0x0020 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextGetInstigatorActor final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetInstigatorActor) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextGetInstigatorActor");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetInstigatorActor) == 0x000020, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextGetInstigatorActor");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetInstigatorActor, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetInstigatorActor::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetInstigatorActor, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetInstigatorActor::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextGetOrigin
// 0x0030 (0x0030 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextGetOrigin final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetOrigin) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextGetOrigin");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetOrigin) == 0x000030, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextGetOrigin");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetOrigin, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetOrigin::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetOrigin, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetOrigin::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextGetOriginalInstigatorActor
// 0x0020 (0x0020 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextGetOriginalInstigatorActor final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetOriginalInstigatorActor) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextGetOriginalInstigatorActor");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetOriginalInstigatorActor) == 0x000020, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextGetOriginalInstigatorActor");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetOriginalInstigatorActor, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetOriginalInstigatorActor::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetOriginalInstigatorActor, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetOriginalInstigatorActor::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextGetSourceObject
// 0x0020 (0x0020 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextGetSourceObject final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetSourceObject) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextGetSourceObject");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetSourceObject) == 0x000020, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextGetSourceObject");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetSourceObject, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetSourceObject::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextGetSourceObject, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextGetSourceObject::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextHasHitResult
// 0x0020 (0x0020 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextHasHitResult final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextHasHitResult) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextHasHitResult");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextHasHitResult) == 0x000020, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextHasHitResult");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextHasHitResult, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextHasHitResult::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextHasHitResult, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextHasHitResult::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextIsInstigatorLocallyControlled
// 0x0020 (0x0020 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextIsInstigatorLocallyControlled final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextIsInstigatorLocallyControlled) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextIsInstigatorLocallyControlled");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextIsInstigatorLocallyControlled) == 0x000020, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextIsInstigatorLocallyControlled");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextIsInstigatorLocallyControlled, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextIsInstigatorLocallyControlled::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextIsInstigatorLocallyControlled, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextIsInstigatorLocallyControlled::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextIsValid
// 0x0020 (0x0020 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextIsValid final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextIsValid) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextIsValid");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextIsValid) == 0x000020, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextIsValid");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextIsValid, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextIsValid::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextIsValid, ReturnValue) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextIsValid::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EffectContextSetOrigin
// 0x0030 (0x0030 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EffectContextSetOrigin final
{
public:
	struct FMatchaGameplayEffectContextHandle     EffectContext;                                     // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FVector                                Origin;                                            // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EffectContextSetOrigin) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EffectContextSetOrigin");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EffectContextSetOrigin) == 0x000030, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EffectContextSetOrigin");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextSetOrigin, EffectContext) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextSetOrigin::EffectContext' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EffectContextSetOrigin, Origin) == 0x000018, "Member 'MatchaAbilitySystemBlueprintLibrary_EffectContextSetOrigin::Origin' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EqualEqual_ActiveGameplayEffectHandle
// 0x0014 (0x0014 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle final
{
public:
	struct FMatchaActiveGameplayEffectHandle      A;                                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchaActiveGameplayEffectHandle      B;                                                 // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle) == 0x000004, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle) == 0x000014, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle, A) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle::A' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle, B) == 0x000008, "Member 'MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle::B' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle, ReturnValue) == 0x000010, "Member 'MatchaAbilitySystemBlueprintLibrary_EqualEqual_ActiveGameplayEffectHandle::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EqualEqual_GameplayAttributeGameplayAttribute
// 0x0078 (0x0078 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute final
{
public:
	struct FMatchaGameplayAttribute               AttributeA;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchaGameplayAttribute               AttributeB;                                        // 0x0038(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute) == 0x000078, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute, AttributeA) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute::AttributeA' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute, AttributeB) == 0x000038, "Member 'MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute::AttributeB' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute, ReturnValue) == 0x000070, "Member 'MatchaAbilitySystemBlueprintLibrary_EqualEqual_GameplayAttributeGameplayAttribute::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EvaluateAttributeValueWithTags
// 0x0088 (0x0088 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchaGameplayAttribute               Attribute;                                         // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  SourceTags;                                        // 0x0040(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TargetTags;                                        // 0x0060(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0084(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags) == 0x000088, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags, Actor) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags::Actor' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags, Attribute) == 0x000008, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags::Attribute' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags, SourceTags) == 0x000040, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags::SourceTags' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags, TargetTags) == 0x000060, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags::TargetTags' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags, bSuccess) == 0x000080, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags::bSuccess' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags, ReturnValue) == 0x000084, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTags::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.EvaluateAttributeValueWithTagsAndBase
// 0x0090 (0x0090 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchaGameplayAttribute               Attribute;                                         // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  SourceTags;                                        // 0x0040(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TargetTags;                                        // 0x0060(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         BaseValue;                                         // 0x0080(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0084(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0088(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase) == 0x000090, "Wrong size on MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase, Actor) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase::Actor' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase, Attribute) == 0x000008, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase::Attribute' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase, SourceTags) == 0x000040, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase::SourceTags' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase, TargetTags) == 0x000060, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase::TargetTags' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase, BaseValue) == 0x000080, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase::BaseValue' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase, bSuccess) == 0x000084, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase::bSuccess' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase, ReturnValue) == 0x000088, "Member 'MatchaAbilitySystemBlueprintLibrary_EvaluateAttributeValueWithTagsAndBase::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.GetActiveGameplayEffectDebugString
// 0x0018 (0x0018 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectDebugString final
{
public:
	struct FMatchaActiveGameplayEffectHandle      ActiveHandle;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectDebugString) == 0x000008, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectDebugString");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectDebugString) == 0x000018, "Wrong size on MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectDebugString");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectDebugString, ActiveHandle) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectDebugString::ActiveHandle' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectDebugString, ReturnValue) == 0x000008, "Member 'MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectDebugString::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.GetActiveGameplayEffectExpectedEndTime
// 0x000C (0x000C - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectExpectedEndTime final
{
public:
	struct FMatchaActiveGameplayEffectHandle      ActiveHandle;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectExpectedEndTime) == 0x000004, "Wrong alignment on MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectExpectedEndTime");
static_assert(sizeof(MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectExpectedEndTime) == 0x00000C, "Wrong size on MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectExpectedEndTime");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectExpectedEndTime, ActiveHandle) == 0x000000, "Member 'MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectExpectedEndTime::ActiveHandle' has a wrong offset!");
static_assert(offsetof(MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectExpectedEndTime, ReturnValue) == 0x000008, "Member 'MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectExpectedEndTime::ReturnValue' has a wrong offset!");

// Function MatchaGameplayAbilities.MatchaAbilitySystemBlueprintLibrary.GetActiveGameplayEffectRemainingDuration
// 0x0018 (0x0018 - 0x0000)
struct MatchaAbilitySystemBlueprintLibrary_GetActiveGameplayEffectRemainingDuration final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
