#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Matcha

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "OdyServices_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SnapNet_structs.hpp"
#include "SnapNet_classes.hpp"
#include "OdyUI_structs.hpp"
#include "OdyUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "MatchaGameplayAbilities_structs.hpp"
#include "MatchaGameplayAbilities_classes.hpp"
#include "OdyGameZones_classes.hpp"
#include "OdyInput_structs.hpp"


namespace SDK
{

// Class Matcha.LegacyMatchaServicesConfiguration
// 0x0058 (0x0090 - 0x0038)
class ULegacyMatchaServicesConfiguration final : public UDeveloperSettings
{
public:
	int32                                         MaxReconnectAttempts;                              // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WebSocketUrlClient;                                // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WebSocketUrlServer;                                // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WebSocketUrlServices;                              // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VersionOverride;                                   // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServicesBaseUrl;                                   // 0x0080(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class FString GetWebSocketUrlClient();
	class FString GetWebSocketUrlServer();
	class FString GetWebSocketUrlServices();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LegacyMatchaServicesConfiguration">();
	}
	static class ULegacyMatchaServicesConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyMatchaServicesConfiguration>();
	}
};
static_assert(alignof(ULegacyMatchaServicesConfiguration) == 0x000008, "Wrong alignment on ULegacyMatchaServicesConfiguration");
static_assert(sizeof(ULegacyMatchaServicesConfiguration) == 0x000090, "Wrong size on ULegacyMatchaServicesConfiguration");
static_assert(offsetof(ULegacyMatchaServicesConfiguration, MaxReconnectAttempts) == 0x000038, "Member 'ULegacyMatchaServicesConfiguration::MaxReconnectAttempts' has a wrong offset!");
static_assert(offsetof(ULegacyMatchaServicesConfiguration, WebSocketUrlClient) == 0x000040, "Member 'ULegacyMatchaServicesConfiguration::WebSocketUrlClient' has a wrong offset!");
static_assert(offsetof(ULegacyMatchaServicesConfiguration, WebSocketUrlServer) == 0x000050, "Member 'ULegacyMatchaServicesConfiguration::WebSocketUrlServer' has a wrong offset!");
static_assert(offsetof(ULegacyMatchaServicesConfiguration, WebSocketUrlServices) == 0x000060, "Member 'ULegacyMatchaServicesConfiguration::WebSocketUrlServices' has a wrong offset!");
static_assert(offsetof(ULegacyMatchaServicesConfiguration, VersionOverride) == 0x000070, "Member 'ULegacyMatchaServicesConfiguration::VersionOverride' has a wrong offset!");
static_assert(offsetof(ULegacyMatchaServicesConfiguration, ServicesBaseUrl) == 0x000080, "Member 'ULegacyMatchaServicesConfiguration::ServicesBaseUrl' has a wrong offset!");

// Class Matcha.LegacyMatchaQueueServices
// 0x01A8 (0x0488 - 0x02E0)
class ULegacyMatchaQueueServices final : public UOdyServicesModelBase
{
public:
	uint8                                         Pad_2E0[0x1A8];                                    // 0x02E0(0x01A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULegacyMatchaQueueServices* Get(const class UObject* WorldContextObject);
	static const class ULegacyMatchaServicesConfiguration* GetServicesConfiguration();

	void AcceptInvite(const class FString& Target);
	void CancelInvite(const class FString& Target);
	void JoinDropIn();
	void JoinQueue();
	void LeaveQueue();
	void LeaveTeam();
	void RejectInvite(const class FString& Target);
	void SendInvite(const class FString& Target);
	void SendPing();
	void SetConnectedPlayerIds(const TArray<class FName>& PlayerIds);
	void SetIdentification(const class FString& Name_0, const class FString& URL, bool IsMatchServer);
	void SetMatchPhase(EMatchaMatchPhase MatchPhase);
	void SetName(const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LegacyMatchaQueueServices">();
	}
	static class ULegacyMatchaQueueServices* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyMatchaQueueServices>();
	}
};
static_assert(alignof(ULegacyMatchaQueueServices) == 0x000008, "Wrong alignment on ULegacyMatchaQueueServices");
static_assert(sizeof(ULegacyMatchaQueueServices) == 0x000488, "Wrong size on ULegacyMatchaQueueServices");

// Class Matcha.MatchaAICharacterAnimInstance
// 0x0020 (0x0390 - 0x0370)
class UMatchaAICharacterAnimInstance : public UAnimInstance
{
public:
	float                                         BlendTimeDefault;                                  // 0x0368(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccelerationStrengthThresholdForWalkRun;           // 0x036C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallDirectionsBlendTime;                           // 0x0370(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleWalkRunBlendTime;                              // 0x0374(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFalling;                                          // 0x0378(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HorizontalSpeed;                                   // 0x037C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalSpeed;                                     // 0x0380(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccelerationStrength;                              // 0x0384(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccelerationLocalDirection;                        // 0x0388(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAcceleratingEnoughForWalkRun;                     // 0x038C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasPositiveVerticalSpeed;                         // 0x038D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFacingScreenLeft;                               // 0x038E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38F[0x1];                                      // 0x038F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaAICharacterAnimInstance">();
	}
	static class UMatchaAICharacterAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchaAICharacterAnimInstance>();
	}
};
static_assert(alignof(UMatchaAICharacterAnimInstance) == 0x000010, "Wrong alignment on UMatchaAICharacterAnimInstance");
static_assert(sizeof(UMatchaAICharacterAnimInstance) == 0x000390, "Wrong size on UMatchaAICharacterAnimInstance");
static_assert(offsetof(UMatchaAICharacterAnimInstance, BlendTimeDefault) == 0x000368, "Member 'UMatchaAICharacterAnimInstance::BlendTimeDefault' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, AccelerationStrengthThresholdForWalkRun) == 0x00036C, "Member 'UMatchaAICharacterAnimInstance::AccelerationStrengthThresholdForWalkRun' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, FallDirectionsBlendTime) == 0x000370, "Member 'UMatchaAICharacterAnimInstance::FallDirectionsBlendTime' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, IdleWalkRunBlendTime) == 0x000374, "Member 'UMatchaAICharacterAnimInstance::IdleWalkRunBlendTime' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, bFalling) == 0x000378, "Member 'UMatchaAICharacterAnimInstance::bFalling' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, HorizontalSpeed) == 0x00037C, "Member 'UMatchaAICharacterAnimInstance::HorizontalSpeed' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, VerticalSpeed) == 0x000380, "Member 'UMatchaAICharacterAnimInstance::VerticalSpeed' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, AccelerationStrength) == 0x000384, "Member 'UMatchaAICharacterAnimInstance::AccelerationStrength' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, AccelerationLocalDirection) == 0x000388, "Member 'UMatchaAICharacterAnimInstance::AccelerationLocalDirection' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, bAcceleratingEnoughForWalkRun) == 0x00038C, "Member 'UMatchaAICharacterAnimInstance::bAcceleratingEnoughForWalkRun' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, bHasPositiveVerticalSpeed) == 0x00038D, "Member 'UMatchaAICharacterAnimInstance::bHasPositiveVerticalSpeed' has a wrong offset!");
static_assert(offsetof(UMatchaAICharacterAnimInstance, bIsFacingScreenLeft) == 0x00038E, "Member 'UMatchaAICharacterAnimInstance::bIsFacingScreenLeft' has a wrong offset!");

// Class Matcha.MatchaAICharacterEntity
// 0x0640 (0x0D30 - 0x06F0)
class AMatchaAICharacterEntity : public ASnapNetCharacterEntity
{
public:
	uint8                                         Pad_6F0[0x18];                                     // 0x06F0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaLootComponent*                   LootComponent;                                     // 0x0708(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBehaviorTree*                          BehaviorTree;                                      // 0x0710(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAIAnimationInfo>               Animations;                                        // 0x0718(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyFloat                  MaxDamage;                                         // 0x0728(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                         Weight;                                            // 0x0768(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ReceivingHitFreezeMultiplier;                      // 0x076C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxFallSpeed;                                      // 0x0770(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WalkSpeed;                                         // 0x0774(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              CoarseHitExtents;                                  // 0x0778(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableBehaviorTreeOnSpawn;                        // 0x0788(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_789[0x3];                                      // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ChannelToBroadcastDeathEventTo;                    // 0x078C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMatchaGameplayEvent                   DeathEventToBroadcast;                             // 0x0794(0x0014)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyInt32                  AggroDistance;                                     // 0x07A8(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bAllowRepeatAbilities;                             // 0x07E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7E1[0x3];                                      // 0x07E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HitFreezeDeltaTimeMultiplier;                      // 0x07E4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HorizontalSpeed;                                   // 0x07E8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VerticalSpeed;                                     // 0x07EC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AccelerationStrength;                              // 0x07F0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AccelerationLocalDirection;                        // 0x07F4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPoseDirty;                                        // 0x07F8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7F9[0x7];                                      // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSnapNetPropertyVector                 Scale;                                             // 0x0800(0x0080)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FName                                   DefaultHitFXId;                                    // 0x0880(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCombinedFXInfo                        DeathFX;                                           // 0x0888(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyFloat                  Damage;                                            // 0x0910(0x0040)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FFacingInfo                            FacingInfo;                                        // 0x0950(0x0078)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FHitFreezeStateInfo                    HitFreezeStateInfo;                                // 0x09C8(0x0068)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FAIPlayingMontageInfo                  AIPlayingMontageInfo;                              // 0x0A30(0x0110)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FAIAppliedRootMotionInfo               CurrentAppliedRootMotionInfo;                      // 0x0B40(0x00E0)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyBoolean                bIsDead;                                           // 0x0C20(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FMatchaCharacterFlags                  AnimationAppliedFlags;                             // 0x0C38(0x0018)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FUnprocessedHitBoxData>         CurrentFrameOutgoingHits;                          // 0x0C50(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAppliedHitInfo>                RecentlyAppliedHits;                               // 0x0C60(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FVector                                SpawnLocation;                                     // 0x0C70(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               SpawnRotation;                                     // 0x0C88(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyBoolean                bIsInvulnerable;                                   // 0x0CA0(0x0018)(Protected, NativeAccessSpecifierProtected)
	class FText                                   DisplayName;                                       // 0x0CB8(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	int32                                         CurrentTeamNumber;                                 // 0x0CC8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CCC[0x4];                                      // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOdyUIFloatBinding                     DamageBinding;                                     // 0x0CD0(0x0020)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FOdyUITextBinding                      PlayerNameBinding;                                 // 0x0CF0(0x0028)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D18[0x8];                                      // 0x0D18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMatchaProcessedHitInfo>        CurrentFrameIncomingHits;                          // 0x0D20(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class AMatchaAICharacterEntity* Get(int32 PlayerIndex, const class UObject* WorldContextObject);
	static class AMatchaAICharacterEntity* GetFromSimulation(int32 PlayerIndex, const class USnapNetSimulation* SnapNetSimulation);

	bool CharacterTeleport(const struct FVector& DestinationLocation, const struct FRotator& DestinationRotation, bool bIsATest, bool bNoCheck);
	void PlayAnimationAtIndex(const int32 Index_0);
	void ResetDamage();
	void SetInvulnerable(bool bShouldBeInvulnerable);

	int32 GetAggroDistance() const;
	struct FVector GetSpawnLocation() const;
	void ToggleBehaviorTree(const bool bShouldEnable) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaAICharacterEntity">();
	}
	static class AMatchaAICharacterEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchaAICharacterEntity>();
	}
};
static_assert(alignof(AMatchaAICharacterEntity) == 0x000010, "Wrong alignment on AMatchaAICharacterEntity");
static_assert(sizeof(AMatchaAICharacterEntity) == 0x000D30, "Wrong size on AMatchaAICharacterEntity");
static_assert(offsetof(AMatchaAICharacterEntity, LootComponent) == 0x000708, "Member 'AMatchaAICharacterEntity::LootComponent' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, BehaviorTree) == 0x000710, "Member 'AMatchaAICharacterEntity::BehaviorTree' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, Animations) == 0x000718, "Member 'AMatchaAICharacterEntity::Animations' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, MaxDamage) == 0x000728, "Member 'AMatchaAICharacterEntity::MaxDamage' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, Weight) == 0x000768, "Member 'AMatchaAICharacterEntity::Weight' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, ReceivingHitFreezeMultiplier) == 0x00076C, "Member 'AMatchaAICharacterEntity::ReceivingHitFreezeMultiplier' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, MaxFallSpeed) == 0x000770, "Member 'AMatchaAICharacterEntity::MaxFallSpeed' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, WalkSpeed) == 0x000774, "Member 'AMatchaAICharacterEntity::WalkSpeed' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, CoarseHitExtents) == 0x000778, "Member 'AMatchaAICharacterEntity::CoarseHitExtents' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, bEnableBehaviorTreeOnSpawn) == 0x000788, "Member 'AMatchaAICharacterEntity::bEnableBehaviorTreeOnSpawn' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, ChannelToBroadcastDeathEventTo) == 0x00078C, "Member 'AMatchaAICharacterEntity::ChannelToBroadcastDeathEventTo' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, DeathEventToBroadcast) == 0x000794, "Member 'AMatchaAICharacterEntity::DeathEventToBroadcast' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, AggroDistance) == 0x0007A8, "Member 'AMatchaAICharacterEntity::AggroDistance' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, bAllowRepeatAbilities) == 0x0007E0, "Member 'AMatchaAICharacterEntity::bAllowRepeatAbilities' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, HitFreezeDeltaTimeMultiplier) == 0x0007E4, "Member 'AMatchaAICharacterEntity::HitFreezeDeltaTimeMultiplier' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, HorizontalSpeed) == 0x0007E8, "Member 'AMatchaAICharacterEntity::HorizontalSpeed' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, VerticalSpeed) == 0x0007EC, "Member 'AMatchaAICharacterEntity::VerticalSpeed' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, AccelerationStrength) == 0x0007F0, "Member 'AMatchaAICharacterEntity::AccelerationStrength' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, AccelerationLocalDirection) == 0x0007F4, "Member 'AMatchaAICharacterEntity::AccelerationLocalDirection' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, bPoseDirty) == 0x0007F8, "Member 'AMatchaAICharacterEntity::bPoseDirty' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, Scale) == 0x000800, "Member 'AMatchaAICharacterEntity::Scale' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, DefaultHitFXId) == 0x000880, "Member 'AMatchaAICharacterEntity::DefaultHitFXId' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, DeathFX) == 0x000888, "Member 'AMatchaAICharacterEntity::DeathFX' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, Damage) == 0x000910, "Member 'AMatchaAICharacterEntity::Damage' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, FacingInfo) == 0x000950, "Member 'AMatchaAICharacterEntity::FacingInfo' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, HitFreezeStateInfo) == 0x0009C8, "Member 'AMatchaAICharacterEntity::HitFreezeStateInfo' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, AIPlayingMontageInfo) == 0x000A30, "Member 'AMatchaAICharacterEntity::AIPlayingMontageInfo' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, CurrentAppliedRootMotionInfo) == 0x000B40, "Member 'AMatchaAICharacterEntity::CurrentAppliedRootMotionInfo' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, bIsDead) == 0x000C20, "Member 'AMatchaAICharacterEntity::bIsDead' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, AnimationAppliedFlags) == 0x000C38, "Member 'AMatchaAICharacterEntity::AnimationAppliedFlags' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, CurrentFrameOutgoingHits) == 0x000C50, "Member 'AMatchaAICharacterEntity::CurrentFrameOutgoingHits' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, RecentlyAppliedHits) == 0x000C60, "Member 'AMatchaAICharacterEntity::RecentlyAppliedHits' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, SpawnLocation) == 0x000C70, "Member 'AMatchaAICharacterEntity::SpawnLocation' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, SpawnRotation) == 0x000C88, "Member 'AMatchaAICharacterEntity::SpawnRotation' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, bIsInvulnerable) == 0x000CA0, "Member 'AMatchaAICharacterEntity::bIsInvulnerable' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, DisplayName) == 0x000CB8, "Member 'AMatchaAICharacterEntity::DisplayName' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, CurrentTeamNumber) == 0x000CC8, "Member 'AMatchaAICharacterEntity::CurrentTeamNumber' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, DamageBinding) == 0x000CD0, "Member 'AMatchaAICharacterEntity::DamageBinding' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, PlayerNameBinding) == 0x000CF0, "Member 'AMatchaAICharacterEntity::PlayerNameBinding' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterEntity, CurrentFrameIncomingHits) == 0x000D20, "Member 'AMatchaAICharacterEntity::CurrentFrameIncomingHits' has a wrong offset!");

// Class Matcha.MatchaSnapNetEntity
// 0x00E8 (0x0378 - 0x0290)
class AMatchaSnapNetEntity : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USnapNetEntityComponent*                EntityComponent;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMatchaEntityRelevanceMode                    RelevanceMode;                                     // 0x02A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Lifetime;                                          // 0x02A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoDestroysOnDisable;                            // 0x02A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStartAsEnabled;                                   // 0x02A9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSnapNetPropertyInt32                  CreationTime;                                      // 0x02B0(0x0038)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyEntityIndex            InstigatorEntityIndex;                             // 0x02E8(0x0068)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyBoolean                bEnabled;                                          // 0x0350(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	int32                                         LifeTimeMilliSeconds;                              // 0x0368(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_36C[0xC];                                      // 0x036C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnabledChanged(bool bOldEnabled, bool bNewEnabled);
	void OnSpawnFinished();
	void SetEnabled(bool bShouldEnable);

	int32 GetCurrentEntityTimeInMilliseconds() const;
	int32 GetMillisecondsSinceCreation() const;
	class AActor* GetOwnerEntity() const;
	int32 GetOwnerEntityIndex() const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaSnapNetEntity">();
	}
	static class AMatchaSnapNetEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchaSnapNetEntity>();
	}
};
static_assert(alignof(AMatchaSnapNetEntity) == 0x000008, "Wrong alignment on AMatchaSnapNetEntity");
static_assert(sizeof(AMatchaSnapNetEntity) == 0x000378, "Wrong size on AMatchaSnapNetEntity");
static_assert(offsetof(AMatchaSnapNetEntity, EntityComponent) == 0x000298, "Member 'AMatchaSnapNetEntity::EntityComponent' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetEntity, RelevanceMode) == 0x0002A0, "Member 'AMatchaSnapNetEntity::RelevanceMode' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetEntity, Lifetime) == 0x0002A4, "Member 'AMatchaSnapNetEntity::Lifetime' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetEntity, bAutoDestroysOnDisable) == 0x0002A8, "Member 'AMatchaSnapNetEntity::bAutoDestroysOnDisable' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetEntity, bStartAsEnabled) == 0x0002A9, "Member 'AMatchaSnapNetEntity::bStartAsEnabled' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetEntity, CreationTime) == 0x0002B0, "Member 'AMatchaSnapNetEntity::CreationTime' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetEntity, InstigatorEntityIndex) == 0x0002E8, "Member 'AMatchaSnapNetEntity::InstigatorEntityIndex' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetEntity, bEnabled) == 0x000350, "Member 'AMatchaSnapNetEntity::bEnabled' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetEntity, LifeTimeMilliSeconds) == 0x000368, "Member 'AMatchaSnapNetEntity::LifeTimeMilliSeconds' has a wrong offset!");

// Class Matcha.MatchaSnapNetGameEntity
// 0x0370 (0x06E8 - 0x0378)
class AMatchaSnapNetGameEntity : public AMatchaSnapNetEntity
{
public:
	struct FSnapNetPropertyString                 ServerVersion;                                     // 0x0378(0x0030)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSnapNetPropertyFloat                  ServerFrameTime;                                   // 0x03A8(0x0040)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSnapNetPropertyBoolean                IsMatchServer;                                     // 0x03E8(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSnapNetPropertyInt32                  MatchTeamCount;                                    // 0x0400(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSnapNetPropertyInt32                  TotalPlayerCount;                                  // 0x0438(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSnapNetPropertyInt32                  AlivePlayerCount;                                  // 0x0470(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A8[0x28];                                     // 0x04A8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GameplayEventListenChannel;                        // 0x04D0(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             ActorClassesToCache;                               // 0x04D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyEnum                   CurrentMatchPhase;                                 // 0x04E8(0x0048)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyInt32                  MatchPhaseRemainingTime;                           // 0x0530(0x0038)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyInt32                  LastWinningTeamNumber;                             // 0x0568(0x0038)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMatchaTeamNetworkState>        Teams;                                             // 0x05A0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FMatchaGameplayEventNotificationData   MatchaGameplayEventNotificationData;               // 0x05B0(0x00C8)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FMatchaKillFeedNetworkState            KillFeedNetworkState;                              // 0x0678(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class AActor>, struct FWeakActorArray> CachedActorsByClass;                               // 0x0688(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_6D8[0x10];                                     // 0x06D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class AMatchaSnapNetGameEntity* Get(const class UObject* WorldContextObject);

	void OnAnyActorDestroyed(class AActor* DestroyedActor);
	void OnAnyActorSpawned(class AActor* SpawnedActor);

	EMatchaMatchPhase GetCurrentMatchPhase() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaSnapNetGameEntity">();
	}
	static class AMatchaSnapNetGameEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchaSnapNetGameEntity>();
	}
};
static_assert(alignof(AMatchaSnapNetGameEntity) == 0x000008, "Wrong alignment on AMatchaSnapNetGameEntity");
static_assert(sizeof(AMatchaSnapNetGameEntity) == 0x0006E8, "Wrong size on AMatchaSnapNetGameEntity");
static_assert(offsetof(AMatchaSnapNetGameEntity, ServerVersion) == 0x000378, "Member 'AMatchaSnapNetGameEntity::ServerVersion' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, ServerFrameTime) == 0x0003A8, "Member 'AMatchaSnapNetGameEntity::ServerFrameTime' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, IsMatchServer) == 0x0003E8, "Member 'AMatchaSnapNetGameEntity::IsMatchServer' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, MatchTeamCount) == 0x000400, "Member 'AMatchaSnapNetGameEntity::MatchTeamCount' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, TotalPlayerCount) == 0x000438, "Member 'AMatchaSnapNetGameEntity::TotalPlayerCount' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, AlivePlayerCount) == 0x000470, "Member 'AMatchaSnapNetGameEntity::AlivePlayerCount' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, GameplayEventListenChannel) == 0x0004D0, "Member 'AMatchaSnapNetGameEntity::GameplayEventListenChannel' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, ActorClassesToCache) == 0x0004D8, "Member 'AMatchaSnapNetGameEntity::ActorClassesToCache' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, CurrentMatchPhase) == 0x0004E8, "Member 'AMatchaSnapNetGameEntity::CurrentMatchPhase' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, MatchPhaseRemainingTime) == 0x000530, "Member 'AMatchaSnapNetGameEntity::MatchPhaseRemainingTime' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, LastWinningTeamNumber) == 0x000568, "Member 'AMatchaSnapNetGameEntity::LastWinningTeamNumber' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, Teams) == 0x0005A0, "Member 'AMatchaSnapNetGameEntity::Teams' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, MatchaGameplayEventNotificationData) == 0x0005B0, "Member 'AMatchaSnapNetGameEntity::MatchaGameplayEventNotificationData' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, KillFeedNetworkState) == 0x000678, "Member 'AMatchaSnapNetGameEntity::KillFeedNetworkState' has a wrong offset!");
static_assert(offsetof(AMatchaSnapNetGameEntity, CachedActorsByClass) == 0x000688, "Member 'AMatchaSnapNetGameEntity::CachedActorsByClass' has a wrong offset!");

// Class Matcha.MatchaAICharacterRenderer
// 0x0080 (0x0398 - 0x0318)
class AMatchaAICharacterRenderer final : public APawn
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOdyUIFloatBinding                     CurrentDamage;                                     // 0x0320(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FOdyUIFloatBinding                     MaxDamage;                                         // 0x0340(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	class USnapNetEntityRendererComponent*        EntityRendererComponent;                           // 0x0360(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        RootSceneComponent;                                // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsFalling;                                        // 0x0378(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAlive;                                          // 0x0379(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CurrentDisplayName;                                // 0x0380(0x0010)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	int32                                         CurrentTeamNumber;                                 // 0x0390(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaAICharacterRenderer">();
	}
	static class AMatchaAICharacterRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchaAICharacterRenderer>();
	}
};
static_assert(alignof(AMatchaAICharacterRenderer) == 0x000008, "Wrong alignment on AMatchaAICharacterRenderer");
static_assert(sizeof(AMatchaAICharacterRenderer) == 0x000398, "Wrong size on AMatchaAICharacterRenderer");
static_assert(offsetof(AMatchaAICharacterRenderer, CurrentDamage) == 0x000320, "Member 'AMatchaAICharacterRenderer::CurrentDamage' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterRenderer, MaxDamage) == 0x000340, "Member 'AMatchaAICharacterRenderer::MaxDamage' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterRenderer, EntityRendererComponent) == 0x000360, "Member 'AMatchaAICharacterRenderer::EntityRendererComponent' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterRenderer, MeshComponent) == 0x000368, "Member 'AMatchaAICharacterRenderer::MeshComponent' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterRenderer, RootSceneComponent) == 0x000370, "Member 'AMatchaAICharacterRenderer::RootSceneComponent' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterRenderer, bIsFalling) == 0x000378, "Member 'AMatchaAICharacterRenderer::bIsFalling' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterRenderer, bIsAlive) == 0x000379, "Member 'AMatchaAICharacterRenderer::bIsAlive' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterRenderer, CurrentDisplayName) == 0x000380, "Member 'AMatchaAICharacterRenderer::CurrentDisplayName' has a wrong offset!");
static_assert(offsetof(AMatchaAICharacterRenderer, CurrentTeamNumber) == 0x000390, "Member 'AMatchaAICharacterRenderer::CurrentTeamNumber' has a wrong offset!");

// Class Matcha.MatchaAIController
// 0x0000 (0x03C0 - 0x03C0)
class AMatchaAIController final : public ASnapNetAIController
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaAIController">();
	}
	static class AMatchaAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchaAIController>();
	}
};
static_assert(alignof(AMatchaAIController) == 0x000008, "Wrong alignment on AMatchaAIController");
static_assert(sizeof(AMatchaAIController) == 0x0003C0, "Wrong size on AMatchaAIController");

// Class Matcha.MatchaAnalyticsManager
// 0x0068 (0x0090 - 0x0028)
class UMatchaAnalyticsManager final : public UObject
{
public:
	TWeakObjectPtr<class AMatchaSnapNetGameEntity> GameEntity;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<int32, TWeakObjectPtr<class AMatchaSnapNetCharacterEntity>> PlayerCharacters;                                  // 0x0030(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCharacterMontageStarted(class AMatchaCharacterBase* CharacterEntity, float MontageDuration, EMatchaCharacterMontageType MontageType, EMatchaCharacterMontageType PreviousMontageType);
	void OnMatchPhaseChanged(EMatchaMatchPhase MatchPhase);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaAnalyticsManager">();
	}
	static class UMatchaAnalyticsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchaAnalyticsManager>();
	}
};
static_assert(alignof(UMatchaAnalyticsManager) == 0x000008, "Wrong alignment on UMatchaAnalyticsManager");
static_assert(sizeof(UMatchaAnalyticsManager) == 0x000090, "Wrong size on UMatchaAnalyticsManager");
static_assert(offsetof(UMatchaAnalyticsManager, GameEntity) == 0x000028, "Member 'UMatchaAnalyticsManager::GameEntity' has a wrong offset!");
static_assert(offsetof(UMatchaAnalyticsManager, PlayerCharacters) == 0x000030, "Member 'UMatchaAnalyticsManager::PlayerCharacters' has a wrong offset!");

// Class Matcha.MatchaAssetSettings
// 0x0080 (0x00B8 - 0x0038)
class UMatchaAssetSettings final : public UDeveloperSettings
{
public:
	TMap<TSoftClassPtr<class UClass>, struct FPathList> DataAssetsToPin;                                   // 0x0038(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  OfflineMap;                                        // 0x0088(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USnapNetServerScript>       OfflineServerScriptClass;                          // 0x00B0(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaAssetSettings">();
	}
	static class UMatchaAssetSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchaAssetSettings>();
	}
};
static_assert(alignof(UMatchaAssetSettings) == 0x000008, "Wrong alignment on UMatchaAssetSettings");
static_assert(sizeof(UMatchaAssetSettings) == 0x0000B8, "Wrong size on UMatchaAssetSettings");
static_assert(offsetof(UMatchaAssetSettings, DataAssetsToPin) == 0x000038, "Member 'UMatchaAssetSettings::DataAssetsToPin' has a wrong offset!");
static_assert(offsetof(UMatchaAssetSettings, OfflineMap) == 0x000088, "Member 'UMatchaAssetSettings::OfflineMap' has a wrong offset!");
static_assert(offsetof(UMatchaAssetSettings, OfflineServerScriptClass) == 0x0000B0, "Member 'UMatchaAssetSettings::OfflineServerScriptClass' has a wrong offset!");

// Class Matcha.MatchaNotify_PlaySound
// 0x0020 (0x0058 - 0x0038)
class UMatchaNotify_PlaySound final : public UAnimNotify
{
public:
	class FName                                   AudioEventId;                                      // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEffectEventType                              EffectEventType;                                   // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VolumeMultiplier;                                  // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0048(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFollow;                                           // 0x004C(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachName;                                        // 0x0050(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaNotify_PlaySound">();
	}
	static class UMatchaNotify_PlaySound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchaNotify_PlaySound>();
	}
};
static_assert(alignof(UMatchaNotify_PlaySound) == 0x000008, "Wrong alignment on UMatchaNotify_PlaySound");
static_assert(sizeof(UMatchaNotify_PlaySound) == 0x000058, "Wrong size on UMatchaNotify_PlaySound");
static_assert(offsetof(UMatchaNotify_PlaySound, AudioEventId) == 0x000038, "Member 'UMatchaNotify_PlaySound::AudioEventId' has a wrong offset!");
static_assert(offsetof(UMatchaNotify_PlaySound, EffectEventType) == 0x000040, "Member 'UMatchaNotify_PlaySound::EffectEventType' has a wrong offset!");
static_assert(offsetof(UMatchaNotify_PlaySound, VolumeMultiplier) == 0x000044, "Member 'UMatchaNotify_PlaySound::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UMatchaNotify_PlaySound, PitchMultiplier) == 0x000048, "Member 'UMatchaNotify_PlaySound::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(UMatchaNotify_PlaySound, bFollow) == 0x00004C, "Member 'UMatchaNotify_PlaySound::bFollow' has a wrong offset!");
static_assert(offsetof(UMatchaNotify_PlaySound, AttachName) == 0x000050, "Member 'UMatchaNotify_PlaySound::AttachName' has a wrong offset!");

// Class Matcha.MatchaAssetManager
// 0x0010 (0x04E0 - 0x04D0)
class UMatchaAssetManager final : public UAssetManager
{
public:
	uint8                                         Pad_4D0[0x10];                                     // 0x04D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchaAssetManager">();
	}
	static class UMatchaAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchaAssetManager>();
	}
};
static_assert(alignof(UMatchaAssetManager) == 0x000008, "Wrong alignment on UMatchaAssetManager");
static_assert(sizeof(UMatchaAssetManager) == 0x0004E0, "Wrong size on UMatchaAssetManager");

// Class Matcha.MatchaCharacterBase
// 0x0CE0 (0x1350 - 0x0670)
#pragma pack(push, 0x1)
class alignas(0x10) AMatchaCharacterBase : public ACharacter
{
public:
	uint8                                         Pad_668[0x28];                                     // 0x0668(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CoarseHitExtents;                                  // 0x0690(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CharacterSizeScale;                                // 0x06A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DefaultJumpCustomGravityCurve;                     // 0x06A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EJumpType, class UCurveFloat*>           PerJumpTypeCustomGravityCurve;                     // 0x06B0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<EFallType, float>                        PerFallTypeMaxFallSpeed;                           // 0x0700(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<EFallType, float>                        PerFallTypeGravityScale;                           // 0x0750(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCurveFloat*                            TargetedGlitchDashCurve;                           // 0x07A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxOutOfAutoTravelSpeed;                           // 0x07A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Weight;                                            // 0x07AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ReceivingHitFreezeMultiplier;                      // 0x07B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyDiminishingReturnsToStuns;                   // 0x07B4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7B5[0x3];                                      // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFacingInfo                            FacingInfo;                                        // 0x07B8(0x0078)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FHitFreezeStateInfo                    HitFreezeStateInfo;                                // 0x0830(0x0068)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_898[0x8];                                      // 0x0898(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayingMontageInfo                    PlayingMontageInfo;                                // 0x08A0(0x0160)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FAppliedRootMotionInfo                 CurrentAppliedRootMotionInfo;                      // 0x0A00(0x0108)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FAutoTravelRootMotionInfo              CurrentAutoTravelRootMotionInfo;                   // 0x0B08(0x02A8)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FTargetedGlitchDashInfo                CurrentTargetedGlitchDashInfo;                     // 0x0DB0(0x0140)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyBoolean                bIsInClankFreeze;                                  // 0x0EF0(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyEnum                   AliveState;                                        // 0x0F08(0x0048)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyEnum                   CurrentFallType;                                   // 0x0F50(0x0048)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyVelocity               Acceleration;                                      // 0x0F98(0x0038)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FJumpNetworkData                       JumpNetworkData;                                   // 0x0FD0(0x0100)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyInt32                  CurrentMontageId;                                  // 0x10D0(0x0038)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyFloat                  RemainingStunTime;                                 // 0x1108(0x0040)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyInt32                  LastStunnedTime;                                   // 0x1148(0x0038)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyInt32                  RecentlyRequestedStunCount;                        // 0x1180(0x0038)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyBoolean                bIsImmuneToStuns;                                  // 0x11B8(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FSnapNetPropertyBoolean                bShouldBeRevealedToAllPlayers;                     // 0x11D0(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	class USnapNetEntityComponent*                EntityComponent;                                   // 0x11E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
