#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MustKnock_KO_Box

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SnapNet_structs.hpp"
#include "E_KOVolumeKnockedInto_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MustKnock_KO_Box.MustKnock_KO_Box_C
// 0x00A0 (0x04A8 - 0x0408)
class AMustKnock_KO_Box_C final : public AE_KOVolumeKnockedInto_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   MustKnock_KO_Box;                                  // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          KOBox;                                             // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSnapNetPropertyVector                 KOExtents;                                         // 0x0428(0x0080)(Edit, BlueprintVisible, Transient)

public:
	void ExecuteUbergraph_MustKnock_KO_Box(int32 EntryPoint);
	void OnRep_LayerActive();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MustKnock_KO_Box_C">();
	}
	static class AMustKnock_KO_Box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMustKnock_KO_Box_C>();
	}
};
static_assert(alignof(AMustKnock_KO_Box_C) == 0x000008, "Wrong alignment on AMustKnock_KO_Box_C");
static_assert(sizeof(AMustKnock_KO_Box_C) == 0x0004A8, "Wrong size on AMustKnock_KO_Box_C");
static_assert(offsetof(AMustKnock_KO_Box_C, UberGraphFrame) == 0x000408, "Member 'AMustKnock_KO_Box_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMustKnock_KO_Box_C, MustKnock_KO_Box) == 0x000410, "Member 'AMustKnock_KO_Box_C::MustKnock_KO_Box' has a wrong offset!");
static_assert(offsetof(AMustKnock_KO_Box_C, Cube) == 0x000418, "Member 'AMustKnock_KO_Box_C::Cube' has a wrong offset!");
static_assert(offsetof(AMustKnock_KO_Box_C, KOBox) == 0x000420, "Member 'AMustKnock_KO_Box_C::KOBox' has a wrong offset!");
static_assert(offsetof(AMustKnock_KO_Box_C, KOExtents) == 0x000428, "Member 'AMustKnock_KO_Box_C::KOExtents' has a wrong offset!");

}

