#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OdyGameZones

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OdyGameZones.OdyGameZone.OnZoneDefinitionChanged
// 0x0008 (0x0008 - 0x0000)
struct OdyGameZone_OnZoneDefinitionChanged final
{
public:
	class UOdyGameZoneDefinition*                 InZoneDefinition;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyGameZone_OnZoneDefinitionChanged) == 0x000008, "Wrong alignment on OdyGameZone_OnZoneDefinitionChanged");
static_assert(sizeof(OdyGameZone_OnZoneDefinitionChanged) == 0x000008, "Wrong size on OdyGameZone_OnZoneDefinitionChanged");
static_assert(offsetof(OdyGameZone_OnZoneDefinitionChanged, InZoneDefinition) == 0x000000, "Member 'OdyGameZone_OnZoneDefinitionChanged::InZoneDefinition' has a wrong offset!");

// Function OdyGameZones.OdyGameZonePOI.GetDisplayName
// 0x0008 (0x0008 - 0x0000)
struct OdyGameZonePOI_GetDisplayName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyGameZonePOI_GetDisplayName) == 0x000004, "Wrong alignment on OdyGameZonePOI_GetDisplayName");
static_assert(sizeof(OdyGameZonePOI_GetDisplayName) == 0x000008, "Wrong size on OdyGameZonePOI_GetDisplayName");
static_assert(offsetof(OdyGameZonePOI_GetDisplayName, ReturnValue) == 0x000000, "Member 'OdyGameZonePOI_GetDisplayName::ReturnValue' has a wrong offset!");

// Function OdyGameZones.OdyGameZonePOI.GetRelevanceBounds
// 0x0038 (0x0038 - 0x0000)
struct OdyGameZonePOI_GetRelevanceBounds final
{
public:
	struct FBox                                   ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyGameZonePOI_GetRelevanceBounds) == 0x000008, "Wrong alignment on OdyGameZonePOI_GetRelevanceBounds");
static_assert(sizeof(OdyGameZonePOI_GetRelevanceBounds) == 0x000038, "Wrong size on OdyGameZonePOI_GetRelevanceBounds");
static_assert(offsetof(OdyGameZonePOI_GetRelevanceBounds, ReturnValue) == 0x000000, "Member 'OdyGameZonePOI_GetRelevanceBounds::ReturnValue' has a wrong offset!");

}

