#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OdyServices

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "OdyServices_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class OdyServices.OdyServicesConfiguration
// 0x0048 (0x0070 - 0x0028)
class UOdyServicesConfiguration final : public UObject
{
public:
	int32                                         MaxWebSocketReconnectAttempts;                     // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WebSocketMaximumConnectionSeconds;                 // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseUrl;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxApiRetryAttempts;                               // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ModelBaseClass;                                    // 0x0048(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OdyServicesConfiguration">();
	}
	static class UOdyServicesConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOdyServicesConfiguration>();
	}
};
static_assert(alignof(UOdyServicesConfiguration) == 0x000008, "Wrong alignment on UOdyServicesConfiguration");
static_assert(sizeof(UOdyServicesConfiguration) == 0x000070, "Wrong size on UOdyServicesConfiguration");
static_assert(offsetof(UOdyServicesConfiguration, MaxWebSocketReconnectAttempts) == 0x000028, "Member 'UOdyServicesConfiguration::MaxWebSocketReconnectAttempts' has a wrong offset!");
static_assert(offsetof(UOdyServicesConfiguration, WebSocketMaximumConnectionSeconds) == 0x00002C, "Member 'UOdyServicesConfiguration::WebSocketMaximumConnectionSeconds' has a wrong offset!");
static_assert(offsetof(UOdyServicesConfiguration, BaseUrl) == 0x000030, "Member 'UOdyServicesConfiguration::BaseUrl' has a wrong offset!");
static_assert(offsetof(UOdyServicesConfiguration, MaxApiRetryAttempts) == 0x000040, "Member 'UOdyServicesConfiguration::MaxApiRetryAttempts' has a wrong offset!");
static_assert(offsetof(UOdyServicesConfiguration, ModelBaseClass) == 0x000048, "Member 'UOdyServicesConfiguration::ModelBaseClass' has a wrong offset!");

// Class OdyServices.OdyServicesModel
// 0x0008 (0x0030 - 0x0028)
class UOdyServicesModel : public UObject
{
public:
	class UOdyServicesModelBase*                  OwningModel;                                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OdyServicesModel">();
	}
	static class UOdyServicesModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOdyServicesModel>();
	}
};
static_assert(alignof(UOdyServicesModel) == 0x000008, "Wrong alignment on UOdyServicesModel");
static_assert(sizeof(UOdyServicesModel) == 0x000030, "Wrong size on UOdyServicesModel");
static_assert(offsetof(UOdyServicesModel, OwningModel) == 0x000028, "Member 'UOdyServicesModel::OwningModel' has a wrong offset!");

// Class OdyServices.OdyServicesModelBase
// 0x02B8 (0x02E0 - 0x0028)
class UOdyServicesModelBase : public UObject
{
public:
	TArray<class UOdyServicesModel*>              Models;                                            // 0x0028(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnWebSocketConnectionStateChangedDynamic;          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x270];                                     // 0x0070(0x0270)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ConnectWebSocket(const struct FWebSocketConnectionInfo& ConnectionInfo);
	void DisconnectWebSocket();
	void OnStateChangedDynamic__DelegateSignature(class UOdyServicesModelBase* ServicesModelBase);
	void ReconnectWebSocket();
	void SendWebSocketMessageRaw(const class FString& Message);

	EOdyWebSocketConnectionState GetWebSocketConnectionState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OdyServicesModelBase">();
	}
	static class UOdyServicesModelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOdyServicesModelBase>();
	}
};
static_assert(alignof(UOdyServicesModelBase) == 0x000008, "Wrong alignment on UOdyServicesModelBase");
static_assert(sizeof(UOdyServicesModelBase) == 0x0002E0, "Wrong size on UOdyServicesModelBase");
static_assert(offsetof(UOdyServicesModelBase, Models) == 0x000028, "Member 'UOdyServicesModelBase::Models' has a wrong offset!");
static_assert(offsetof(UOdyServicesModelBase, OnWebSocketConnectionStateChangedDynamic) == 0x000060, "Member 'UOdyServicesModelBase::OnWebSocketConnectionStateChangedDynamic' has a wrong offset!");

// Class OdyServices.OdyServicesSubsystem
// 0x0008 (0x0038 - 0x0030)
class UOdyServicesSubsystem final : public UGameInstanceSubsystem
{
public:
	class UOdyServicesModelBase*                  ModelBase;                                         // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OdyServicesSubsystem">();
	}
	static class UOdyServicesSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOdyServicesSubsystem>();
	}
};
static_assert(alignof(UOdyServicesSubsystem) == 0x000008, "Wrong alignment on UOdyServicesSubsystem");
static_assert(sizeof(UOdyServicesSubsystem) == 0x000038, "Wrong size on UOdyServicesSubsystem");
static_assert(offsetof(UOdyServicesSubsystem, ModelBase) == 0x000030, "Member 'UOdyServicesSubsystem::ModelBase' has a wrong offset!");

}

