#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OdyUtils

#include "Basic.hpp"

#include "OdyUtils_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class OdyUtils.OdyUtilsConfiguration
// 0x0058 (0x0090 - 0x0038)
class UOdyUtilsConfiguration final : public UDeveloperSettings
{
public:
	bool                                          bOverridePlatform;                                 // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlatformType                                 Platform;                                          // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WebSocketUrl;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseUrl;                                           // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseProxyUrl;                                      // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TelemetryUrl;                                      // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SecretAuthorizationKey;                            // 0x0080(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OdyUtilsConfiguration">();
	}
	static class UOdyUtilsConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOdyUtilsConfiguration>();
	}
};
static_assert(alignof(UOdyUtilsConfiguration) == 0x000008, "Wrong alignment on UOdyUtilsConfiguration");
static_assert(sizeof(UOdyUtilsConfiguration) == 0x000090, "Wrong size on UOdyUtilsConfiguration");
static_assert(offsetof(UOdyUtilsConfiguration, bOverridePlatform) == 0x000038, "Member 'UOdyUtilsConfiguration::bOverridePlatform' has a wrong offset!");
static_assert(offsetof(UOdyUtilsConfiguration, Platform) == 0x000039, "Member 'UOdyUtilsConfiguration::Platform' has a wrong offset!");
static_assert(offsetof(UOdyUtilsConfiguration, WebSocketUrl) == 0x000040, "Member 'UOdyUtilsConfiguration::WebSocketUrl' has a wrong offset!");
static_assert(offsetof(UOdyUtilsConfiguration, BaseUrl) == 0x000050, "Member 'UOdyUtilsConfiguration::BaseUrl' has a wrong offset!");
static_assert(offsetof(UOdyUtilsConfiguration, BaseProxyUrl) == 0x000060, "Member 'UOdyUtilsConfiguration::BaseProxyUrl' has a wrong offset!");
static_assert(offsetof(UOdyUtilsConfiguration, TelemetryUrl) == 0x000070, "Member 'UOdyUtilsConfiguration::TelemetryUrl' has a wrong offset!");
static_assert(offsetof(UOdyUtilsConfiguration, SecretAuthorizationKey) == 0x000080, "Member 'UOdyUtilsConfiguration::SecretAuthorizationKey' has a wrong offset!");

// Class OdyUtils.OdyUtilsStatics
// 0x0000 (0x0028 - 0x0028)
class UOdyUtilsStatics final : public UBlueprintFunctionLibrary
{
public:
	static void FlushPressedKeys(class APlayerController* InPlayerController);
	static class FName GetBuildNumber();
	static class FName GetKeyName(const struct FKey& Key);
	static int32 GetPIEInstanceNumber(const class UObject* WorldContextObject);
	static EPlatformType GetPlatformType();
	static class FString GetPlayerNickname(class APlayerController* InPlayerController);
	static class FString GetPlaystationProductId();
	static EPlayStationRegion GetPlayStationRegion();
	static EPlayStationType GetPlayStationType();
	static void GetSuggestedResolutions(TArray<struct FIntPoint>* Resolutions);
	static bool IsAchievementsNecessaryPlatform();
	static bool IsConsolePlatform();
	static bool IsMobilePlatform();
	static bool IsPCPlatform();
	static void PostToDiscordWebhook(const class FString& WebhookUrl, const class FString& Sender, const class FString& Message, const TArray<class FString>& FilesToAttach, const TArray<class FString>& OptionalFileContentTypes);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OdyUtilsStatics">();
	}
	static class UOdyUtilsStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOdyUtilsStatics>();
	}
};
static_assert(alignof(UOdyUtilsStatics) == 0x000008, "Wrong alignment on UOdyUtilsStatics");
static_assert(sizeof(UOdyUtilsStatics) == 0x000028, "Wrong size on UOdyUtilsStatics");

}

