#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OdyUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OdyUtils_structs.hpp"
#include "OdyUI_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "StructUtils_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function OdyUI.OdyWidget.AddDataBindingContext
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_AddDataBindingContext final
{
public:
	class FName                                   ContextName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_AddDataBindingContext) == 0x000004, "Wrong alignment on OdyWidget_AddDataBindingContext");
static_assert(sizeof(OdyWidget_AddDataBindingContext) == 0x000008, "Wrong size on OdyWidget_AddDataBindingContext");
static_assert(offsetof(OdyWidget_AddDataBindingContext, ContextName) == 0x000000, "Member 'OdyWidget_AddDataBindingContext::ContextName' has a wrong offset!");

// Function OdyUI.OdyWidget.AddInputMappingContext
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_AddInputMappingContext final
{
public:
	class UInputMappingContext*                   InputContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_AddInputMappingContext) == 0x000008, "Wrong alignment on OdyWidget_AddInputMappingContext");
static_assert(sizeof(OdyWidget_AddInputMappingContext) == 0x000008, "Wrong size on OdyWidget_AddInputMappingContext");
static_assert(offsetof(OdyWidget_AddInputMappingContext, InputContext) == 0x000000, "Member 'OdyWidget_AddInputMappingContext::InputContext' has a wrong offset!");

// Function OdyUI.OdyWidget.BindData
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_BindData) == 0x000008, "Wrong alignment on OdyWidget_BindData");
static_assert(sizeof(OdyWidget_BindData) == 0x000008, "Wrong size on OdyWidget_BindData");
static_assert(offsetof(OdyWidget_BindData, NewUIData) == 0x000000, "Member 'OdyWidget_BindData::NewUIData' has a wrong offset!");

// Function OdyUI.OdyWidget.ClearBindingsWithContext
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_ClearBindingsWithContext final
{
public:
	class FName                                   BindingContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_ClearBindingsWithContext) == 0x000004, "Wrong alignment on OdyWidget_ClearBindingsWithContext");
static_assert(sizeof(OdyWidget_ClearBindingsWithContext) == 0x000008, "Wrong size on OdyWidget_ClearBindingsWithContext");
static_assert(offsetof(OdyWidget_ClearBindingsWithContext, BindingContext) == 0x000000, "Member 'OdyWidget_ClearBindingsWithContext::BindingContext' has a wrong offset!");

// Function OdyUI.OdyWidget.GetWidgetToFocus
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_GetWidgetToFocus final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_GetWidgetToFocus) == 0x000008, "Wrong alignment on OdyWidget_GetWidgetToFocus");
static_assert(sizeof(OdyWidget_GetWidgetToFocus) == 0x000008, "Wrong size on OdyWidget_GetWidgetToFocus");
static_assert(offsetof(OdyWidget_GetWidgetToFocus, ReturnValue) == 0x000000, "Member 'OdyWidget_GetWidgetToFocus::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyWidget.OnLocalBasePlayerStateAndGameStateReady
// 0x0010 (0x0010 - 0x0000)
struct OdyWidget_OnLocalBasePlayerStateAndGameStateReady final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGameStateBase*                         GameState;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_OnLocalBasePlayerStateAndGameStateReady) == 0x000008, "Wrong alignment on OdyWidget_OnLocalBasePlayerStateAndGameStateReady");
static_assert(sizeof(OdyWidget_OnLocalBasePlayerStateAndGameStateReady) == 0x000010, "Wrong size on OdyWidget_OnLocalBasePlayerStateAndGameStateReady");
static_assert(offsetof(OdyWidget_OnLocalBasePlayerStateAndGameStateReady, PlayerState) == 0x000000, "Member 'OdyWidget_OnLocalBasePlayerStateAndGameStateReady::PlayerState' has a wrong offset!");
static_assert(offsetof(OdyWidget_OnLocalBasePlayerStateAndGameStateReady, GameState) == 0x000008, "Member 'OdyWidget_OnLocalBasePlayerStateAndGameStateReady::GameState' has a wrong offset!");

// Function OdyUI.OdyWidget.OnNetOwnerBasePlayerStateSet
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_OnNetOwnerBasePlayerStateSet final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_OnNetOwnerBasePlayerStateSet) == 0x000008, "Wrong alignment on OdyWidget_OnNetOwnerBasePlayerStateSet");
static_assert(sizeof(OdyWidget_OnNetOwnerBasePlayerStateSet) == 0x000008, "Wrong size on OdyWidget_OnNetOwnerBasePlayerStateSet");
static_assert(offsetof(OdyWidget_OnNetOwnerBasePlayerStateSet, PlayerState) == 0x000000, "Member 'OdyWidget_OnNetOwnerBasePlayerStateSet::PlayerState' has a wrong offset!");

// Function OdyUI.OdyWidget.OnUIDataSet
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_OnUIDataSet final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_OnUIDataSet) == 0x000008, "Wrong alignment on OdyWidget_OnUIDataSet");
static_assert(sizeof(OdyWidget_OnUIDataSet) == 0x000008, "Wrong size on OdyWidget_OnUIDataSet");
static_assert(offsetof(OdyWidget_OnUIDataSet, NewUIData) == 0x000000, "Member 'OdyWidget_OnUIDataSet::NewUIData' has a wrong offset!");

// Function OdyUI.OdyWidget.RemoveInputMappingContext
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_RemoveInputMappingContext final
{
public:
	class UInputMappingContext*                   InputContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_RemoveInputMappingContext) == 0x000008, "Wrong alignment on OdyWidget_RemoveInputMappingContext");
static_assert(sizeof(OdyWidget_RemoveInputMappingContext) == 0x000008, "Wrong size on OdyWidget_RemoveInputMappingContext");
static_assert(offsetof(OdyWidget_RemoveInputMappingContext, InputContext) == 0x000000, "Member 'OdyWidget_RemoveInputMappingContext::InputContext' has a wrong offset!");

// Function OdyUI.OdyWidget.RemoveLatestDataBindingContext
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_RemoveLatestDataBindingContext final
{
public:
	class FName                                   ContextName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_RemoveLatestDataBindingContext) == 0x000004, "Wrong alignment on OdyWidget_RemoveLatestDataBindingContext");
static_assert(sizeof(OdyWidget_RemoveLatestDataBindingContext) == 0x000008, "Wrong size on OdyWidget_RemoveLatestDataBindingContext");
static_assert(offsetof(OdyWidget_RemoveLatestDataBindingContext, ContextName) == 0x000000, "Member 'OdyWidget_RemoveLatestDataBindingContext::ContextName' has a wrong offset!");

// Function OdyUI.OdyWidget.SetInputContextPriority
// 0x0001 (0x0001 - 0x0000)
struct OdyWidget_SetInputContextPriority final
{
public:
	EOdyInputContextPriority                      InInputContextPriority;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_SetInputContextPriority) == 0x000001, "Wrong alignment on OdyWidget_SetInputContextPriority");
static_assert(sizeof(OdyWidget_SetInputContextPriority) == 0x000001, "Wrong size on OdyWidget_SetInputContextPriority");
static_assert(offsetof(OdyWidget_SetInputContextPriority, InInputContextPriority) == 0x000000, "Member 'OdyWidget_SetInputContextPriority::InInputContextPriority' has a wrong offset!");

// Function OdyUI.OdyWidget.SetNetOwnerPlayerState
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_SetNetOwnerPlayerState final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_SetNetOwnerPlayerState) == 0x000008, "Wrong alignment on OdyWidget_SetNetOwnerPlayerState");
static_assert(sizeof(OdyWidget_SetNetOwnerPlayerState) == 0x000008, "Wrong size on OdyWidget_SetNetOwnerPlayerState");
static_assert(offsetof(OdyWidget_SetNetOwnerPlayerState, PlayerState) == 0x000000, "Member 'OdyWidget_SetNetOwnerPlayerState::PlayerState' has a wrong offset!");

// Function OdyUI.OdyWidget.SetTickWhenOffscreen
// 0x0001 (0x0001 - 0x0000)
struct OdyWidget_SetTickWhenOffscreen final
{
public:
	bool                                          bInTickWhenOffscreen;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_SetTickWhenOffscreen) == 0x000001, "Wrong alignment on OdyWidget_SetTickWhenOffscreen");
static_assert(sizeof(OdyWidget_SetTickWhenOffscreen) == 0x000001, "Wrong size on OdyWidget_SetTickWhenOffscreen");
static_assert(offsetof(OdyWidget_SetTickWhenOffscreen, bInTickWhenOffscreen) == 0x000000, "Member 'OdyWidget_SetTickWhenOffscreen::bInTickWhenOffscreen' has a wrong offset!");

// Function OdyUI.OdyWidget.SetUIData
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_SetUIData final
{
public:
	class UOdyUIData*                             InUIData;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_SetUIData) == 0x000008, "Wrong alignment on OdyWidget_SetUIData");
static_assert(sizeof(OdyWidget_SetUIData) == 0x000008, "Wrong size on OdyWidget_SetUIData");
static_assert(offsetof(OdyWidget_SetUIData, InUIData) == 0x000000, "Member 'OdyWidget_SetUIData::InUIData' has a wrong offset!");

// Function OdyUI.OdyWidget.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_UnbindData) == 0x000008, "Wrong alignment on OdyWidget_UnbindData");
static_assert(sizeof(OdyWidget_UnbindData) == 0x000008, "Wrong size on OdyWidget_UnbindData");
static_assert(offsetof(OdyWidget_UnbindData, OldUIData) == 0x000000, "Member 'OdyWidget_UnbindData::OldUIData' has a wrong offset!");

// Function OdyUI.OdyWidget.GetCurrentDataBindingContext
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_GetCurrentDataBindingContext final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_GetCurrentDataBindingContext) == 0x000004, "Wrong alignment on OdyWidget_GetCurrentDataBindingContext");
static_assert(sizeof(OdyWidget_GetCurrentDataBindingContext) == 0x000008, "Wrong size on OdyWidget_GetCurrentDataBindingContext");
static_assert(offsetof(OdyWidget_GetCurrentDataBindingContext, ReturnValue) == 0x000000, "Member 'OdyWidget_GetCurrentDataBindingContext::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyWidget.GetNetOwnerBasePlayerState
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_GetNetOwnerBasePlayerState final
{
public:
	class APlayerState*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_GetNetOwnerBasePlayerState) == 0x000008, "Wrong alignment on OdyWidget_GetNetOwnerBasePlayerState");
static_assert(sizeof(OdyWidget_GetNetOwnerBasePlayerState) == 0x000008, "Wrong size on OdyWidget_GetNetOwnerBasePlayerState");
static_assert(offsetof(OdyWidget_GetNetOwnerBasePlayerState, ReturnValue) == 0x000000, "Member 'OdyWidget_GetNetOwnerBasePlayerState::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyWidget.GetUIData
// 0x0008 (0x0008 - 0x0000)
struct OdyWidget_GetUIData final
{
public:
	class UOdyUIData*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_GetUIData) == 0x000008, "Wrong alignment on OdyWidget_GetUIData");
static_assert(sizeof(OdyWidget_GetUIData) == 0x000008, "Wrong size on OdyWidget_GetUIData");
static_assert(offsetof(OdyWidget_GetUIData, ReturnValue) == 0x000000, "Member 'OdyWidget_GetUIData::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyWidget.GetWidgetToFocusNames
// 0x0010 (0x0010 - 0x0000)
struct OdyWidget_GetWidgetToFocusNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_GetWidgetToFocusNames) == 0x000008, "Wrong alignment on OdyWidget_GetWidgetToFocusNames");
static_assert(sizeof(OdyWidget_GetWidgetToFocusNames) == 0x000010, "Wrong size on OdyWidget_GetWidgetToFocusNames");
static_assert(offsetof(OdyWidget_GetWidgetToFocusNames, ReturnValue) == 0x000000, "Member 'OdyWidget_GetWidgetToFocusNames::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyWidget.HasOwnerFocus
// 0x0002 (0x0002 - 0x0000)
struct OdyWidget_HasOwnerFocus final
{
public:
	bool                                          bIncludingDescendants;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyWidget_HasOwnerFocus) == 0x000001, "Wrong alignment on OdyWidget_HasOwnerFocus");
static_assert(sizeof(OdyWidget_HasOwnerFocus) == 0x000002, "Wrong size on OdyWidget_HasOwnerFocus");
static_assert(offsetof(OdyWidget_HasOwnerFocus, bIncludingDescendants) == 0x000000, "Member 'OdyWidget_HasOwnerFocus::bIncludingDescendants' has a wrong offset!");
static_assert(offsetof(OdyWidget_HasOwnerFocus, ReturnValue) == 0x000001, "Member 'OdyWidget_HasOwnerFocus::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyMenu.HideOtherModalUntilClosed
// 0x0008 (0x0008 - 0x0000)
struct OdyMenu_HideOtherModalUntilClosed final
{
public:
	class UOdyMenu*                               OtherMenu;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_HideOtherModalUntilClosed) == 0x000008, "Wrong alignment on OdyMenu_HideOtherModalUntilClosed");
static_assert(sizeof(OdyMenu_HideOtherModalUntilClosed) == 0x000008, "Wrong size on OdyMenu_HideOtherModalUntilClosed");
static_assert(offsetof(OdyMenu_HideOtherModalUntilClosed, OtherMenu) == 0x000000, "Member 'OdyMenu_HideOtherModalUntilClosed::OtherMenu' has a wrong offset!");

// Function OdyUI.OdyMenu.OnNavigatedAway
// 0x0001 (0x0001 - 0x0000)
struct OdyMenu_OnNavigatedAway final
{
public:
	EOdyNavigationDirection                       NavDirection;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_OnNavigatedAway) == 0x000001, "Wrong alignment on OdyMenu_OnNavigatedAway");
static_assert(sizeof(OdyMenu_OnNavigatedAway) == 0x000001, "Wrong size on OdyMenu_OnNavigatedAway");
static_assert(offsetof(OdyMenu_OnNavigatedAway, NavDirection) == 0x000000, "Member 'OdyMenu_OnNavigatedAway::NavDirection' has a wrong offset!");

// Function OdyUI.OdyMenu.OnNavigatedTo
// 0x0068 (0x0068 - 0x0000)
struct OdyMenu_OnNavigatedTo final
{
public:
	TMap<class FString, class FString>            Args;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Action;                                            // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOdyNavigationDirection                       NavDirection;                                      // 0x0060(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OdyMenu_OnNavigatedTo) == 0x000008, "Wrong alignment on OdyMenu_OnNavigatedTo");
static_assert(sizeof(OdyMenu_OnNavigatedTo) == 0x000068, "Wrong size on OdyMenu_OnNavigatedTo");
static_assert(offsetof(OdyMenu_OnNavigatedTo, Args) == 0x000000, "Member 'OdyMenu_OnNavigatedTo::Args' has a wrong offset!");
static_assert(offsetof(OdyMenu_OnNavigatedTo, Action) == 0x000050, "Member 'OdyMenu_OnNavigatedTo::Action' has a wrong offset!");
static_assert(offsetof(OdyMenu_OnNavigatedTo, NavDirection) == 0x000060, "Member 'OdyMenu_OnNavigatedTo::NavDirection' has a wrong offset!");

// Function OdyUI.OdyMenu.SetInputModeOverride
// 0x0001 (0x0001 - 0x0000)
struct OdyMenu_SetInputModeOverride final
{
public:
	EMenuInputMode                                InputMode;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_SetInputModeOverride) == 0x000001, "Wrong alignment on OdyMenu_SetInputModeOverride");
static_assert(sizeof(OdyMenu_SetInputModeOverride) == 0x000001, "Wrong size on OdyMenu_SetInputModeOverride");
static_assert(offsetof(OdyMenu_SetInputModeOverride, InputMode) == 0x000000, "Member 'OdyMenu_SetInputModeOverride::InputMode' has a wrong offset!");

// Function OdyUI.OdyMenu.SetModalPriorityOverride
// 0x0001 (0x0001 - 0x0000)
struct OdyMenu_SetModalPriorityOverride final
{
public:
	EOdyModalPriority                             ModalPri;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_SetModalPriorityOverride) == 0x000001, "Wrong alignment on OdyMenu_SetModalPriorityOverride");
static_assert(sizeof(OdyMenu_SetModalPriorityOverride) == 0x000001, "Wrong size on OdyMenu_SetModalPriorityOverride");
static_assert(offsetof(OdyMenu_SetModalPriorityOverride, ModalPri) == 0x000000, "Member 'OdyMenu_SetModalPriorityOverride::ModalPri' has a wrong offset!");

// Function OdyUI.OdyMenu.SetNeverWantsInput
// 0x0001 (0x0001 - 0x0000)
struct OdyMenu_SetNeverWantsInput final
{
public:
	bool                                          bNeverWantsInput;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_SetNeverWantsInput) == 0x000001, "Wrong alignment on OdyMenu_SetNeverWantsInput");
static_assert(sizeof(OdyMenu_SetNeverWantsInput) == 0x000001, "Wrong size on OdyMenu_SetNeverWantsInput");
static_assert(offsetof(OdyMenu_SetNeverWantsInput, bNeverWantsInput) == 0x000000, "Member 'OdyMenu_SetNeverWantsInput::bNeverWantsInput' has a wrong offset!");

// Function OdyUI.OdyMenu.SetWantsAnalogCursor
// 0x0001 (0x0001 - 0x0000)
struct OdyMenu_SetWantsAnalogCursor final
{
public:
	EOdyAnalogCursorSetting                       InWantsAnalogCursor;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_SetWantsAnalogCursor) == 0x000001, "Wrong alignment on OdyMenu_SetWantsAnalogCursor");
static_assert(sizeof(OdyMenu_SetWantsAnalogCursor) == 0x000001, "Wrong size on OdyMenu_SetWantsAnalogCursor");
static_assert(offsetof(OdyMenu_SetWantsAnalogCursor, InWantsAnalogCursor) == 0x000000, "Member 'OdyMenu_SetWantsAnalogCursor::InWantsAnalogCursor' has a wrong offset!");

// Function OdyUI.OdyMenu.SetWantsAnalogCursorHidden
// 0x0001 (0x0001 - 0x0000)
struct OdyMenu_SetWantsAnalogCursorHidden final
{
public:
	EOdyAnalogCursorSetting                       InWantsAnalogCursorHidden;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_SetWantsAnalogCursorHidden) == 0x000001, "Wrong alignment on OdyMenu_SetWantsAnalogCursorHidden");
static_assert(sizeof(OdyMenu_SetWantsAnalogCursorHidden) == 0x000001, "Wrong size on OdyMenu_SetWantsAnalogCursorHidden");
static_assert(offsetof(OdyMenu_SetWantsAnalogCursorHidden, InWantsAnalogCursorHidden) == 0x000000, "Member 'OdyMenu_SetWantsAnalogCursorHidden::InWantsAnalogCursorHidden' has a wrong offset!");

// Function OdyUI.OdyMenu.SetWantsAnalogCursorLocked
// 0x0001 (0x0001 - 0x0000)
struct OdyMenu_SetWantsAnalogCursorLocked final
{
public:
	EOdyAnalogCursorSetting                       InWantsAnalogCursorLocked;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_SetWantsAnalogCursorLocked) == 0x000001, "Wrong alignment on OdyMenu_SetWantsAnalogCursorLocked");
static_assert(sizeof(OdyMenu_SetWantsAnalogCursorLocked) == 0x000001, "Wrong size on OdyMenu_SetWantsAnalogCursorLocked");
static_assert(offsetof(OdyMenu_SetWantsAnalogCursorLocked, InWantsAnalogCursorLocked) == 0x000000, "Member 'OdyMenu_SetWantsAnalogCursorLocked::InWantsAnalogCursorLocked' has a wrong offset!");

// Function OdyUI.OdyMenu.GetInputMode
// 0x0001 (0x0001 - 0x0000)
struct OdyMenu_GetInputMode final
{
public:
	EMenuInputMode                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_GetInputMode) == 0x000001, "Wrong alignment on OdyMenu_GetInputMode");
static_assert(sizeof(OdyMenu_GetInputMode) == 0x000001, "Wrong size on OdyMenu_GetInputMode");
static_assert(offsetof(OdyMenu_GetInputMode, ReturnValue) == 0x000000, "Member 'OdyMenu_GetInputMode::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyMenu.GetModalPriority
// 0x0001 (0x0001 - 0x0000)
struct OdyMenu_GetModalPriority final
{
public:
	EOdyModalPriority                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenu_GetModalPriority) == 0x000001, "Wrong alignment on OdyMenu_GetModalPriority");
static_assert(sizeof(OdyMenu_GetModalPriority) == 0x000001, "Wrong size on OdyMenu_GetModalPriority");
static_assert(offsetof(OdyMenu_GetModalPriority, ReturnValue) == 0x000000, "Member 'OdyMenu_GetModalPriority::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyDeferredPainter.SetEnableDeferPaint
// 0x0001 (0x0001 - 0x0000)
struct OdyDeferredPainter_SetEnableDeferPaint final
{
public:
	bool                                          bInEnableDeferPaint;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyDeferredPainter_SetEnableDeferPaint) == 0x000001, "Wrong alignment on OdyDeferredPainter_SetEnableDeferPaint");
static_assert(sizeof(OdyDeferredPainter_SetEnableDeferPaint) == 0x000001, "Wrong size on OdyDeferredPainter_SetEnableDeferPaint");
static_assert(offsetof(OdyDeferredPainter_SetEnableDeferPaint, bInEnableDeferPaint) == 0x000000, "Member 'OdyDeferredPainter_SetEnableDeferPaint::bInEnableDeferPaint' has a wrong offset!");

// Function OdyUI.OdyDeferredPainter.GetEnableDeferPaint
// 0x0001 (0x0001 - 0x0000)
struct OdyDeferredPainter_GetEnableDeferPaint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyDeferredPainter_GetEnableDeferPaint) == 0x000001, "Wrong alignment on OdyDeferredPainter_GetEnableDeferPaint");
static_assert(sizeof(OdyDeferredPainter_GetEnableDeferPaint) == 0x000001, "Wrong size on OdyDeferredPainter_GetEnableDeferPaint");
static_assert(offsetof(OdyDeferredPainter_GetEnableDeferPaint, ReturnValue) == 0x000000, "Member 'OdyDeferredPainter_GetEnableDeferPaint::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyEnhancedInputPlatformData.UpdateMappingContextRedirects
// 0x0001 (0x0001 - 0x0000)
struct OdyEnhancedInputPlatformData_UpdateMappingContextRedirects final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyEnhancedInputPlatformData_UpdateMappingContextRedirects) == 0x000001, "Wrong alignment on OdyEnhancedInputPlatformData_UpdateMappingContextRedirects");
static_assert(sizeof(OdyEnhancedInputPlatformData_UpdateMappingContextRedirects) == 0x000001, "Wrong size on OdyEnhancedInputPlatformData_UpdateMappingContextRedirects");
static_assert(offsetof(OdyEnhancedInputPlatformData_UpdateMappingContextRedirects, bEnable) == 0x000000, "Member 'OdyEnhancedInputPlatformData_UpdateMappingContextRedirects::bEnable' has a wrong offset!");

// Function OdyUI.OdyHUD.GetUIRouter
// 0x0008 (0x0008 - 0x0000)
struct OdyHUD_GetUIRouter final
{
public:
	class UOdyUIRouter*                           ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyHUD_GetUIRouter) == 0x000008, "Wrong alignment on OdyHUD_GetUIRouter");
static_assert(sizeof(OdyHUD_GetUIRouter) == 0x000008, "Wrong size on OdyHUD_GetUIRouter");
static_assert(offsetof(OdyHUD_GetUIRouter, ReturnValue) == 0x000000, "Member 'OdyHUD_GetUIRouter::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyInputRichTextBlockDecorator.OnInputDeviceChanged
// 0x0008 (0x0008 - 0x0000)
struct OdyInputRichTextBlockDecorator_OnInputDeviceChanged final
{
public:
	struct FGameplayTag                           InputDeviceTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyInputRichTextBlockDecorator_OnInputDeviceChanged) == 0x000004, "Wrong alignment on OdyInputRichTextBlockDecorator_OnInputDeviceChanged");
static_assert(sizeof(OdyInputRichTextBlockDecorator_OnInputDeviceChanged) == 0x000008, "Wrong size on OdyInputRichTextBlockDecorator_OnInputDeviceChanged");
static_assert(offsetof(OdyInputRichTextBlockDecorator_OnInputDeviceChanged, InputDeviceTag) == 0x000000, "Member 'OdyInputRichTextBlockDecorator_OnInputDeviceChanged::InputDeviceTag' has a wrong offset!");

// Function OdyUI.OdyListView.SetEntryWidgetClass
// 0x0008 (0x0008 - 0x0000)
struct OdyListView_SetEntryWidgetClass final
{
public:
	TSubclassOf<class UUserWidget>                InEntryWidgetClass;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyListView_SetEntryWidgetClass) == 0x000008, "Wrong alignment on OdyListView_SetEntryWidgetClass");
static_assert(sizeof(OdyListView_SetEntryWidgetClass) == 0x000008, "Wrong size on OdyListView_SetEntryWidgetClass");
static_assert(offsetof(OdyListView_SetEntryWidgetClass, InEntryWidgetClass) == 0x000000, "Member 'OdyListView_SetEntryWidgetClass::InEntryWidgetClass' has a wrong offset!");

// Function OdyUI.OdyMenuData.GetMenuClass
// 0x0030 (0x0030 - 0x0000)
struct OdyMenuData_GetMenuClass final
{
public:
	EPlatformType                                 Platform;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyMenuData_GetMenuClass) == 0x000008, "Wrong alignment on OdyMenuData_GetMenuClass");
static_assert(sizeof(OdyMenuData_GetMenuClass) == 0x000030, "Wrong size on OdyMenuData_GetMenuClass");
static_assert(offsetof(OdyMenuData_GetMenuClass, Platform) == 0x000000, "Member 'OdyMenuData_GetMenuClass::Platform' has a wrong offset!");
static_assert(offsetof(OdyMenuData_GetMenuClass, ReturnValue) == 0x000008, "Member 'OdyMenuData_GetMenuClass::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyNavCheckbox.SetGroupId
// 0x0008 (0x0008 - 0x0000)
struct OdyNavCheckbox_SetGroupId final
{
public:
	class FName                                   InGroupId;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyNavCheckbox_SetGroupId) == 0x000004, "Wrong alignment on OdyNavCheckbox_SetGroupId");
static_assert(sizeof(OdyNavCheckbox_SetGroupId) == 0x000008, "Wrong size on OdyNavCheckbox_SetGroupId");
static_assert(offsetof(OdyNavCheckbox_SetGroupId, InGroupId) == 0x000000, "Member 'OdyNavCheckbox_SetGroupId::InGroupId' has a wrong offset!");

// Function OdyUI.OdyNavCheckbox.SetIsCheckedWithCallback
// 0x0002 (0x0002 - 0x0000)
struct OdyNavCheckbox_SetIsCheckedWithCallback final
{
public:
	bool                                          InIsChecked;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowNavigate;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyNavCheckbox_SetIsCheckedWithCallback) == 0x000001, "Wrong alignment on OdyNavCheckbox_SetIsCheckedWithCallback");
static_assert(sizeof(OdyNavCheckbox_SetIsCheckedWithCallback) == 0x000002, "Wrong size on OdyNavCheckbox_SetIsCheckedWithCallback");
static_assert(offsetof(OdyNavCheckbox_SetIsCheckedWithCallback, InIsChecked) == 0x000000, "Member 'OdyNavCheckbox_SetIsCheckedWithCallback::InIsChecked' has a wrong offset!");
static_assert(offsetof(OdyNavCheckbox_SetIsCheckedWithCallback, bAllowNavigate) == 0x000001, "Member 'OdyNavCheckbox_SetIsCheckedWithCallback::bAllowNavigate' has a wrong offset!");

// Function OdyUI.OdySpringStatics.AdvanceSpringFloat
// 0x0040 (0x0040 - 0x0000)
struct OdySpringStatics_AdvanceSpringFloat final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOdySpringConfiguration                SpringConfiguration;                               // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FOdySpringStateFloat                   SpringState;                                       // 0x001C(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         From;                                              // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         To;                                                // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdySpringStatics_AdvanceSpringFloat) == 0x000004, "Wrong alignment on OdySpringStatics_AdvanceSpringFloat");
static_assert(sizeof(OdySpringStatics_AdvanceSpringFloat) == 0x000040, "Wrong size on OdySpringStatics_AdvanceSpringFloat");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloat, DeltaTime) == 0x000000, "Member 'OdySpringStatics_AdvanceSpringFloat::DeltaTime' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloat, SpringConfiguration) == 0x000004, "Member 'OdySpringStatics_AdvanceSpringFloat::SpringConfiguration' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloat, SpringState) == 0x00001C, "Member 'OdySpringStatics_AdvanceSpringFloat::SpringState' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloat, From) == 0x000034, "Member 'OdySpringStatics_AdvanceSpringFloat::From' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloat, To) == 0x000038, "Member 'OdySpringStatics_AdvanceSpringFloat::To' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloat, ReturnValue) == 0x00003C, "Member 'OdySpringStatics_AdvanceSpringFloat::ReturnValue' has a wrong offset!");

// Function OdyUI.OdySpringStatics.AdvanceSpringFloatAngle
// 0x0040 (0x0040 - 0x0000)
struct OdySpringStatics_AdvanceSpringFloatAngle final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOdySpringConfiguration                SpringConfiguration;                               // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FOdySpringStateFloat                   SpringState;                                       // 0x001C(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         From;                                              // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         To;                                                // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdySpringStatics_AdvanceSpringFloatAngle) == 0x000004, "Wrong alignment on OdySpringStatics_AdvanceSpringFloatAngle");
static_assert(sizeof(OdySpringStatics_AdvanceSpringFloatAngle) == 0x000040, "Wrong size on OdySpringStatics_AdvanceSpringFloatAngle");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloatAngle, DeltaTime) == 0x000000, "Member 'OdySpringStatics_AdvanceSpringFloatAngle::DeltaTime' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloatAngle, SpringConfiguration) == 0x000004, "Member 'OdySpringStatics_AdvanceSpringFloatAngle::SpringConfiguration' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloatAngle, SpringState) == 0x00001C, "Member 'OdySpringStatics_AdvanceSpringFloatAngle::SpringState' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloatAngle, From) == 0x000034, "Member 'OdySpringStatics_AdvanceSpringFloatAngle::From' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloatAngle, To) == 0x000038, "Member 'OdySpringStatics_AdvanceSpringFloatAngle::To' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringFloatAngle, ReturnValue) == 0x00003C, "Member 'OdySpringStatics_AdvanceSpringFloatAngle::ReturnValue' has a wrong offset!");

// Function OdyUI.OdySpringStatics.AdvanceSpringRotator
// 0x00B0 (0x00B0 - 0x0000)
struct OdySpringStatics_AdvanceSpringRotator final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOdySpringConfiguration                SpringConfiguration;                               // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FOdySpringStateRotator                 SpringState;                                       // 0x001C(0x0048)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               From;                                              // 0x0068(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               To;                                                // 0x0080(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0098(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdySpringStatics_AdvanceSpringRotator) == 0x000008, "Wrong alignment on OdySpringStatics_AdvanceSpringRotator");
static_assert(sizeof(OdySpringStatics_AdvanceSpringRotator) == 0x0000B0, "Wrong size on OdySpringStatics_AdvanceSpringRotator");
static_assert(offsetof(OdySpringStatics_AdvanceSpringRotator, DeltaTime) == 0x000000, "Member 'OdySpringStatics_AdvanceSpringRotator::DeltaTime' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringRotator, SpringConfiguration) == 0x000004, "Member 'OdySpringStatics_AdvanceSpringRotator::SpringConfiguration' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringRotator, SpringState) == 0x00001C, "Member 'OdySpringStatics_AdvanceSpringRotator::SpringState' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringRotator, From) == 0x000068, "Member 'OdySpringStatics_AdvanceSpringRotator::From' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringRotator, To) == 0x000080, "Member 'OdySpringStatics_AdvanceSpringRotator::To' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringRotator, ReturnValue) == 0x000098, "Member 'OdySpringStatics_AdvanceSpringRotator::ReturnValue' has a wrong offset!");

// Function OdyUI.OdySpringStatics.AdvanceSpringVector
// 0x00B0 (0x00B0 - 0x0000)
struct OdySpringStatics_AdvanceSpringVector final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOdySpringConfiguration                SpringConfiguration;                               // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FOdySpringStateVector                  SpringState;                                       // 0x001C(0x0048)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                From;                                              // 0x0068(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                To;                                                // 0x0080(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0098(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdySpringStatics_AdvanceSpringVector) == 0x000008, "Wrong alignment on OdySpringStatics_AdvanceSpringVector");
static_assert(sizeof(OdySpringStatics_AdvanceSpringVector) == 0x0000B0, "Wrong size on OdySpringStatics_AdvanceSpringVector");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector, DeltaTime) == 0x000000, "Member 'OdySpringStatics_AdvanceSpringVector::DeltaTime' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector, SpringConfiguration) == 0x000004, "Member 'OdySpringStatics_AdvanceSpringVector::SpringConfiguration' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector, SpringState) == 0x00001C, "Member 'OdySpringStatics_AdvanceSpringVector::SpringState' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector, From) == 0x000068, "Member 'OdySpringStatics_AdvanceSpringVector::From' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector, To) == 0x000080, "Member 'OdySpringStatics_AdvanceSpringVector::To' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector, ReturnValue) == 0x000098, "Member 'OdySpringStatics_AdvanceSpringVector::ReturnValue' has a wrong offset!");

// Function OdyUI.OdySpringStatics.AdvanceSpringVector2D
// 0x0080 (0x0080 - 0x0000)
struct OdySpringStatics_AdvanceSpringVector2D final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOdySpringConfiguration                SpringConfiguration;                               // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FOdySpringStateVector2D                SpringState;                                       // 0x001C(0x0030)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              From;                                              // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              To;                                                // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdySpringStatics_AdvanceSpringVector2D) == 0x000008, "Wrong alignment on OdySpringStatics_AdvanceSpringVector2D");
static_assert(sizeof(OdySpringStatics_AdvanceSpringVector2D) == 0x000080, "Wrong size on OdySpringStatics_AdvanceSpringVector2D");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector2D, DeltaTime) == 0x000000, "Member 'OdySpringStatics_AdvanceSpringVector2D::DeltaTime' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector2D, SpringConfiguration) == 0x000004, "Member 'OdySpringStatics_AdvanceSpringVector2D::SpringConfiguration' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector2D, SpringState) == 0x00001C, "Member 'OdySpringStatics_AdvanceSpringVector2D::SpringState' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector2D, From) == 0x000050, "Member 'OdySpringStatics_AdvanceSpringVector2D::From' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector2D, To) == 0x000060, "Member 'OdySpringStatics_AdvanceSpringVector2D::To' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_AdvanceSpringVector2D, ReturnValue) == 0x000070, "Member 'OdySpringStatics_AdvanceSpringVector2D::ReturnValue' has a wrong offset!");

// Function OdyUI.OdySpringStatics.GetSpringPreset
// 0x001C (0x001C - 0x0000)
struct OdySpringStatics_GetSpringPreset final
{
public:
	EOdySpringPreset                              Preset;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOdySpringConfiguration                ReturnValue;                                       // 0x0004(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdySpringStatics_GetSpringPreset) == 0x000004, "Wrong alignment on OdySpringStatics_GetSpringPreset");
static_assert(sizeof(OdySpringStatics_GetSpringPreset) == 0x00001C, "Wrong size on OdySpringStatics_GetSpringPreset");
static_assert(offsetof(OdySpringStatics_GetSpringPreset, Preset) == 0x000000, "Member 'OdySpringStatics_GetSpringPreset::Preset' has a wrong offset!");
static_assert(offsetof(OdySpringStatics_GetSpringPreset, ReturnValue) == 0x000004, "Member 'OdySpringStatics_GetSpringPreset::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyTextBlock.SetWrapTextAt
// 0x0004 (0x0004 - 0x0000)
struct OdyTextBlock_SetWrapTextAt final
{
public:
	float                                         InWrapTextAt;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyTextBlock_SetWrapTextAt) == 0x000004, "Wrong alignment on OdyTextBlock_SetWrapTextAt");
static_assert(sizeof(OdyTextBlock_SetWrapTextAt) == 0x000004, "Wrong size on OdyTextBlock_SetWrapTextAt");
static_assert(offsetof(OdyTextBlock_SetWrapTextAt, InWrapTextAt) == 0x000000, "Member 'OdyTextBlock_SetWrapTextAt::InWrapTextAt' has a wrong offset!");

// Function OdyUI.OdyTileView.SetEntryWidgetClass
// 0x0008 (0x0008 - 0x0000)
struct OdyTileView_SetEntryWidgetClass final
{
public:
	TSubclassOf<class UUserWidget>                InEntryWidgetClass;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyTileView_SetEntryWidgetClass) == 0x000008, "Wrong alignment on OdyTileView_SetEntryWidgetClass");
static_assert(sizeof(OdyTileView_SetEntryWidgetClass) == 0x000008, "Wrong size on OdyTileView_SetEntryWidgetClass");
static_assert(offsetof(OdyTileView_SetEntryWidgetClass, InEntryWidgetClass) == 0x000000, "Member 'OdyTileView_SetEntryWidgetClass::InEntryWidgetClass' has a wrong offset!");

// Function OdyUI.OdyUIBoolBindingFunctionLibrary.BoolBinding_AddDelegate
// 0x0038 (0x0038 - 0x0000)
struct OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate final
{
public:
	struct FOdyUIBoolBinding                      BoolBinding;                                       // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(bool OldValue, bool NewValue)> Delegate;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExecuteNow;                                       // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate) == 0x000008, "Wrong alignment on OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate");
static_assert(sizeof(OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate) == 0x000038, "Wrong size on OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate, BoolBinding) == 0x000000, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate::BoolBinding' has a wrong offset!");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate, Delegate) == 0x000020, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate::Delegate' has a wrong offset!");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate, bExecuteNow) == 0x000030, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_AddDelegate::bExecuteNow' has a wrong offset!");

// Function OdyUI.OdyUIBoolBindingFunctionLibrary.BoolBinding_BindWidgetIsEnabled
// 0x0030 (0x0030 - 0x0000)
struct OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled final
{
public:
	struct FOdyUIBoolBinding                      BoolBinding;                                       // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UWidget*                                Widget;                                            // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled) == 0x000008, "Wrong alignment on OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled");
static_assert(sizeof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled) == 0x000030, "Wrong size on OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled, BoolBinding) == 0x000000, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled::BoolBinding' has a wrong offset!");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled, Widget) == 0x000020, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled::Widget' has a wrong offset!");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled, bInvert) == 0x000028, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetIsEnabled::bInvert' has a wrong offset!");

// Function OdyUI.OdyUIBoolBindingFunctionLibrary.BoolBinding_BindWidgetVisibility
// 0x0030 (0x0030 - 0x0000)
struct OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility final
{
public:
	struct FOdyUIBoolBinding                      BoolBinding;                                       // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UWidget*                                Widget;                                            // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              FalseVisibility;                                   // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              TrueVisibility;                                    // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility) == 0x000008, "Wrong alignment on OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility");
static_assert(sizeof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility) == 0x000030, "Wrong size on OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility, BoolBinding) == 0x000000, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility::BoolBinding' has a wrong offset!");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility, Widget) == 0x000020, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility::Widget' has a wrong offset!");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility, FalseVisibility) == 0x000028, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility::FalseVisibility' has a wrong offset!");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility, TrueVisibility) == 0x000029, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_BindWidgetVisibility::TrueVisibility' has a wrong offset!");

// Function OdyUI.OdyUIBoolBindingFunctionLibrary.BoolBinding_GetValue
// 0x0028 (0x0028 - 0x0000)
struct OdyUIBoolBindingFunctionLibrary_BoolBinding_GetValue final
{
public:
	struct FOdyUIBoolBinding                      BoolBinding;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OdyUIBoolBindingFunctionLibrary_BoolBinding_GetValue) == 0x000008, "Wrong alignment on OdyUIBoolBindingFunctionLibrary_BoolBinding_GetValue");
static_assert(sizeof(OdyUIBoolBindingFunctionLibrary_BoolBinding_GetValue) == 0x000028, "Wrong size on OdyUIBoolBindingFunctionLibrary_BoolBinding_GetValue");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_GetValue, BoolBinding) == 0x000000, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_GetValue::BoolBinding' has a wrong offset!");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_GetValue, ReturnValue) == 0x000020, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_GetValue::ReturnValue' has a wrong offset!");

// Function OdyUI.OdyUIBoolBindingFunctionLibrary.BoolBinding_RemoveDelegate
// 0x0030 (0x0030 - 0x0000)
struct OdyUIBoolBindingFunctionLibrary_BoolBinding_RemoveDelegate final
{
public:
	struct FOdyUIBoolBinding                      BoolBinding;                                       // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(bool OldValue, bool NewValue)> Delegate;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OdyUIBoolBindingFunctionLibrary_BoolBinding_RemoveDelegate) == 0x000008, "Wrong alignment on OdyUIBoolBindingFunctionLibrary_BoolBinding_RemoveDelegate");
static_assert(sizeof(OdyUIBoolBindingFunctionLibrary_BoolBinding_RemoveDelegate) == 0x000030, "Wrong size on OdyUIBoolBindingFunctionLibrary_BoolBinding_RemoveDelegate");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_RemoveDelegate, BoolBinding) == 0x000000, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_RemoveDelegate::BoolBinding' has a wrong offset!");
static_assert(offsetof(OdyUIBoolBindingFunctionLibrary_BoolBinding_RemoveDelegate, Delegate) == 0x000020, "Member 'OdyUIBoolBindingFunctionLibrary_BoolBinding_RemoveDelegate::Delegate' has a wrong offset!");

// Function OdyUI.OdyUIBoolBindingFunctionLibrary.BoolBinding_SetValue
// 0x0028 (0x0028 - 0x0000)
struct OdyUIBoolBindingFunctionLibrary_BoolBinding_SetValue final
{
public:
	struct FOdyUIBoolBinding                      BoolBinding;                                       // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
