#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OdyWwise

#include "Basic.hpp"

#include "OdyWwise_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// Class OdyWwise.OdyWwiseEngineSubsystem
// 0x0010 (0x0040 - 0x0030)
class UOdyWwiseEngineSubsystem final : public UEngineSubsystem
{
public:
	TArray<struct FAkPlayData>                    TrackedPlayIds;                                    // 0x0030(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OdyWwiseEngineSubsystem">();
	}
	static class UOdyWwiseEngineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOdyWwiseEngineSubsystem>();
	}
};
static_assert(alignof(UOdyWwiseEngineSubsystem) == 0x000008, "Wrong alignment on UOdyWwiseEngineSubsystem");
static_assert(sizeof(UOdyWwiseEngineSubsystem) == 0x000040, "Wrong size on UOdyWwiseEngineSubsystem");
static_assert(offsetof(UOdyWwiseEngineSubsystem, TrackedPlayIds) == 0x000030, "Member 'UOdyWwiseEngineSubsystem::TrackedPlayIds' has a wrong offset!");

// Class OdyWwise.OdyWwiseGameplayStatics
// 0x0000 (0x0028 - 0x0028)
class UOdyWwiseGameplayStatics final : public UBlueprintFunctionLibrary
{
public:
	static void AddAkPlayData(class USceneComponent* SceneComponent, const class UAnimNotifyState* NotifyState, int32 PlayId, class UAkComponent* AudioComponent, class UAkAudioEvent* AudioEvent);
	static void AddWwiseDefaultListener(class APlayerController* Controller);
	static void ClearAkPlayData();
	static int32 ExecuteActionOnPlayingId(EAkActionOnEventType ActionType, int32 PlayingID, int32 TransitionDuration, EAkCurveInterpolation FadeCurve);
	static int32 GetAkPlayData(class USceneComponent* SceneComponent, const class UAnimNotifyState* NotifyState, struct FAkPlayData* OutAkPlayData);
	static int32 PopAkPlayData(class USceneComponent* SceneComponent, const class UAnimNotifyState* NotifyState, struct FAkPlayData* OutAkPlayData);
	static void RemoveWwiseDefaultListener(class APlayerController* Controller);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OdyWwiseGameplayStatics">();
	}
	static class UOdyWwiseGameplayStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOdyWwiseGameplayStatics>();
	}
};
static_assert(alignof(UOdyWwiseGameplayStatics) == 0x000008, "Wrong alignment on UOdyWwiseGameplayStatics");
static_assert(sizeof(UOdyWwiseGameplayStatics) == 0x000028, "Wrong size on UOdyWwiseGameplayStatics");

}

