#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_AiMi_NeutralSpecial_Empowered

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PE_AiMi_NeutralSpecial_Empowered.PE_AiMi_NeutralSpecial_Empowered_C
// 0x0020 (0x0638 - 0x0618)
class APE_AiMi_NeutralSpecial_Empowered_C final : public AMatchaProjectileEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       WorldCollision;                                    // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AMatchaSnapNetCharacterEntity*          OwnerEntity;                                       // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PE_AiMi_NeutralSpecial_Empowered(int32 EntryPoint);
	void OnProjectileHit(class AActor* HitActor, const struct FMatchaHitData& HitData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PE_AiMi_NeutralSpecial_Empowered_C">();
	}
	static class APE_AiMi_NeutralSpecial_Empowered_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APE_AiMi_NeutralSpecial_Empowered_C>();
	}
};
static_assert(alignof(APE_AiMi_NeutralSpecial_Empowered_C) == 0x000008, "Wrong alignment on APE_AiMi_NeutralSpecial_Empowered_C");
static_assert(sizeof(APE_AiMi_NeutralSpecial_Empowered_C) == 0x000638, "Wrong size on APE_AiMi_NeutralSpecial_Empowered_C");
static_assert(offsetof(APE_AiMi_NeutralSpecial_Empowered_C, UberGraphFrame) == 0x000618, "Member 'APE_AiMi_NeutralSpecial_Empowered_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APE_AiMi_NeutralSpecial_Empowered_C, Niagara) == 0x000620, "Member 'APE_AiMi_NeutralSpecial_Empowered_C::Niagara' has a wrong offset!");
static_assert(offsetof(APE_AiMi_NeutralSpecial_Empowered_C, WorldCollision) == 0x000628, "Member 'APE_AiMi_NeutralSpecial_Empowered_C::WorldCollision' has a wrong offset!");
static_assert(offsetof(APE_AiMi_NeutralSpecial_Empowered_C, OwnerEntity) == 0x000630, "Member 'APE_AiMi_NeutralSpecial_Empowered_C::OwnerEntity' has a wrong offset!");

}

