#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_Boot_DashDanceProjectile

#include "Basic.hpp"

#include "SnapNet_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PE_Boot_DashDanceProjectile.PE_Boot_DashDanceProjectile_C
// 0x0090 (0x06A8 - 0x0618)
class APE_Boot_DashDanceProjectile_C final : public AMatchaProjectileEntity
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          WorldCollision;                                    // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSnapNetPropertyVector                 RootScale;                                         // 0x0628(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PE_Boot_DashDanceProjectile_C">();
	}
	static class APE_Boot_DashDanceProjectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APE_Boot_DashDanceProjectile_C>();
	}
};
static_assert(alignof(APE_Boot_DashDanceProjectile_C) == 0x000008, "Wrong alignment on APE_Boot_DashDanceProjectile_C");
static_assert(sizeof(APE_Boot_DashDanceProjectile_C) == 0x0006A8, "Wrong size on APE_Boot_DashDanceProjectile_C");
static_assert(offsetof(APE_Boot_DashDanceProjectile_C, Niagara) == 0x000618, "Member 'APE_Boot_DashDanceProjectile_C::Niagara' has a wrong offset!");
static_assert(offsetof(APE_Boot_DashDanceProjectile_C, WorldCollision) == 0x000620, "Member 'APE_Boot_DashDanceProjectile_C::WorldCollision' has a wrong offset!");
static_assert(offsetof(APE_Boot_DashDanceProjectile_C, RootScale) == 0x000628, "Member 'APE_Boot_DashDanceProjectile_C::RootScale' has a wrong offset!");

}

