#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_Item_ObscuraOrb

#include "Basic.hpp"

#include "PE_Item_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SnapNet_structs.hpp"
#include "Matcha_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PE_Item_ObscuraOrb.PE_Item_ObscuraOrb_C
// 0x00A8 (0x06D0 - 0x0628)
class APE_Item_ObscuraOrb_C final : public APE_Item_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          MidPhaseVerticalBox;                               // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          MidPhaseHorizontalBox;                             // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PhaseStartBox;                                     // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PhaseKOCheckerBox;                                 // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        LastOverlapStartTime;                              // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DidManualDetonate;                                 // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableState;                                       // 0x0659(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65A[0x2];                                      // 0x065A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastOverlapEntityTimeMS;                           // 0x065C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OwnerInstigatorPosOnEnd;                           // 0x0660(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaFXEvent*                         FXReference;                                       // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      KOObjTypes;                                        // 0x0680(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      TerrainObjTypes;                                   // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         IgnoreActors;                                      // 0x06A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         ForceDestroyTimeIfNoWallCollideMS;                 // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BeginPlayTimeInMS;                                 // 0x06B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSnapNetPropertyBoolean                StartedPhasing;                                    // 0x06B8(0x0018)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)

public:
	void CheckIfActorArrayContainsKOVolumes(TArray<class AActor*>& ActorArray, bool* FoundKOV);
	void CheckIfActorArrayContainsNonPhaseStartActors(TArray<class AActor*>& Array, bool* ShouldStartPhasing);
	void CheckIfKOCheckerFoundNearbyKOBOXes(bool* FoundKOVOrInTerrain);
	void CheckIfValidTPPosition(bool* InsideWorld);
	void ExecuteUbergraph_PE_Item_ObscuraOrb(int32 EntryPoint);
	TArray<class AActor*> FindTargetsOnExplode(const class AActor* TargetHit);
	void OnEnabledChanged(bool bOldEnabled, bool bNewEnabled);
	void OnProjectileExplosion(class AActor* TargetHit);
	void OnSpawnFinished();
	void ReceiveTick(float DeltaSeconds);
	void TeleportPlayers(const class AActor* TargetHit);
	void TravelDirectionTerrainTraceCheck(bool* VelocityTraceHitTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PE_Item_ObscuraOrb_C">();
	}
	static class APE_Item_ObscuraOrb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APE_Item_ObscuraOrb_C>();
	}
};
static_assert(alignof(APE_Item_ObscuraOrb_C) == 0x000008, "Wrong alignment on APE_Item_ObscuraOrb_C");
static_assert(sizeof(APE_Item_ObscuraOrb_C) == 0x0006D0, "Wrong size on APE_Item_ObscuraOrb_C");
static_assert(offsetof(APE_Item_ObscuraOrb_C, UberGraphFrame) == 0x000628, "Member 'APE_Item_ObscuraOrb_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, MidPhaseVerticalBox) == 0x000630, "Member 'APE_Item_ObscuraOrb_C::MidPhaseVerticalBox' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, MidPhaseHorizontalBox) == 0x000638, "Member 'APE_Item_ObscuraOrb_C::MidPhaseHorizontalBox' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, PhaseStartBox) == 0x000640, "Member 'APE_Item_ObscuraOrb_C::PhaseStartBox' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, PhaseKOCheckerBox) == 0x000648, "Member 'APE_Item_ObscuraOrb_C::PhaseKOCheckerBox' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, LastOverlapStartTime) == 0x000650, "Member 'APE_Item_ObscuraOrb_C::LastOverlapStartTime' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, DidManualDetonate) == 0x000658, "Member 'APE_Item_ObscuraOrb_C::DidManualDetonate' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, EnableState) == 0x000659, "Member 'APE_Item_ObscuraOrb_C::EnableState' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, LastOverlapEntityTimeMS) == 0x00065C, "Member 'APE_Item_ObscuraOrb_C::LastOverlapEntityTimeMS' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, OwnerInstigatorPosOnEnd) == 0x000660, "Member 'APE_Item_ObscuraOrb_C::OwnerInstigatorPosOnEnd' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, FXReference) == 0x000678, "Member 'APE_Item_ObscuraOrb_C::FXReference' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, KOObjTypes) == 0x000680, "Member 'APE_Item_ObscuraOrb_C::KOObjTypes' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, TerrainObjTypes) == 0x000690, "Member 'APE_Item_ObscuraOrb_C::TerrainObjTypes' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, IgnoreActors) == 0x0006A0, "Member 'APE_Item_ObscuraOrb_C::IgnoreActors' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, ForceDestroyTimeIfNoWallCollideMS) == 0x0006B0, "Member 'APE_Item_ObscuraOrb_C::ForceDestroyTimeIfNoWallCollideMS' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, BeginPlayTimeInMS) == 0x0006B4, "Member 'APE_Item_ObscuraOrb_C::BeginPlayTimeInMS' has a wrong offset!");
static_assert(offsetof(APE_Item_ObscuraOrb_C, StartedPhasing) == 0x0006B8, "Member 'APE_Item_ObscuraOrb_C::StartedPhasing' has a wrong offset!");

}

