#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_Item_AOE_TaserShot

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function PE_Item_AOE_TaserShot.PE_Item_AOE_TaserShot_C.ExecuteUbergraph_PE_Item_AOE_TaserShot
// 0x0098 (0x0098 - 0x0000)
struct PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCombinedFXInfo                        K2Node_MakeStruct_CombinedFXInfo;                  // 0x0008(0x0088)(NoDestructor)
	class AActor*                                 CallFunc_GetOwnerEntity_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot) == 0x000008, "Wrong alignment on PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot");
static_assert(sizeof(PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot) == 0x000098, "Wrong size on PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot");
static_assert(offsetof(PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot, EntryPoint) == 0x000000, "Member 'PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot::EntryPoint' has a wrong offset!");
static_assert(offsetof(PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot, K2Node_MakeStruct_CombinedFXInfo) == 0x000008, "Member 'PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot::K2Node_MakeStruct_CombinedFXInfo' has a wrong offset!");
static_assert(offsetof(PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot, CallFunc_GetOwnerEntity_ReturnValue) == 0x000090, "Member 'PE_Item_AOE_TaserShot_C_ExecuteUbergraph_PE_Item_AOE_TaserShot::CallFunc_GetOwnerEntity_ReturnValue' has a wrong offset!");

}

