#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_Item_AOE_TaserShot

#include "Basic.hpp"

#include "PE_Item_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PE_Item_AOE_TaserShot.PE_Item_AOE_TaserShot_C
// 0x0028 (0x0650 - 0x0628)
class APE_Item_AOE_TaserShot_C final : public APE_Item_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak_Slowball;                                       // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayedSound;                                       // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PE_Item_AOE_TaserShot(int32 EntryPoint);
	void OnSpawnFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PE_Item_AOE_TaserShot_C">();
	}
	static class APE_Item_AOE_TaserShot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APE_Item_AOE_TaserShot_C>();
	}
};
static_assert(alignof(APE_Item_AOE_TaserShot_C) == 0x000008, "Wrong alignment on APE_Item_AOE_TaserShot_C");
static_assert(sizeof(APE_Item_AOE_TaserShot_C) == 0x000650, "Wrong size on APE_Item_AOE_TaserShot_C");
static_assert(offsetof(APE_Item_AOE_TaserShot_C, UberGraphFrame) == 0x000628, "Member 'APE_Item_AOE_TaserShot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APE_Item_AOE_TaserShot_C, Ak_Slowball) == 0x000630, "Member 'APE_Item_AOE_TaserShot_C::Ak_Slowball' has a wrong offset!");
static_assert(offsetof(APE_Item_AOE_TaserShot_C, Sphere) == 0x000638, "Member 'APE_Item_AOE_TaserShot_C::Sphere' has a wrong offset!");
static_assert(offsetof(APE_Item_AOE_TaserShot_C, Niagara) == 0x000640, "Member 'APE_Item_AOE_TaserShot_C::Niagara' has a wrong offset!");
static_assert(offsetof(APE_Item_AOE_TaserShot_C, PlayedSound) == 0x000648, "Member 'APE_Item_AOE_TaserShot_C::PlayedSound' has a wrong offset!");

}

