#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_Item_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function PE_Item_Base.PE_Item_Base_C.GetInventoryComponent
// 0x0008 (0x0008 - 0x0000)
struct PE_Item_Base_C_GetInventoryComponent final
{
public:
	class UMatchaInventoryComponent*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PE_Item_Base_C_GetInventoryComponent) == 0x000008, "Wrong alignment on PE_Item_Base_C_GetInventoryComponent");
static_assert(sizeof(PE_Item_Base_C_GetInventoryComponent) == 0x000008, "Wrong size on PE_Item_Base_C_GetInventoryComponent");
static_assert(offsetof(PE_Item_Base_C_GetInventoryComponent, ReturnValue) == 0x000000, "Member 'PE_Item_Base_C_GetInventoryComponent::ReturnValue' has a wrong offset!");

// Function PE_Item_Base.PE_Item_Base_C.GetItem
// 0x0118 (0x0118 - 0x0000)
struct PE_Item_Base_C_GetItem final
{
public:
	class UMatchaItemAsset*                       Item;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FMatchaInventorySlot                   CallFunc_GetItemInSlot_ReturnValue;                // 0x0010(0x0100)(ConstParm)
	const class UMatchaItemAsset*                 CallFunc_GetValue_ItemAsset_ReturnValue;           // 0x0110(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PE_Item_Base_C_GetItem) == 0x000008, "Wrong alignment on PE_Item_Base_C_GetItem");
static_assert(sizeof(PE_Item_Base_C_GetItem) == 0x000118, "Wrong size on PE_Item_Base_C_GetItem");
static_assert(offsetof(PE_Item_Base_C_GetItem, Item) == 0x000000, "Member 'PE_Item_Base_C_GetItem::Item' has a wrong offset!");
static_assert(offsetof(PE_Item_Base_C_GetItem, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000008, "Member 'PE_Item_Base_C_GetItem::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_Base_C_GetItem, CallFunc_GetItemInSlot_ReturnValue) == 0x000010, "Member 'PE_Item_Base_C_GetItem::CallFunc_GetItemInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_Base_C_GetItem, CallFunc_GetValue_ItemAsset_ReturnValue) == 0x000110, "Member 'PE_Item_Base_C_GetItem::CallFunc_GetValue_ItemAsset_ReturnValue' has a wrong offset!");

}

