#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_Item_ObscuraOrb

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Matcha_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PE_Item_ObscuraOrb.PE_Item_ObscuraOrb_C.CheckIfActorArrayContainsKOVolumes
// 0x0078 (0x0078 - 0x0000)
struct PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes final
{
public:
	TArray<class AActor*>                         ActorArray;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          FoundKOV;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AE_GlitchCloudDamageVolume_C*           K2Node_DynamicCast_AsE_Glitch_Cloud_Damage_Volume; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AE_KOVolumeAlways_Base_C*               K2Node_DynamicCast_AsE_KO_Volume_Always_Base;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AE_KOVolumeThreshold_Base_C*            K2Node_DynamicCast_AsE_KO_Volume_Threshold_Base;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_FindComponentByTag_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_FindComponentByTag_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes) == 0x000008, "Wrong alignment on PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes");
static_assert(sizeof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes) == 0x000078, "Wrong size on PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, ActorArray) == 0x000000, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::ActorArray' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, FoundKOV) == 0x000010, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::FoundKOV' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, Temp_int_Array_Index_Variable) == 0x000018, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_Array_Get_Item) == 0x000020, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, K2Node_DynamicCast_AsE_Glitch_Cloud_Damage_Volume) == 0x000028, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::K2Node_DynamicCast_AsE_Glitch_Cloud_Damage_Volume' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, K2Node_DynamicCast_AsE_KO_Volume_Always_Base) == 0x000038, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::K2Node_DynamicCast_AsE_KO_Volume_Always_Base' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, K2Node_DynamicCast_AsE_KO_Volume_Threshold_Base) == 0x000048, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::K2Node_DynamicCast_AsE_KO_Volume_Threshold_Base' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_FindComponentByTag_ReturnValue) == 0x000058, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_FindComponentByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_FindComponentByTag_ReturnValue_1) == 0x000060, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_FindComponentByTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_Less_IntInt_ReturnValue) == 0x00006A, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_BooleanOR_ReturnValue) == 0x00006B, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_BooleanOR_ReturnValue_1) == 0x00006C, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_BooleanOR_ReturnValue_2) == 0x000074, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes, CallFunc_BooleanAND_ReturnValue) == 0x000075, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsKOVolumes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PE_Item_ObscuraOrb.PE_Item_ObscuraOrb_C.CheckIfActorArrayContainsNonPhaseStartActors
// 0x0060 (0x0060 - 0x0000)
struct PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors final
{
public:
	TArray<class AActor*>                         Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ShouldStartPhasing;                                // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchaAICharacterEntity*               K2Node_DynamicCast_AsMatcha_AI_Character_Entity;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaSnapNetInteractiveEntity*        K2Node_DynamicCast_AsMatcha_Snap_Net_Interactive_Entity; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatchaSnapNetCharacterEntity*          K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors) == 0x000008, "Wrong alignment on PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors");
static_assert(sizeof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors) == 0x000060, "Wrong size on PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, Array) == 0x000000, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::Array' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, ShouldStartPhasing) == 0x000010, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::ShouldStartPhasing' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, CallFunc_Array_Get_Item) == 0x000020, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, K2Node_DynamicCast_AsMatcha_AI_Character_Entity) == 0x000028, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::K2Node_DynamicCast_AsMatcha_AI_Character_Entity' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, K2Node_DynamicCast_AsMatcha_Snap_Net_Interactive_Entity) == 0x000038, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::K2Node_DynamicCast_AsMatcha_Snap_Net_Interactive_Entity' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity) == 0x000048, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, CallFunc_BooleanOR_ReturnValue) == 0x000058, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, CallFunc_BooleanOR_ReturnValue_1) == 0x000059, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, CallFunc_Less_IntInt_ReturnValue) == 0x00005A, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'PE_Item_ObscuraOrb_C_CheckIfActorArrayContainsNonPhaseStartActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function PE_Item_ObscuraOrb.PE_Item_ObscuraOrb_C.CheckIfKOCheckerFoundNearbyKOBOXes
// 0x0088 (0x0088 - 0x0000)
struct PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes final
{
public:
	bool                                          FoundKOVOrInTerrain;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InTerrainStill;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnvCheckFound;                                     // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           IgnoreTag;                                         // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUnscaledBoxExtent_ReturnValue;         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfActorArrayContainsKOVolumes_FoundKOV; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes) == 0x000008, "Wrong alignment on PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes");
static_assert(sizeof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes) == 0x000088, "Wrong size on PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, FoundKOVOrInTerrain) == 0x000000, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::FoundKOVOrInTerrain' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, InTerrainStill) == 0x000001, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::InTerrainStill' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, EnvCheckFound) == 0x000002, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::EnvCheckFound' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, IgnoreTag) == 0x000008, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::IgnoreTag' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, K2Node_MakeArray_Array) == 0x000018, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, Temp_object_Variable) == 0x000028, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, CallFunc_GetUnscaledBoxExtent_ReturnValue) == 0x000058, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::CallFunc_GetUnscaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, CallFunc_BoxOverlapActors_OutActors) == 0x000070, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, CallFunc_BoxOverlapActors_ReturnValue) == 0x000080, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes, CallFunc_CheckIfActorArrayContainsKOVolumes_FoundKOV) == 0x000081, "Member 'PE_Item_ObscuraOrb_C_CheckIfKOCheckerFoundNearbyKOBOXes::CallFunc_CheckIfActorArrayContainsKOVolumes_FoundKOV' has a wrong offset!");

// Function PE_Item_ObscuraOrb.PE_Item_ObscuraOrb_C.CheckIfValidTPPosition
// 0x0A60 (0x0A60 - 0x0000)
struct PE_Item_ObscuraOrb_C_CheckIfValidTPPosition final
{
public:
	bool                                          InsideWorld;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WestCardinalCheckEndPoint;                         // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EastCardinalCheckEndPoint;                         // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SouthCardinalCheckEndPoint;                        // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NorthCardinalCheckEndPoint;                        // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             NewLocalVar_2;                                     // 0x0068(0x00F8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             NewLocalVar_1;                                     // 0x0160(0x00F8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             NewLocalVar_0;                                     // 0x0258(0x00F8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             NewLocalVar;                                       // 0x0350(0x00F8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          IsNotInsideTerrain;                                // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CardinalDistaceCheck;                              // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      ObjectType;                                        // 0x0458(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0468(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x04D8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0500(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0620(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x0648(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0741(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_742[0x6];                                      // 0x0742(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0748(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0778(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0790(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x07A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x07E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_3;                            // 0x07F8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0808(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_2;       // 0x0820(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_2;  // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_3;                          // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_3;       // 0x0940(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_3;  // 0x0A38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A39[0x7];                                      // 0x0A39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0A40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0A58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0A59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition) == 0x000008, "Wrong alignment on PE_Item_ObscuraOrb_C_CheckIfValidTPPosition");
static_assert(sizeof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition) == 0x000A60, "Wrong size on PE_Item_ObscuraOrb_C_CheckIfValidTPPosition");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, InsideWorld) == 0x000000, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::InsideWorld' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, WestCardinalCheckEndPoint) == 0x000008, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::WestCardinalCheckEndPoint' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, EastCardinalCheckEndPoint) == 0x000020, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::EastCardinalCheckEndPoint' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, SouthCardinalCheckEndPoint) == 0x000038, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::SouthCardinalCheckEndPoint' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, NorthCardinalCheckEndPoint) == 0x000050, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::NorthCardinalCheckEndPoint' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, NewLocalVar_2) == 0x000068, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::NewLocalVar_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, NewLocalVar_1) == 0x000160, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, NewLocalVar_0) == 0x000258, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, NewLocalVar) == 0x000350, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::NewLocalVar' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, IsNotInsideTerrain) == 0x000448, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::IsNotInsideTerrain' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CardinalDistaceCheck) == 0x000450, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CardinalDistaceCheck' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, ObjectType) == 0x000458, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::ObjectType' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, K2Node_MakeArray_Array) == 0x000468, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000478, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000490, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0004A8, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0004C0, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, Temp_object_Variable) == 0x0004D8, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0004E8, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000500, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0005F8, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_X) == 0x000600, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_Y) == 0x000608, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_Z) == 0x000610, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000618, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, Temp_object_Variable_1) == 0x000620, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_MakeVector_ReturnValue) == 0x000630, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x000648, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x000740, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BooleanAND_ReturnValue) == 0x000741, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x000748, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_X_1) == 0x000760, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_Y_1) == 0x000768, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_Z_1) == 0x000770, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, Temp_object_Variable_2) == 0x000778, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000788, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000790, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_MakeVector_ReturnValue_1) == 0x0007A8, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_X_2) == 0x0007C0, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_Y_2) == 0x0007C8, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_Z_2) == 0x0007D0, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0007D8, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_MakeVector_ReturnValue_2) == 0x0007E0, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, Temp_object_Variable_3) == 0x0007F8, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x000808, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_LineTraceSingleForObjects_OutHit_2) == 0x000820, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_LineTraceSingleForObjects_OutHit_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_LineTraceSingleForObjects_ReturnValue_2) == 0x000918, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_LineTraceSingleForObjects_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_X_3) == 0x000920, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_Y_3) == 0x000928, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BreakVector_Z_3) == 0x000930, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000938, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_LineTraceSingleForObjects_OutHit_3) == 0x000940, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_LineTraceSingleForObjects_OutHit_3' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_LineTraceSingleForObjects_ReturnValue_3) == 0x000A38, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_LineTraceSingleForObjects_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_MakeVector_ReturnValue_3) == 0x000A40, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BooleanAND_ReturnValue_1) == 0x000A58, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PE_Item_ObscuraOrb_C_CheckIfValidTPPosition, CallFunc_BooleanAND_ReturnValue_2) == 0x000A59, "Member 'PE_Item_ObscuraOrb_C_CheckIfValidTPPosition::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function PE_Item_ObscuraOrb.PE_Item_ObscuraOrb_C.ExecuteUbergraph_PE_Item_ObscuraOrb
// 0x0100 (0x0100 - 0x0000)
struct PE_Item_ObscuraOrb_C_ExecuteUbergraph_PE_Item_ObscuraOrb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TravelDirectionTerrainTraceCheck_VelocityTraceHitTarget; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentEntityTimeInMilliseconds_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOldEnabled;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewEnabled;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetUnscaledBoxExtent_ReturnValue;         // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentEntityTimeInMilliseconds_ReturnValue_1; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentEntityTimeInMilliseconds_ReturnValue_2; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfKOCheckerFoundNearbyKOBOXes_FoundKOVOrInTerrain; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TravelDirectionTerrainTraceCheck_VelocityTraceHitTarget_1; // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TravelDirectionTerrainTraceCheck_VelocityTraceHitTarget_2; // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_TargetHit;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerEntity_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerEntity_ReturnValue_1;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchaSnapNetCharacterEntity*          K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerEntity_ReturnValue_2;             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchaSnapNetCharacterEntity*          K2Node_DynamicCast_AsMatcha_Snap_Net_Character_Entity_1; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESnapNetWorldType                             CallFunc_GetSnapNetWorldType_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
