#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_Luna_EmpoweredNeutralSpecial

#include "Basic.hpp"

#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PE_Luna_EmpoweredNeutralSpecial.PE_Luna_EmpoweredNeutralSpecial_C
// 0x0018 (0x0630 - 0x0618)
class APE_Luna_EmpoweredNeutralSpecial_C final : public AMatchaProjectileEntity
{
public:
	class UNiagaraComponent*                      Niagara1;                                          // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ChaoticRocketeer_Default_Rocket;                // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       WorldCollision;                                    // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PE_Luna_EmpoweredNeutralSpecial_C">();
	}
	static class APE_Luna_EmpoweredNeutralSpecial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APE_Luna_EmpoweredNeutralSpecial_C>();
	}
};
static_assert(alignof(APE_Luna_EmpoweredNeutralSpecial_C) == 0x000008, "Wrong alignment on APE_Luna_EmpoweredNeutralSpecial_C");
static_assert(sizeof(APE_Luna_EmpoweredNeutralSpecial_C) == 0x000630, "Wrong size on APE_Luna_EmpoweredNeutralSpecial_C");
static_assert(offsetof(APE_Luna_EmpoweredNeutralSpecial_C, Niagara1) == 0x000618, "Member 'APE_Luna_EmpoweredNeutralSpecial_C::Niagara1' has a wrong offset!");
static_assert(offsetof(APE_Luna_EmpoweredNeutralSpecial_C, SM_ChaoticRocketeer_Default_Rocket) == 0x000620, "Member 'APE_Luna_EmpoweredNeutralSpecial_C::SM_ChaoticRocketeer_Default_Rocket' has a wrong offset!");
static_assert(offsetof(APE_Luna_EmpoweredNeutralSpecial_C, WorldCollision) == 0x000628, "Member 'APE_Luna_EmpoweredNeutralSpecial_C::WorldCollision' has a wrong offset!");

}

