#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_Luna_SideSpecial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PE_Luna_SideSpecial.PE_Luna_SideSpecial_C
// 0x0020 (0x0638 - 0x0618)
class APE_Luna_SideSpecial_C final : public AMatchaProjectileEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ChaoticRocketeer_Default_Rocket;                // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          WorldCollision;                                    // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PE_Luna_SideSpecial(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PE_Luna_SideSpecial_C">();
	}
	static class APE_Luna_SideSpecial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APE_Luna_SideSpecial_C>();
	}
};
static_assert(alignof(APE_Luna_SideSpecial_C) == 0x000008, "Wrong alignment on APE_Luna_SideSpecial_C");
static_assert(sizeof(APE_Luna_SideSpecial_C) == 0x000638, "Wrong size on APE_Luna_SideSpecial_C");
static_assert(offsetof(APE_Luna_SideSpecial_C, UberGraphFrame) == 0x000618, "Member 'APE_Luna_SideSpecial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APE_Luna_SideSpecial_C, Niagara) == 0x000620, "Member 'APE_Luna_SideSpecial_C::Niagara' has a wrong offset!");
static_assert(offsetof(APE_Luna_SideSpecial_C, SM_ChaoticRocketeer_Default_Rocket) == 0x000628, "Member 'APE_Luna_SideSpecial_C::SM_ChaoticRocketeer_Default_Rocket' has a wrong offset!");
static_assert(offsetof(APE_Luna_SideSpecial_C, WorldCollision) == 0x000630, "Member 'APE_Luna_SideSpecial_C::WorldCollision' has a wrong offset!");

}

