#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PE_Rune_NeutralSpecialEmpowered

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PE_Rune_NeutralSpecialEmpowered.PE_Rune_NeutralSpecialEmpowered_C
// 0x0018 (0x0630 - 0x0618)
class APE_Rune_NeutralSpecialEmpowered_C final : public AMatchaProjectileEntity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       WorldCollision;                                    // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PE_Rune_NeutralSpecialEmpowered(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PE_Rune_NeutralSpecialEmpowered_C">();
	}
	static class APE_Rune_NeutralSpecialEmpowered_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APE_Rune_NeutralSpecialEmpowered_C>();
	}
};
static_assert(alignof(APE_Rune_NeutralSpecialEmpowered_C) == 0x000008, "Wrong alignment on APE_Rune_NeutralSpecialEmpowered_C");
static_assert(sizeof(APE_Rune_NeutralSpecialEmpowered_C) == 0x000630, "Wrong size on APE_Rune_NeutralSpecialEmpowered_C");
static_assert(offsetof(APE_Rune_NeutralSpecialEmpowered_C, UberGraphFrame) == 0x000618, "Member 'APE_Rune_NeutralSpecialEmpowered_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APE_Rune_NeutralSpecialEmpowered_C, Niagara) == 0x000620, "Member 'APE_Rune_NeutralSpecialEmpowered_C::Niagara' has a wrong offset!");
static_assert(offsetof(APE_Rune_NeutralSpecialEmpowered_C, WorldCollision) == 0x000628, "Member 'APE_Rune_NeutralSpecialEmpowered_C::WorldCollision' has a wrong offset!");

}

