#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickup_Base

#include "Basic.hpp"

#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function Pickup_Base.Pickup_Base_C.ExecuteUbergraph_Pickup_Base
// 0x0020 (0x0020 - 0x0000)
struct Pickup_Base_C_ExecuteUbergraph_Pickup_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractingActor;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryPickUpBy_Success;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESnapNetWorldType                             CallFunc_GetSnapNetWorldType_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESnapNetWorldType                             CallFunc_SwitchSnapNetWorldType_WorldType;         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOldEnabled;                          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewEnabled;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base) == 0x000008, "Wrong alignment on Pickup_Base_C_ExecuteUbergraph_Pickup_Base");
static_assert(sizeof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base) == 0x000020, "Wrong size on Pickup_Base_C_ExecuteUbergraph_Pickup_Base");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, EntryPoint) == 0x000000, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, K2Node_Event_InteractingActor) == 0x000008, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::K2Node_Event_InteractingActor' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, CallFunc_TryPickUpBy_Success) == 0x000010, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::CallFunc_TryPickUpBy_Success' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, CallFunc_GetSnapNetWorldType_ReturnValue) == 0x000011, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::CallFunc_GetSnapNetWorldType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, CallFunc_SwitchSnapNetWorldType_WorldType) == 0x000013, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::CallFunc_SwitchSnapNetWorldType_WorldType' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, K2Node_Event_bOldEnabled) == 0x000014, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::K2Node_Event_bOldEnabled' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, K2Node_Event_bNewEnabled) == 0x000015, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::K2Node_Event_bNewEnabled' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000016, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, CallFunc_IsValid_ReturnValue) == 0x000017, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_ExecuteUbergraph_Pickup_Base, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'Pickup_Base_C_ExecuteUbergraph_Pickup_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function Pickup_Base.Pickup_Base_C.InteractionCompleted
// 0x0008 (0x0008 - 0x0000)
struct Pickup_Base_C_InteractionCompleted final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pickup_Base_C_InteractionCompleted) == 0x000008, "Wrong alignment on Pickup_Base_C_InteractionCompleted");
static_assert(sizeof(Pickup_Base_C_InteractionCompleted) == 0x000008, "Wrong size on Pickup_Base_C_InteractionCompleted");
static_assert(offsetof(Pickup_Base_C_InteractionCompleted, InteractingActor) == 0x000000, "Member 'Pickup_Base_C_InteractionCompleted::InteractingActor' has a wrong offset!");

// Function Pickup_Base.Pickup_Base_C.OnEnabledChanged
// 0x0002 (0x0002 - 0x0000)
struct Pickup_Base_C_OnEnabledChanged final
{
public:
	bool                                          bOldEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewEnabled;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pickup_Base_C_OnEnabledChanged) == 0x000001, "Wrong alignment on Pickup_Base_C_OnEnabledChanged");
static_assert(sizeof(Pickup_Base_C_OnEnabledChanged) == 0x000002, "Wrong size on Pickup_Base_C_OnEnabledChanged");
static_assert(offsetof(Pickup_Base_C_OnEnabledChanged, bOldEnabled) == 0x000000, "Member 'Pickup_Base_C_OnEnabledChanged::bOldEnabled' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_OnEnabledChanged, bNewEnabled) == 0x000001, "Member 'Pickup_Base_C_OnEnabledChanged::bNewEnabled' has a wrong offset!");

// Function Pickup_Base.Pickup_Base_C.TryPickUpBy
// 0x0010 (0x0010 - 0x0000)
struct Pickup_Base_C_TryPickUpBy final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pickup_Base_C_TryPickUpBy) == 0x000008, "Wrong alignment on Pickup_Base_C_TryPickUpBy");
static_assert(sizeof(Pickup_Base_C_TryPickUpBy) == 0x000010, "Wrong size on Pickup_Base_C_TryPickUpBy");
static_assert(offsetof(Pickup_Base_C_TryPickUpBy, Instigator_0) == 0x000000, "Member 'Pickup_Base_C_TryPickUpBy::Instigator_0' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_TryPickUpBy, Success) == 0x000008, "Member 'Pickup_Base_C_TryPickUpBy::Success' has a wrong offset!");

// Function Pickup_Base.Pickup_Base_C.CanStartInteraction
// 0x0010 (0x0010 - 0x0000)
struct Pickup_Base_C_CanStartInteraction final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pickup_Base_C_CanStartInteraction) == 0x000008, "Wrong alignment on Pickup_Base_C_CanStartInteraction");
static_assert(sizeof(Pickup_Base_C_CanStartInteraction) == 0x000010, "Wrong size on Pickup_Base_C_CanStartInteraction");
static_assert(offsetof(Pickup_Base_C_CanStartInteraction, InteractingActor) == 0x000000, "Member 'Pickup_Base_C_CanStartInteraction::InteractingActor' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_CanStartInteraction, ReturnValue) == 0x000008, "Member 'Pickup_Base_C_CanStartInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Base_C_CanStartInteraction, CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue) == 0x000009, "Member 'Pickup_Base_C_CanStartInteraction::CallFunc_Conv_SnapNetPropertyBooleanToBool_ReturnValue' has a wrong offset!");

}

