#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerController_MatchaSnapNet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function PlayerController_MatchaSnapNet.PlayerController_MatchaSnapNet_C.ExecuteUbergraph_PlayerController_MatchaSnapNet
// 0x02C8 (0x02C8 - 0x0000)
struct PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerIndexForLocalPlayer;      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PreviousSpectatedPlayerIndex;   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewSpectatedPlayerIndex;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0128(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0188(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0198(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F8(0x0010)()
	EAliveState                                   CallFunc_GetAliveState_ReturnValue;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PlayerIndexForLocalPlayer, int32 PreviousSpectatedPlayerIndex, int32 NewSpectatedPlayerIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIRouter*                           CallFunc_GetUIRouter_ReturnValue;                  // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_PauseOptions_C*               CallFunc_CreateMenu_ReturnValue;                   // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOdyMenu*                               CallFunc_FindMenu_ReturnValue;                     // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOdyMenu*                               CallFunc_FindMenu_ReturnValue_1;                   // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InGameUI_C*                        K2Node_DynamicCast_AsWBP_in_Game_UI;               // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            Temp_string_Variable;                              // 0x0258(0x0050)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet) == 0x000008, "Wrong alignment on PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet");
static_assert(sizeof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet) == 0x0002C8, "Wrong size on PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, EntryPoint) == 0x000000, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000038, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, Temp_object_Variable) == 0x000040, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, Temp_real_Variable) == 0x000048, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, Temp_real_Variable_0) == 0x000050, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, Temp_real_Variable_1) == 0x000058, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, Temp_bool_Variable) == 0x000060, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, Temp_real_Variable_1_0) == 0x000068, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_CustomEvent_PlayerIndexForLocalPlayer) == 0x000074, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_CustomEvent_PlayerIndexForLocalPlayer' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_CustomEvent_PreviousSpectatedPlayerIndex) == 0x000078, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_CustomEvent_PreviousSpectatedPlayerIndex' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_CustomEvent_NewSpectatedPlayerIndex) == 0x00007C, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_CustomEvent_NewSpectatedPlayerIndex' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000080, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000D0, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0000D8, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_MakeStruct_FormatArgumentData_2) == 0x000128, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_MakeArray_Array) == 0x000170, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000180, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_Format_ReturnValue) == 0x000188, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_MakeStruct_FormatArgumentData_3) == 0x000198, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_MakeArray_Array_1) == 0x0001E8, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_Format_ReturnValue_1) == 0x0001F8, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_GetAliveState_ReturnValue) == 0x000208, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_GetAliveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000209, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_CreateDelegate_OutputDelegate) == 0x00020C, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_GetUIRouter_ReturnValue) == 0x000220, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_GetUIRouter_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_CreateMenu_ReturnValue) == 0x000228, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_CreateMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_FindMenu_ReturnValue) == 0x000230, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_FindMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_FindMenu_ReturnValue_1) == 0x000238, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_FindMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_IsValid_ReturnValue_1) == 0x000240, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_DynamicCast_AsWBP_in_Game_UI) == 0x000248, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_DynamicCast_AsWBP_in_Game_UI' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, Temp_string_Variable) == 0x000258, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002A8, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002B8, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0002C0, "Member 'PlayerController_MatchaSnapNet_C_ExecuteUbergraph_PlayerController_MatchaSnapNet::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function PlayerController_MatchaSnapNet.PlayerController_MatchaSnapNet_C.HandleSpectatedPlayerIndexChanged
// 0x000C (0x000C - 0x0000)
struct PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged final
{
public:
	int32                                         PlayerIndexForLocalPlayer;                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousSpectatedPlayerIndex;                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewSpectatedPlayerIndex;                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged) == 0x000004, "Wrong alignment on PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged");
static_assert(sizeof(PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged) == 0x00000C, "Wrong size on PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged, PlayerIndexForLocalPlayer) == 0x000000, "Member 'PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged::PlayerIndexForLocalPlayer' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged, PreviousSpectatedPlayerIndex) == 0x000004, "Member 'PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged::PreviousSpectatedPlayerIndex' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged, NewSpectatedPlayerIndex) == 0x000008, "Member 'PlayerController_MatchaSnapNet_C_HandleSpectatedPlayerIndexChanged::NewSpectatedPlayerIndex' has a wrong offset!");

// Function PlayerController_MatchaSnapNet.PlayerController_MatchaSnapNet_C.InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'PlayerController_MatchaSnapNet_C_InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function PlayerController_MatchaSnapNet.PlayerController_MatchaSnapNet_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PlayerController_MatchaSnapNet_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerController_MatchaSnapNet_C_ReceiveTick) == 0x000004, "Wrong alignment on PlayerController_MatchaSnapNet_C_ReceiveTick");
static_assert(sizeof(PlayerController_MatchaSnapNet_C_ReceiveTick) == 0x000004, "Wrong size on PlayerController_MatchaSnapNet_C_ReceiveTick");
static_assert(offsetof(PlayerController_MatchaSnapNet_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PlayerController_MatchaSnapNet_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

