#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerController_MatchaSnapNet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerController_MatchaSnapNet.PlayerController_MatchaSnapNet_C
// 0x0018 (0x1AB8 - 0x1AA0)
class APlayerController_MatchaSnapNet_C final : public AMatchaSnapNetPlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        AutoSpectateSwapDelay;                             // 0x1AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AutoSpectateTimerHandle;                           // 0x1AB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AutoSpectateNext();
	void ExecuteUbergraph_PlayerController_MatchaSnapNet(int32 EntryPoint);
	void HandleSpectatedPlayerIndexChanged(int32 PlayerIndexForLocalPlayer, int32 PreviousSpectatedPlayerIndex, int32 NewSpectatedPlayerIndex);
	void InpActEvt_IA_Menu_Pause_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerController_MatchaSnapNet_C">();
	}
	static class APlayerController_MatchaSnapNet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerController_MatchaSnapNet_C>();
	}
};
static_assert(alignof(APlayerController_MatchaSnapNet_C) == 0x000008, "Wrong alignment on APlayerController_MatchaSnapNet_C");
static_assert(sizeof(APlayerController_MatchaSnapNet_C) == 0x001AB8, "Wrong size on APlayerController_MatchaSnapNet_C");
static_assert(offsetof(APlayerController_MatchaSnapNet_C, UberGraphFrame) == 0x001AA0, "Member 'APlayerController_MatchaSnapNet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerController_MatchaSnapNet_C, AutoSpectateSwapDelay) == 0x001AA8, "Member 'APlayerController_MatchaSnapNet_C::AutoSpectateSwapDelay' has a wrong offset!");
static_assert(offsetof(APlayerController_MatchaSnapNet_C, AutoSpectateTimerHandle) == 0x001AB0, "Member 'APlayerController_MatchaSnapNet_C::AutoSpectateTimerHandle' has a wrong offset!");

}

