#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: R_Gear_Pickup_Default_DoNotCopyOrChild

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "R_InteractivePickup_Base_classes.hpp"
#include "Matcha_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass R_Gear_Pickup_Default_DoNotCopyOrChild.R_Gear_Pickup_Default_DoNotCopyOrChild_C
// 0x0038 (0x02E8 - 0x02B0)
class AR_Gear_Pickup_Default_DoNotCopyOrChild_C final : public AR_InteractivePickup_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_R_Gear_Pickup_Default_DoNotCopyOrChild_C; // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ItemVisual;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ButtonPromptLocation;                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Rarity_HIghligh;                                // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTargeted;                                        // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Current_Visual_Class;                              // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateVisual(class UMatchaItemAsset* ItemAsset);
	void K2_OnUpdateFromEntity(const class AMatchaSnapNetInteractiveEntity* EntityActor, float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_R_Gear_Pickup_Default_DoNotCopyOrChild(int32 EntryPoint);

	struct FVector GetInteractionPromptLocation(const class AActor* InteractingRenderer) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"R_Gear_Pickup_Default_DoNotCopyOrChild_C">();
	}
	static class AR_Gear_Pickup_Default_DoNotCopyOrChild_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AR_Gear_Pickup_Default_DoNotCopyOrChild_C>();
	}
};
static_assert(alignof(AR_Gear_Pickup_Default_DoNotCopyOrChild_C) == 0x000008, "Wrong alignment on AR_Gear_Pickup_Default_DoNotCopyOrChild_C");
static_assert(sizeof(AR_Gear_Pickup_Default_DoNotCopyOrChild_C) == 0x0002E8, "Wrong size on AR_Gear_Pickup_Default_DoNotCopyOrChild_C");
static_assert(offsetof(AR_Gear_Pickup_Default_DoNotCopyOrChild_C, UberGraphFrame_R_Gear_Pickup_Default_DoNotCopyOrChild_C) == 0x0002B0, "Member 'AR_Gear_Pickup_Default_DoNotCopyOrChild_C::UberGraphFrame_R_Gear_Pickup_Default_DoNotCopyOrChild_C' has a wrong offset!");
static_assert(offsetof(AR_Gear_Pickup_Default_DoNotCopyOrChild_C, ItemVisual) == 0x0002B8, "Member 'AR_Gear_Pickup_Default_DoNotCopyOrChild_C::ItemVisual' has a wrong offset!");
static_assert(offsetof(AR_Gear_Pickup_Default_DoNotCopyOrChild_C, ButtonPromptLocation) == 0x0002C0, "Member 'AR_Gear_Pickup_Default_DoNotCopyOrChild_C::ButtonPromptLocation' has a wrong offset!");
static_assert(offsetof(AR_Gear_Pickup_Default_DoNotCopyOrChild_C, NS_Rarity_HIghligh) == 0x0002C8, "Member 'AR_Gear_Pickup_Default_DoNotCopyOrChild_C::NS_Rarity_HIghligh' has a wrong offset!");
static_assert(offsetof(AR_Gear_Pickup_Default_DoNotCopyOrChild_C, StaticMesh) == 0x0002D0, "Member 'AR_Gear_Pickup_Default_DoNotCopyOrChild_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AR_Gear_Pickup_Default_DoNotCopyOrChild_C, IsTargeted) == 0x0002D8, "Member 'AR_Gear_Pickup_Default_DoNotCopyOrChild_C::IsTargeted' has a wrong offset!");
static_assert(offsetof(AR_Gear_Pickup_Default_DoNotCopyOrChild_C, Current_Visual_Class) == 0x0002E0, "Member 'AR_Gear_Pickup_Default_DoNotCopyOrChild_C::Current_Visual_Class' has a wrong offset!");

}

