#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: R_ItemRenderer_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function R_ItemRenderer_Base.R_ItemRenderer_Base_C.ConfigureFromItem
// 0x0008 (0x0008 - 0x0000)
struct R_ItemRenderer_Base_C_ConfigureFromItem final
{
public:
	const class UMatchaItemAsset*                 ItemAsset;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(R_ItemRenderer_Base_C_ConfigureFromItem) == 0x000008, "Wrong alignment on R_ItemRenderer_Base_C_ConfigureFromItem");
static_assert(sizeof(R_ItemRenderer_Base_C_ConfigureFromItem) == 0x000008, "Wrong size on R_ItemRenderer_Base_C_ConfigureFromItem");
static_assert(offsetof(R_ItemRenderer_Base_C_ConfigureFromItem, ItemAsset) == 0x000000, "Member 'R_ItemRenderer_Base_C_ConfigureFromItem::ItemAsset' has a wrong offset!");

// Function R_ItemRenderer_Base.R_ItemRenderer_Base_C.ExecuteUbergraph_R_ItemRenderer_Base
// 0x0038 (0x0038 - 0x0000)
struct R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Count;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UMatchaItemAsset*                 K2Node_Event_ItemAsset;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0010)()
};
static_assert(alignof(R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base) == 0x000008, "Wrong alignment on R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base");
static_assert(sizeof(R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base) == 0x000038, "Wrong size on R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base");
static_assert(offsetof(R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base, EntryPoint) == 0x000000, "Member 'R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base, K2Node_Event_Count) == 0x000004, "Member 'R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base, K2Node_Event_ItemAsset) == 0x000008, "Member 'R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base::K2Node_Event_ItemAsset' has a wrong offset!");
static_assert(offsetof(R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base, CallFunc_Map_Find_Value) == 0x000014, "Member 'R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base, CallFunc_Map_Find_ReturnValue) == 0x000024, "Member 'R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'R_ItemRenderer_Base_C_ExecuteUbergraph_R_ItemRenderer_Base::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function R_ItemRenderer_Base.R_ItemRenderer_Base_C.UpdateItemCount
// 0x0004 (0x0004 - 0x0000)
struct R_ItemRenderer_Base_C_UpdateItemCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(R_ItemRenderer_Base_C_UpdateItemCount) == 0x000004, "Wrong alignment on R_ItemRenderer_Base_C_UpdateItemCount");
static_assert(sizeof(R_ItemRenderer_Base_C_UpdateItemCount) == 0x000004, "Wrong size on R_ItemRenderer_Base_C_UpdateItemCount");
static_assert(offsetof(R_ItemRenderer_Base_C_UpdateItemCount, Count) == 0x000000, "Member 'R_ItemRenderer_Base_C_UpdateItemCount::Count' has a wrong offset!");

}

