#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: R_ItemRenderer_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Matcha_structs.hpp"
#include "Matcha_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass R_ItemRenderer_Base.R_ItemRenderer_Base_C
// 0x0078 (0x0308 - 0x0290)
class AR_ItemRenderer_Base_C : public AMatchaItemRenderer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Rarity_HIghligh;                                // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<EObjectRarity, struct FLinearColor>      RarityToColorMap;                                  // 0x02B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ConfigureFromItem(const class UMatchaItemAsset* ItemAsset);
	void ExecuteUbergraph_R_ItemRenderer_Base(int32 EntryPoint);
	void UpdateItemCount(int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"R_ItemRenderer_Base_C">();
	}
	static class AR_ItemRenderer_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AR_ItemRenderer_Base_C>();
	}
};
static_assert(alignof(AR_ItemRenderer_Base_C) == 0x000008, "Wrong alignment on AR_ItemRenderer_Base_C");
static_assert(sizeof(AR_ItemRenderer_Base_C) == 0x000308, "Wrong size on AR_ItemRenderer_Base_C");
static_assert(offsetof(AR_ItemRenderer_Base_C, UberGraphFrame) == 0x000290, "Member 'AR_ItemRenderer_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AR_ItemRenderer_Base_C, NS_Rarity_HIghligh) == 0x000298, "Member 'AR_ItemRenderer_Base_C::NS_Rarity_HIghligh' has a wrong offset!");
static_assert(offsetof(AR_ItemRenderer_Base_C, TextRender) == 0x0002A0, "Member 'AR_ItemRenderer_Base_C::TextRender' has a wrong offset!");
static_assert(offsetof(AR_ItemRenderer_Base_C, StaticMesh) == 0x0002A8, "Member 'AR_ItemRenderer_Base_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AR_ItemRenderer_Base_C, DefaultSceneRoot) == 0x0002B0, "Member 'AR_ItemRenderer_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AR_ItemRenderer_Base_C, RarityToColorMap) == 0x0002B8, "Member 'AR_ItemRenderer_Base_C::RarityToColorMap' has a wrong offset!");

}

