#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: R_Pickup_Common

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "R_InteractivePickup_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass R_Pickup_Common.R_Pickup_Common_C
// 0x0018 (0x02C8 - 0x02B0)
class AR_Pickup_Common_C final : public AR_InteractivePickup_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_R_Pickup_Common_C;                  // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ItemVisual;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CurrentVisualClass;                                // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_R_Pickup_Common(int32 EntryPoint);
	void K2_OnUpdateFromEntity(const class AMatchaSnapNetInteractiveEntity* EntityActor, float DeltaSeconds);
	void SetTargeted(bool bNewTargeted);
	void UpdateQuantity(int32 Quantity);
	void UpdateVisual(class UMatchaItemAsset* ItemAsset);

	struct FVector GetInteractionPromptLocation(const class AActor* InteractingRenderer) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"R_Pickup_Common_C">();
	}
	static class AR_Pickup_Common_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AR_Pickup_Common_C>();
	}
};
static_assert(alignof(AR_Pickup_Common_C) == 0x000008, "Wrong alignment on AR_Pickup_Common_C");
static_assert(sizeof(AR_Pickup_Common_C) == 0x0002C8, "Wrong size on AR_Pickup_Common_C");
static_assert(offsetof(AR_Pickup_Common_C, UberGraphFrame_R_Pickup_Common_C) == 0x0002B0, "Member 'AR_Pickup_Common_C::UberGraphFrame_R_Pickup_Common_C' has a wrong offset!");
static_assert(offsetof(AR_Pickup_Common_C, ItemVisual) == 0x0002B8, "Member 'AR_Pickup_Common_C::ItemVisual' has a wrong offset!");
static_assert(offsetof(AR_Pickup_Common_C, CurrentVisualClass) == 0x0002C0, "Member 'AR_Pickup_Common_C::CurrentVisualClass' has a wrong offset!");

}

