#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SnapNet

#include "Basic.hpp"

#include "SnapNet_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SnapNet.SnapNetAnimationUtilities.GetComponentSpaceBoneTransform
// 0x0090 (0x0090 - 0x0000)
struct SnapNetAnimationUtilities_GetComponentSpaceBoneTransform final
{
public:
	const class UAnimMontage*                     Montage;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OutTransform;                                      // 0x0020(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0xF];                                       // 0x0081(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SnapNetAnimationUtilities_GetComponentSpaceBoneTransform) == 0x000010, "Wrong alignment on SnapNetAnimationUtilities_GetComponentSpaceBoneTransform");
static_assert(sizeof(SnapNetAnimationUtilities_GetComponentSpaceBoneTransform) == 0x000090, "Wrong size on SnapNetAnimationUtilities_GetComponentSpaceBoneTransform");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceBoneTransform, Montage) == 0x000000, "Member 'SnapNetAnimationUtilities_GetComponentSpaceBoneTransform::Montage' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceBoneTransform, Time) == 0x000008, "Member 'SnapNetAnimationUtilities_GetComponentSpaceBoneTransform::Time' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceBoneTransform, SocketName) == 0x00000C, "Member 'SnapNetAnimationUtilities_GetComponentSpaceBoneTransform::SocketName' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceBoneTransform, OutTransform) == 0x000020, "Member 'SnapNetAnimationUtilities_GetComponentSpaceBoneTransform::OutTransform' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceBoneTransform, ReturnValue) == 0x000080, "Member 'SnapNetAnimationUtilities_GetComponentSpaceBoneTransform::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetAnimationUtilities.GetComponentSpaceSocketTransform
// 0x0090 (0x0090 - 0x0000)
struct SnapNetAnimationUtilities_GetComponentSpaceSocketTransform final
{
public:
	const class UAnimSequenceBase*                AnimationSequence;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Time;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OutTransform;                                      // 0x0020(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0xF];                                       // 0x0081(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SnapNetAnimationUtilities_GetComponentSpaceSocketTransform) == 0x000010, "Wrong alignment on SnapNetAnimationUtilities_GetComponentSpaceSocketTransform");
static_assert(sizeof(SnapNetAnimationUtilities_GetComponentSpaceSocketTransform) == 0x000090, "Wrong size on SnapNetAnimationUtilities_GetComponentSpaceSocketTransform");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceSocketTransform, AnimationSequence) == 0x000000, "Member 'SnapNetAnimationUtilities_GetComponentSpaceSocketTransform::AnimationSequence' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceSocketTransform, Time) == 0x000008, "Member 'SnapNetAnimationUtilities_GetComponentSpaceSocketTransform::Time' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceSocketTransform, SocketName) == 0x000010, "Member 'SnapNetAnimationUtilities_GetComponentSpaceSocketTransform::SocketName' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceSocketTransform, OutTransform) == 0x000020, "Member 'SnapNetAnimationUtilities_GetComponentSpaceSocketTransform::OutTransform' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_GetComponentSpaceSocketTransform, ReturnValue) == 0x000080, "Member 'SnapNetAnimationUtilities_GetComponentSpaceSocketTransform::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetAnimationUtilities.SyncMontageState
// 0x0028 (0x0028 - 0x0000)
struct SnapNetAnimationUtilities_SyncMontageState final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MontageGroupName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackPosition;                                  // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESnapNetMontageUpdateType                     UpdateType;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SnapNetAnimationUtilities_SyncMontageState) == 0x000008, "Wrong alignment on SnapNetAnimationUtilities_SyncMontageState");
static_assert(sizeof(SnapNetAnimationUtilities_SyncMontageState) == 0x000028, "Wrong size on SnapNetAnimationUtilities_SyncMontageState");
static_assert(offsetof(SnapNetAnimationUtilities_SyncMontageState, AnimInstance) == 0x000000, "Member 'SnapNetAnimationUtilities_SyncMontageState::AnimInstance' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_SyncMontageState, MontageGroupName) == 0x000008, "Member 'SnapNetAnimationUtilities_SyncMontageState::MontageGroupName' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_SyncMontageState, Montage) == 0x000010, "Member 'SnapNetAnimationUtilities_SyncMontageState::Montage' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_SyncMontageState, PlaybackPosition) == 0x000018, "Member 'SnapNetAnimationUtilities_SyncMontageState::PlaybackPosition' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_SyncMontageState, PlayRate) == 0x00001C, "Member 'SnapNetAnimationUtilities_SyncMontageState::PlayRate' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_SyncMontageState, UpdateType) == 0x000020, "Member 'SnapNetAnimationUtilities_SyncMontageState::UpdateType' has a wrong offset!");

// Function SnapNet.SnapNetAnimationUtilities.UpdateMontageState
// 0x0020 (0x0020 - 0x0000)
struct SnapNetAnimationUtilities_UpdateMontageState final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MontageGroupName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackPosition;                                  // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESnapNetMontageUpdateType                     UpdateType;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SnapNetAnimationUtilities_UpdateMontageState) == 0x000008, "Wrong alignment on SnapNetAnimationUtilities_UpdateMontageState");
static_assert(sizeof(SnapNetAnimationUtilities_UpdateMontageState) == 0x000020, "Wrong size on SnapNetAnimationUtilities_UpdateMontageState");
static_assert(offsetof(SnapNetAnimationUtilities_UpdateMontageState, AnimInstance) == 0x000000, "Member 'SnapNetAnimationUtilities_UpdateMontageState::AnimInstance' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_UpdateMontageState, MontageGroupName) == 0x000008, "Member 'SnapNetAnimationUtilities_UpdateMontageState::MontageGroupName' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_UpdateMontageState, Montage) == 0x000010, "Member 'SnapNetAnimationUtilities_UpdateMontageState::Montage' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_UpdateMontageState, PlaybackPosition) == 0x000018, "Member 'SnapNetAnimationUtilities_UpdateMontageState::PlaybackPosition' has a wrong offset!");
static_assert(offsetof(SnapNetAnimationUtilities_UpdateMontageState, UpdateType) == 0x00001C, "Member 'SnapNetAnimationUtilities_UpdateMontageState::UpdateType' has a wrong offset!");

// Function SnapNet.SnapNetCharacterEntity.CharacterMovementUpdated
// 0x0038 (0x0038 - 0x0000)
struct SnapNetCharacterEntity_CharacterMovementUpdated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OldLocation;                                       // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldVelocity;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetCharacterEntity_CharacterMovementUpdated) == 0x000008, "Wrong alignment on SnapNetCharacterEntity_CharacterMovementUpdated");
static_assert(sizeof(SnapNetCharacterEntity_CharacterMovementUpdated) == 0x000038, "Wrong size on SnapNetCharacterEntity_CharacterMovementUpdated");
static_assert(offsetof(SnapNetCharacterEntity_CharacterMovementUpdated, DeltaSeconds) == 0x000000, "Member 'SnapNetCharacterEntity_CharacterMovementUpdated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SnapNetCharacterEntity_CharacterMovementUpdated, OldLocation) == 0x000008, "Member 'SnapNetCharacterEntity_CharacterMovementUpdated::OldLocation' has a wrong offset!");
static_assert(offsetof(SnapNetCharacterEntity_CharacterMovementUpdated, OldVelocity) == 0x000020, "Member 'SnapNetCharacterEntity_CharacterMovementUpdated::OldVelocity' has a wrong offset!");

// Function SnapNet.SnapNetClient.Get
// 0x0010 (0x0010 - 0x0000)
struct SnapNetClient_Get final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapNetClient*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_Get) == 0x000008, "Wrong alignment on SnapNetClient_Get");
static_assert(sizeof(SnapNetClient_Get) == 0x000010, "Wrong size on SnapNetClient_Get");
static_assert(offsetof(SnapNetClient_Get, WorldContextObject) == 0x000000, "Member 'SnapNetClient_Get::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SnapNetClient_Get, ReturnValue) == 0x000008, "Member 'SnapNetClient_Get::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.PlayReplayFile
// 0x0020 (0x0020 - 0x0000)
struct SnapNetClient_PlayReplayFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartTime;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndTime;                                           // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SnapNetClient_PlayReplayFile) == 0x000008, "Wrong alignment on SnapNetClient_PlayReplayFile");
static_assert(sizeof(SnapNetClient_PlayReplayFile) == 0x000020, "Wrong size on SnapNetClient_PlayReplayFile");
static_assert(offsetof(SnapNetClient_PlayReplayFile, Filename) == 0x000000, "Member 'SnapNetClient_PlayReplayFile::Filename' has a wrong offset!");
static_assert(offsetof(SnapNetClient_PlayReplayFile, StartTime) == 0x000010, "Member 'SnapNetClient_PlayReplayFile::StartTime' has a wrong offset!");
static_assert(offsetof(SnapNetClient_PlayReplayFile, EndTime) == 0x000014, "Member 'SnapNetClient_PlayReplayFile::EndTime' has a wrong offset!");
static_assert(offsetof(SnapNetClient_PlayReplayFile, ReturnValue) == 0x000018, "Member 'SnapNetClient_PlayReplayFile::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.SeekReplay
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_SeekReplay final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SeekReplay) == 0x000004, "Wrong alignment on SnapNetClient_SeekReplay");
static_assert(sizeof(SnapNetClient_SeekReplay) == 0x000004, "Wrong size on SnapNetClient_SeekReplay");
static_assert(offsetof(SnapNetClient_SeekReplay, Time) == 0x000000, "Member 'SnapNetClient_SeekReplay::Time' has a wrong offset!");

// Function SnapNet.SnapNetClient.SendReliableMessage
// 0x0010 (0x0010 - 0x0000)
struct SnapNetClient_SendReliableMessage final
{
public:
	int32                                         LocalPlayerIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USnapNetReliableMessage*                Message;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SendReliableMessage) == 0x000008, "Wrong alignment on SnapNetClient_SendReliableMessage");
static_assert(sizeof(SnapNetClient_SendReliableMessage) == 0x000010, "Wrong size on SnapNetClient_SendReliableMessage");
static_assert(offsetof(SnapNetClient_SendReliableMessage, LocalPlayerIndex) == 0x000000, "Member 'SnapNetClient_SendReliableMessage::LocalPlayerIndex' has a wrong offset!");
static_assert(offsetof(SnapNetClient_SendReliableMessage, Message) == 0x000008, "Member 'SnapNetClient_SendReliableMessage::Message' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetAdditionalJitterBufferMilliseconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_SetAdditionalJitterBufferMilliseconds final
{
public:
	int32                                         Milliseconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetAdditionalJitterBufferMilliseconds) == 0x000004, "Wrong alignment on SnapNetClient_SetAdditionalJitterBufferMilliseconds");
static_assert(sizeof(SnapNetClient_SetAdditionalJitterBufferMilliseconds) == 0x000004, "Wrong size on SnapNetClient_SetAdditionalJitterBufferMilliseconds");
static_assert(offsetof(SnapNetClient_SetAdditionalJitterBufferMilliseconds, Milliseconds) == 0x000000, "Member 'SnapNetClient_SetAdditionalJitterBufferMilliseconds::Milliseconds' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetInputDelayBeforePredictionMaxMilliseconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_SetInputDelayBeforePredictionMaxMilliseconds final
{
public:
	int32                                         Milliseconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetInputDelayBeforePredictionMaxMilliseconds) == 0x000004, "Wrong alignment on SnapNetClient_SetInputDelayBeforePredictionMaxMilliseconds");
static_assert(sizeof(SnapNetClient_SetInputDelayBeforePredictionMaxMilliseconds) == 0x000004, "Wrong size on SnapNetClient_SetInputDelayBeforePredictionMaxMilliseconds");
static_assert(offsetof(SnapNetClient_SetInputDelayBeforePredictionMaxMilliseconds, Milliseconds) == 0x000000, "Member 'SnapNetClient_SetInputDelayBeforePredictionMaxMilliseconds::Milliseconds' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetInputDelayBeforePredictionMinMilliseconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_SetInputDelayBeforePredictionMinMilliseconds final
{
public:
	int32                                         Milliseconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetInputDelayBeforePredictionMinMilliseconds) == 0x000004, "Wrong alignment on SnapNetClient_SetInputDelayBeforePredictionMinMilliseconds");
static_assert(sizeof(SnapNetClient_SetInputDelayBeforePredictionMinMilliseconds) == 0x000004, "Wrong size on SnapNetClient_SetInputDelayBeforePredictionMinMilliseconds");
static_assert(offsetof(SnapNetClient_SetInputDelayBeforePredictionMinMilliseconds, Milliseconds) == 0x000000, "Member 'SnapNetClient_SetInputDelayBeforePredictionMinMilliseconds::Milliseconds' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetPacketCodecClass
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_SetPacketCodecClass final
{
public:
	TSubclassOf<class USnapNetPacketCodec>        PacketCodecClass;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetPacketCodecClass) == 0x000008, "Wrong alignment on SnapNetClient_SetPacketCodecClass");
static_assert(sizeof(SnapNetClient_SetPacketCodecClass) == 0x000008, "Wrong size on SnapNetClient_SetPacketCodecClass");
static_assert(offsetof(SnapNetClient_SetPacketCodecClass, PacketCodecClass) == 0x000000, "Member 'SnapNetClient_SetPacketCodecClass::PacketCodecClass' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetPacketSimulationJitter
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_SetPacketSimulationJitter final
{
public:
	int32                                         Milliseconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetPacketSimulationJitter) == 0x000004, "Wrong alignment on SnapNetClient_SetPacketSimulationJitter");
static_assert(sizeof(SnapNetClient_SetPacketSimulationJitter) == 0x000004, "Wrong size on SnapNetClient_SetPacketSimulationJitter");
static_assert(offsetof(SnapNetClient_SetPacketSimulationJitter, Milliseconds) == 0x000000, "Member 'SnapNetClient_SetPacketSimulationJitter::Milliseconds' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetPacketSimulationLatency
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_SetPacketSimulationLatency final
{
public:
	int32                                         Milliseconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetPacketSimulationLatency) == 0x000004, "Wrong alignment on SnapNetClient_SetPacketSimulationLatency");
static_assert(sizeof(SnapNetClient_SetPacketSimulationLatency) == 0x000004, "Wrong size on SnapNetClient_SetPacketSimulationLatency");
static_assert(offsetof(SnapNetClient_SetPacketSimulationLatency, Milliseconds) == 0x000000, "Member 'SnapNetClient_SetPacketSimulationLatency::Milliseconds' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetPacketSimulationLoss
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_SetPacketSimulationLoss final
{
public:
	float                                         Percentage;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetPacketSimulationLoss) == 0x000004, "Wrong alignment on SnapNetClient_SetPacketSimulationLoss");
static_assert(sizeof(SnapNetClient_SetPacketSimulationLoss) == 0x000004, "Wrong size on SnapNetClient_SetPacketSimulationLoss");
static_assert(offsetof(SnapNetClient_SetPacketSimulationLoss, Percentage) == 0x000000, "Member 'SnapNetClient_SetPacketSimulationLoss::Percentage' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetPredictedMaxMilliseconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_SetPredictedMaxMilliseconds final
{
public:
	int32                                         Milliseconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetPredictedMaxMilliseconds) == 0x000004, "Wrong alignment on SnapNetClient_SetPredictedMaxMilliseconds");
static_assert(sizeof(SnapNetClient_SetPredictedMaxMilliseconds) == 0x000004, "Wrong size on SnapNetClient_SetPredictedMaxMilliseconds");
static_assert(offsetof(SnapNetClient_SetPredictedMaxMilliseconds, Milliseconds) == 0x000000, "Member 'SnapNetClient_SetPredictedMaxMilliseconds::Milliseconds' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetRenderInterpolationMethod
// 0x0001 (0x0001 - 0x0000)
struct SnapNetClient_SetRenderInterpolationMethod final
{
public:
	ESnapNetRenderInterpolationMethod             RenderInterpolationMethod;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetRenderInterpolationMethod) == 0x000001, "Wrong alignment on SnapNetClient_SetRenderInterpolationMethod");
static_assert(sizeof(SnapNetClient_SetRenderInterpolationMethod) == 0x000001, "Wrong size on SnapNetClient_SetRenderInterpolationMethod");
static_assert(offsetof(SnapNetClient_SetRenderInterpolationMethod, RenderInterpolationMethod) == 0x000000, "Member 'SnapNetClient_SetRenderInterpolationMethod::RenderInterpolationMethod' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetSpectatedPlayerIndexForReplay
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_SetSpectatedPlayerIndexForReplay final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetSpectatedPlayerIndexForReplay) == 0x000004, "Wrong alignment on SnapNetClient_SetSpectatedPlayerIndexForReplay");
static_assert(sizeof(SnapNetClient_SetSpectatedPlayerIndexForReplay) == 0x000004, "Wrong size on SnapNetClient_SetSpectatedPlayerIndexForReplay");
static_assert(offsetof(SnapNetClient_SetSpectatedPlayerIndexForReplay, PlayerIndex) == 0x000000, "Member 'SnapNetClient_SetSpectatedPlayerIndexForReplay::PlayerIndex' has a wrong offset!");

// Function SnapNet.SnapNetClient.SetTransportClass
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_SetTransportClass final
{
public:
	TSubclassOf<class USnapNetTransport>          TransportClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_SetTransportClass) == 0x000008, "Wrong alignment on SnapNetClient_SetTransportClass");
static_assert(sizeof(SnapNetClient_SetTransportClass) == 0x000008, "Wrong size on SnapNetClient_SetTransportClass");
static_assert(offsetof(SnapNetClient_SetTransportClass, TransportClass) == 0x000000, "Member 'SnapNetClient_SetTransportClass::TransportClass' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetAdditionalJitterBufferMilliseconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetAdditionalJitterBufferMilliseconds final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetAdditionalJitterBufferMilliseconds) == 0x000004, "Wrong alignment on SnapNetClient_GetAdditionalJitterBufferMilliseconds");
static_assert(sizeof(SnapNetClient_GetAdditionalJitterBufferMilliseconds) == 0x000004, "Wrong size on SnapNetClient_GetAdditionalJitterBufferMilliseconds");
static_assert(offsetof(SnapNetClient_GetAdditionalJitterBufferMilliseconds, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetAdditionalJitterBufferMilliseconds::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetBufferedRemoteInputs
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetBufferedRemoteInputs final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetBufferedRemoteInputs) == 0x000004, "Wrong alignment on SnapNetClient_GetBufferedRemoteInputs");
static_assert(sizeof(SnapNetClient_GetBufferedRemoteInputs) == 0x000004, "Wrong size on SnapNetClient_GetBufferedRemoteInputs");
static_assert(offsetof(SnapNetClient_GetBufferedRemoteInputs, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetBufferedRemoteInputs::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetConnectionStatus
// 0x0001 (0x0001 - 0x0000)
struct SnapNetClient_GetConnectionStatus final
{
public:
	ESnapNetClientConnectionStatus                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetConnectionStatus) == 0x000001, "Wrong alignment on SnapNetClient_GetConnectionStatus");
static_assert(sizeof(SnapNetClient_GetConnectionStatus) == 0x000001, "Wrong size on SnapNetClient_GetConnectionStatus");
static_assert(offsetof(SnapNetClient_GetConnectionStatus, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetConnectionStatus::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetInputDelayBeforePredictionMaxMilliseconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetInputDelayBeforePredictionMaxMilliseconds final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetInputDelayBeforePredictionMaxMilliseconds) == 0x000004, "Wrong alignment on SnapNetClient_GetInputDelayBeforePredictionMaxMilliseconds");
static_assert(sizeof(SnapNetClient_GetInputDelayBeforePredictionMaxMilliseconds) == 0x000004, "Wrong size on SnapNetClient_GetInputDelayBeforePredictionMaxMilliseconds");
static_assert(offsetof(SnapNetClient_GetInputDelayBeforePredictionMaxMilliseconds, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetInputDelayBeforePredictionMaxMilliseconds::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetInputDelayBeforePredictionMinMilliseconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetInputDelayBeforePredictionMinMilliseconds final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetInputDelayBeforePredictionMinMilliseconds) == 0x000004, "Wrong alignment on SnapNetClient_GetInputDelayBeforePredictionMinMilliseconds");
static_assert(sizeof(SnapNetClient_GetInputDelayBeforePredictionMinMilliseconds) == 0x000004, "Wrong size on SnapNetClient_GetInputDelayBeforePredictionMinMilliseconds");
static_assert(offsetof(SnapNetClient_GetInputDelayBeforePredictionMinMilliseconds, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetInputDelayBeforePredictionMinMilliseconds::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetInputDelayFrames
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetInputDelayFrames final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetInputDelayFrames) == 0x000004, "Wrong alignment on SnapNetClient_GetInputDelayFrames");
static_assert(sizeof(SnapNetClient_GetInputDelayFrames) == 0x000004, "Wrong size on SnapNetClient_GetInputDelayFrames");
static_assert(offsetof(SnapNetClient_GetInputDelayFrames, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetInputDelayFrames::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetInstantReplayContextEntityIndex
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetInstantReplayContextEntityIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetInstantReplayContextEntityIndex) == 0x000004, "Wrong alignment on SnapNetClient_GetInstantReplayContextEntityIndex");
static_assert(sizeof(SnapNetClient_GetInstantReplayContextEntityIndex) == 0x000004, "Wrong size on SnapNetClient_GetInstantReplayContextEntityIndex");
static_assert(offsetof(SnapNetClient_GetInstantReplayContextEntityIndex, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetInstantReplayContextEntityIndex::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetInstantReplaySlotIndex
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetInstantReplaySlotIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetInstantReplaySlotIndex) == 0x000004, "Wrong alignment on SnapNetClient_GetInstantReplaySlotIndex");
static_assert(sizeof(SnapNetClient_GetInstantReplaySlotIndex) == 0x000004, "Wrong size on SnapNetClient_GetInstantReplaySlotIndex");
static_assert(offsetof(SnapNetClient_GetInstantReplaySlotIndex, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetInstantReplaySlotIndex::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetJitterBufferSeconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetJitterBufferSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetJitterBufferSeconds) == 0x000004, "Wrong alignment on SnapNetClient_GetJitterBufferSeconds");
static_assert(sizeof(SnapNetClient_GetJitterBufferSeconds) == 0x000004, "Wrong size on SnapNetClient_GetJitterBufferSeconds");
static_assert(offsetof(SnapNetClient_GetJitterBufferSeconds, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetJitterBufferSeconds::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetKbpsReceived
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetKbpsReceived final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetKbpsReceived) == 0x000004, "Wrong alignment on SnapNetClient_GetKbpsReceived");
static_assert(sizeof(SnapNetClient_GetKbpsReceived) == 0x000004, "Wrong size on SnapNetClient_GetKbpsReceived");
static_assert(offsetof(SnapNetClient_GetKbpsReceived, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetKbpsReceived::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetKbpsSent
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetKbpsSent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetKbpsSent) == 0x000004, "Wrong alignment on SnapNetClient_GetKbpsSent");
static_assert(sizeof(SnapNetClient_GetKbpsSent) == 0x000004, "Wrong size on SnapNetClient_GetKbpsSent");
static_assert(offsetof(SnapNetClient_GetKbpsSent, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetKbpsSent::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetLocalPlayerIndexForLocalPlayer
// 0x0010 (0x0010 - 0x0000)
struct SnapNetClient_GetLocalPlayerIndexForLocalPlayer final
{
public:
	class ULocalPlayer*                           LocalPlayer;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SnapNetClient_GetLocalPlayerIndexForLocalPlayer) == 0x000008, "Wrong alignment on SnapNetClient_GetLocalPlayerIndexForLocalPlayer");
static_assert(sizeof(SnapNetClient_GetLocalPlayerIndexForLocalPlayer) == 0x000010, "Wrong size on SnapNetClient_GetLocalPlayerIndexForLocalPlayer");
static_assert(offsetof(SnapNetClient_GetLocalPlayerIndexForLocalPlayer, LocalPlayer) == 0x000000, "Member 'SnapNetClient_GetLocalPlayerIndexForLocalPlayer::LocalPlayer' has a wrong offset!");
static_assert(offsetof(SnapNetClient_GetLocalPlayerIndexForLocalPlayer, ReturnValue) == 0x000008, "Member 'SnapNetClient_GetLocalPlayerIndexForLocalPlayer::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetLocalPlayerIndexForPlayerIndex
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_GetLocalPlayerIndexForPlayerIndex final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetLocalPlayerIndexForPlayerIndex) == 0x000004, "Wrong alignment on SnapNetClient_GetLocalPlayerIndexForPlayerIndex");
static_assert(sizeof(SnapNetClient_GetLocalPlayerIndexForPlayerIndex) == 0x000008, "Wrong size on SnapNetClient_GetLocalPlayerIndexForPlayerIndex");
static_assert(offsetof(SnapNetClient_GetLocalPlayerIndexForPlayerIndex, PlayerIndex) == 0x000000, "Member 'SnapNetClient_GetLocalPlayerIndexForPlayerIndex::PlayerIndex' has a wrong offset!");
static_assert(offsetof(SnapNetClient_GetLocalPlayerIndexForPlayerIndex, ReturnValue) == 0x000004, "Member 'SnapNetClient_GetLocalPlayerIndexForPlayerIndex::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetPacketCodec
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_GetPacketCodec final
{
public:
	class USnapNetPacketCodec*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetPacketCodec) == 0x000008, "Wrong alignment on SnapNetClient_GetPacketCodec");
static_assert(sizeof(SnapNetClient_GetPacketCodec) == 0x000008, "Wrong size on SnapNetClient_GetPacketCodec");
static_assert(offsetof(SnapNetClient_GetPacketCodec, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetPacketCodec::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetPacketJitterSeconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetPacketJitterSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetPacketJitterSeconds) == 0x000004, "Wrong alignment on SnapNetClient_GetPacketJitterSeconds");
static_assert(sizeof(SnapNetClient_GetPacketJitterSeconds) == 0x000004, "Wrong size on SnapNetClient_GetPacketJitterSeconds");
static_assert(offsetof(SnapNetClient_GetPacketJitterSeconds, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetPacketJitterSeconds::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetPacketLatencySeconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetPacketLatencySeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetPacketLatencySeconds) == 0x000004, "Wrong alignment on SnapNetClient_GetPacketLatencySeconds");
static_assert(sizeof(SnapNetClient_GetPacketLatencySeconds) == 0x000004, "Wrong size on SnapNetClient_GetPacketLatencySeconds");
static_assert(offsetof(SnapNetClient_GetPacketLatencySeconds, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetPacketLatencySeconds::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetPacketLossFraction
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetPacketLossFraction final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetPacketLossFraction) == 0x000004, "Wrong alignment on SnapNetClient_GetPacketLossFraction");
static_assert(sizeof(SnapNetClient_GetPacketLossFraction) == 0x000004, "Wrong size on SnapNetClient_GetPacketLossFraction");
static_assert(offsetof(SnapNetClient_GetPacketLossFraction, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetPacketLossFraction::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetPlayerControllerForPlayerIndex
// 0x0010 (0x0010 - 0x0000)
struct SnapNetClient_GetPlayerControllerForPlayerIndex final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetPlayerControllerForPlayerIndex) == 0x000008, "Wrong alignment on SnapNetClient_GetPlayerControllerForPlayerIndex");
static_assert(sizeof(SnapNetClient_GetPlayerControllerForPlayerIndex) == 0x000010, "Wrong size on SnapNetClient_GetPlayerControllerForPlayerIndex");
static_assert(offsetof(SnapNetClient_GetPlayerControllerForPlayerIndex, PlayerIndex) == 0x000000, "Member 'SnapNetClient_GetPlayerControllerForPlayerIndex::PlayerIndex' has a wrong offset!");
static_assert(offsetof(SnapNetClient_GetPlayerControllerForPlayerIndex, ReturnValue) == 0x000008, "Member 'SnapNetClient_GetPlayerControllerForPlayerIndex::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetPlayerIndex
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_GetPlayerIndex final
{
public:
	int32                                         LocalPlayerIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetPlayerIndex) == 0x000004, "Wrong alignment on SnapNetClient_GetPlayerIndex");
static_assert(sizeof(SnapNetClient_GetPlayerIndex) == 0x000008, "Wrong size on SnapNetClient_GetPlayerIndex");
static_assert(offsetof(SnapNetClient_GetPlayerIndex, LocalPlayerIndex) == 0x000000, "Member 'SnapNetClient_GetPlayerIndex::LocalPlayerIndex' has a wrong offset!");
static_assert(offsetof(SnapNetClient_GetPlayerIndex, ReturnValue) == 0x000004, "Member 'SnapNetClient_GetPlayerIndex::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetPredictedFrames
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetPredictedFrames final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetPredictedFrames) == 0x000004, "Wrong alignment on SnapNetClient_GetPredictedFrames");
static_assert(sizeof(SnapNetClient_GetPredictedFrames) == 0x000004, "Wrong size on SnapNetClient_GetPredictedFrames");
static_assert(offsetof(SnapNetClient_GetPredictedFrames, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetPredictedFrames::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetPredictedMaxMilliseconds
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetPredictedMaxMilliseconds final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetPredictedMaxMilliseconds) == 0x000004, "Wrong alignment on SnapNetClient_GetPredictedMaxMilliseconds");
static_assert(sizeof(SnapNetClient_GetPredictedMaxMilliseconds) == 0x000004, "Wrong size on SnapNetClient_GetPredictedMaxMilliseconds");
static_assert(offsetof(SnapNetClient_GetPredictedMaxMilliseconds, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetPredictedMaxMilliseconds::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetSimulation
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_GetSimulation final
{
public:
	class USnapNetSimulation*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetSimulation) == 0x000008, "Wrong alignment on SnapNetClient_GetSimulation");
static_assert(sizeof(SnapNetClient_GetSimulation) == 0x000008, "Wrong size on SnapNetClient_GetSimulation");
static_assert(offsetof(SnapNetClient_GetSimulation, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetSimulation::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetSimulationTimeScale
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetSimulationTimeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetSimulationTimeScale) == 0x000004, "Wrong alignment on SnapNetClient_GetSimulationTimeScale");
static_assert(sizeof(SnapNetClient_GetSimulationTimeScale) == 0x000004, "Wrong size on SnapNetClient_GetSimulationTimeScale");
static_assert(offsetof(SnapNetClient_GetSimulationTimeScale, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetSimulationTimeScale::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetSpectatedPlayerIndex
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_GetSpectatedPlayerIndex final
{
public:
	int32                                         LocalPlayerIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetSpectatedPlayerIndex) == 0x000004, "Wrong alignment on SnapNetClient_GetSpectatedPlayerIndex");
static_assert(sizeof(SnapNetClient_GetSpectatedPlayerIndex) == 0x000008, "Wrong size on SnapNetClient_GetSpectatedPlayerIndex");
static_assert(offsetof(SnapNetClient_GetSpectatedPlayerIndex, LocalPlayerIndex) == 0x000000, "Member 'SnapNetClient_GetSpectatedPlayerIndex::LocalPlayerIndex' has a wrong offset!");
static_assert(offsetof(SnapNetClient_GetSpectatedPlayerIndex, ReturnValue) == 0x000004, "Member 'SnapNetClient_GetSpectatedPlayerIndex::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetSpectatedPlayerIndexForReplay
// 0x0004 (0x0004 - 0x0000)
struct SnapNetClient_GetSpectatedPlayerIndexForReplay final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetSpectatedPlayerIndexForReplay) == 0x000004, "Wrong alignment on SnapNetClient_GetSpectatedPlayerIndexForReplay");
static_assert(sizeof(SnapNetClient_GetSpectatedPlayerIndexForReplay) == 0x000004, "Wrong size on SnapNetClient_GetSpectatedPlayerIndexForReplay");
static_assert(offsetof(SnapNetClient_GetSpectatedPlayerIndexForReplay, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetSpectatedPlayerIndexForReplay::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.GetTransport
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_GetTransport final
{
public:
	class USnapNetTransport*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_GetTransport) == 0x000008, "Wrong alignment on SnapNetClient_GetTransport");
static_assert(sizeof(SnapNetClient_GetTransport) == 0x000008, "Wrong size on SnapNetClient_GetTransport");
static_assert(offsetof(SnapNetClient_GetTransport, ReturnValue) == 0x000000, "Member 'SnapNetClient_GetTransport::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.IsConnectionInterrupted
// 0x0001 (0x0001 - 0x0000)
struct SnapNetClient_IsConnectionInterrupted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_IsConnectionInterrupted) == 0x000001, "Wrong alignment on SnapNetClient_IsConnectionInterrupted");
static_assert(sizeof(SnapNetClient_IsConnectionInterrupted) == 0x000001, "Wrong size on SnapNetClient_IsConnectionInterrupted");
static_assert(offsetof(SnapNetClient_IsConnectionInterrupted, ReturnValue) == 0x000000, "Member 'SnapNetClient_IsConnectionInterrupted::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.IsLoopback
// 0x0001 (0x0001 - 0x0000)
struct SnapNetClient_IsLoopback final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_IsLoopback) == 0x000001, "Wrong alignment on SnapNetClient_IsLoopback");
static_assert(sizeof(SnapNetClient_IsLoopback) == 0x000001, "Wrong size on SnapNetClient_IsLoopback");
static_assert(offsetof(SnapNetClient_IsLoopback, ReturnValue) == 0x000000, "Member 'SnapNetClient_IsLoopback::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.IsNetworkSimulationEnabled
// 0x0001 (0x0001 - 0x0000)
struct SnapNetClient_IsNetworkSimulationEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_IsNetworkSimulationEnabled) == 0x000001, "Wrong alignment on SnapNetClient_IsNetworkSimulationEnabled");
static_assert(sizeof(SnapNetClient_IsNetworkSimulationEnabled) == 0x000001, "Wrong size on SnapNetClient_IsNetworkSimulationEnabled");
static_assert(offsetof(SnapNetClient_IsNetworkSimulationEnabled, ReturnValue) == 0x000000, "Member 'SnapNetClient_IsNetworkSimulationEnabled::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.IsPlayerIndexLocal
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_IsPlayerIndexLocal final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SnapNetClient_IsPlayerIndexLocal) == 0x000004, "Wrong alignment on SnapNetClient_IsPlayerIndexLocal");
static_assert(sizeof(SnapNetClient_IsPlayerIndexLocal) == 0x000008, "Wrong size on SnapNetClient_IsPlayerIndexLocal");
static_assert(offsetof(SnapNetClient_IsPlayerIndexLocal, PlayerIndex) == 0x000000, "Member 'SnapNetClient_IsPlayerIndexLocal::PlayerIndex' has a wrong offset!");
static_assert(offsetof(SnapNetClient_IsPlayerIndexLocal, ReturnValue) == 0x000004, "Member 'SnapNetClient_IsPlayerIndexLocal::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.IsPlayerIndexSpectatedLocally
// 0x0008 (0x0008 - 0x0000)
struct SnapNetClient_IsPlayerIndexSpectatedLocally final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SnapNetClient_IsPlayerIndexSpectatedLocally) == 0x000004, "Wrong alignment on SnapNetClient_IsPlayerIndexSpectatedLocally");
static_assert(sizeof(SnapNetClient_IsPlayerIndexSpectatedLocally) == 0x000008, "Wrong size on SnapNetClient_IsPlayerIndexSpectatedLocally");
static_assert(offsetof(SnapNetClient_IsPlayerIndexSpectatedLocally, PlayerIndex) == 0x000000, "Member 'SnapNetClient_IsPlayerIndexSpectatedLocally::PlayerIndex' has a wrong offset!");
static_assert(offsetof(SnapNetClient_IsPlayerIndexSpectatedLocally, ReturnValue) == 0x000004, "Member 'SnapNetClient_IsPlayerIndexSpectatedLocally::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.IsPlayingInstantReplay
// 0x0001 (0x0001 - 0x0000)
struct SnapNetClient_IsPlayingInstantReplay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_IsPlayingInstantReplay) == 0x000001, "Wrong alignment on SnapNetClient_IsPlayingInstantReplay");
static_assert(sizeof(SnapNetClient_IsPlayingInstantReplay) == 0x000001, "Wrong size on SnapNetClient_IsPlayingInstantReplay");
static_assert(offsetof(SnapNetClient_IsPlayingInstantReplay, ReturnValue) == 0x000000, "Member 'SnapNetClient_IsPlayingInstantReplay::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClient.IsPlayingReplay
// 0x0001 (0x0001 - 0x0000)
struct SnapNetClient_IsPlayingReplay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClient_IsPlayingReplay) == 0x000001, "Wrong alignment on SnapNetClient_IsPlayingReplay");
static_assert(sizeof(SnapNetClient_IsPlayingReplay) == 0x000001, "Wrong size on SnapNetClient_IsPlayingReplay");
static_assert(offsetof(SnapNetClient_IsPlayingReplay, ReturnValue) == 0x000000, "Member 'SnapNetClient_IsPlayingReplay::ReturnValue' has a wrong offset!");

// Function SnapNet.SnapNetClientConnectAsyncAction.Connect
// 0x0010 (0x0010 - 0x0000)
struct SnapNetClientConnectAsyncAction_Connect final
{
public:
	class USnapNetClient*                         Client;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USnapNetClientConnectAsyncAction*       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SnapNetClientConnectAsyncAction_Connect) == 0x000008, "Wrong alignment on SnapNetClientConnectAsyncAction_Connect");
static_assert(sizeof(SnapNetClientConnectAsyncAction_Connect) == 0x000010, "Wrong size on SnapNetClientConnectAsyncAction_Connect");
