#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Minimap_TimedChest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WBP_MinimapIndicator_Base_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Minimap_TimedChest.WBP_Minimap_TimedChest_C
// 0x0078 (0x0448 - 0x03D0)
class UWBP_Minimap_TimedChest_C final : public UWBP_MinimapIndicator_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Highligth;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTimer;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Timer;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           LocalPlayerColor;                                  // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TeammateColor;                                     // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EnemyColor;                                        // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Increment;                                         // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Scale;                                             // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSecond;                                        // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Texture;                                           // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Minimap_TimedChest(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateTimer(double TimerPercent, int32 TimeRemaining);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Minimap_TimedChest_C">();
	}
	static class UWBP_Minimap_TimedChest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Minimap_TimedChest_C>();
	}
};
static_assert(alignof(UWBP_Minimap_TimedChest_C) == 0x000008, "Wrong alignment on UWBP_Minimap_TimedChest_C");
static_assert(sizeof(UWBP_Minimap_TimedChest_C) == 0x000448, "Wrong size on UWBP_Minimap_TimedChest_C");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Minimap_TimedChest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, Highligth) == 0x0003D8, "Member 'UWBP_Minimap_TimedChest_C::Highligth' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, Icon) == 0x0003E0, "Member 'UWBP_Minimap_TimedChest_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, TextTimer) == 0x0003E8, "Member 'UWBP_Minimap_TimedChest_C::TextTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, Timer) == 0x0003F0, "Member 'UWBP_Minimap_TimedChest_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, LocalPlayerColor) == 0x0003F8, "Member 'UWBP_Minimap_TimedChest_C::LocalPlayerColor' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, TeammateColor) == 0x000408, "Member 'UWBP_Minimap_TimedChest_C::TeammateColor' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, EnemyColor) == 0x000418, "Member 'UWBP_Minimap_TimedChest_C::EnemyColor' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, Increment) == 0x000428, "Member 'UWBP_Minimap_TimedChest_C::Increment' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, Scale) == 0x000430, "Member 'UWBP_Minimap_TimedChest_C::Scale' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, LastSecond) == 0x000438, "Member 'UWBP_Minimap_TimedChest_C::LastSecond' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_TimedChest_C, Texture) == 0x000440, "Member 'UWBP_Minimap_TimedChest_C::Texture' has a wrong offset!");

}

