#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InviteEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_InviteEntry.WBP_InviteEntry_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_InviteEntry_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InviteEntry_C_BindData) == 0x000008, "Wrong alignment on WBP_InviteEntry_C_BindData");
static_assert(sizeof(WBP_InviteEntry_C_BindData) == 0x000008, "Wrong size on WBP_InviteEntry_C_BindData");
static_assert(offsetof(WBP_InviteEntry_C_BindData, NewUIData) == 0x000000, "Member 'WBP_InviteEntry_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_InviteEntry.WBP_InviteEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_InviteEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InviteEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_InviteEntry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_InviteEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_InviteEntry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_InviteEntry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_InviteEntry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_InviteEntry.WBP_InviteEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_InviteEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InviteEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_InviteEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_InviteEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_InviteEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_InviteEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_InviteEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_InviteEntry.WBP_InviteEntry_C.ExecuteUbergraph_WBP_InviteEntry
// 0x0060 (0x0060 - 0x0000)
struct WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_New_Rejectable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerProfileUIData*             K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaPlayerProfileUIData*             K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data_1; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaPlayerProfileUIData*             K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data_2; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaPlayerProfileUIData*             K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data_3; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewAcceptable;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry) == 0x000008, "Wrong alignment on WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry");
static_assert(sizeof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry) == 0x000060, "Wrong size on WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, EntryPoint) == 0x000000, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_CustomEvent_New_Rejectable) == 0x000004, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_CustomEvent_New_Rejectable' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, Temp_byte_Variable) == 0x000005, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, Temp_bool_Variable) == 0x000007, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_Event_bIsExpanded) == 0x00000A, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_Event_bIsSelected) == 0x00000B, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_Event_NewUIData) == 0x000010, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_Event_OldUIData) == 0x000018, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data) == 0x000020, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data_1) == 0x000030, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, Temp_bool_Variable_1) == 0x000039, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_Select_Default) == 0x00003A, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data_2) == 0x000040, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data_2' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data_3) == 0x000050, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_DynamicCast_AsMatcha_Player_Profile_UI_Data_3' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_DynamicCast_bSuccess_3) == 0x000058, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_CustomEvent_NewAcceptable) == 0x000059, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_CustomEvent_NewAcceptable' has a wrong offset!");
static_assert(offsetof(WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry, K2Node_Select_Default_1) == 0x00005A, "Member 'WBP_InviteEntry_C_ExecuteUbergraph_WBP_InviteEntry::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_InviteEntry.WBP_InviteEntry_C.SetAcceptable
// 0x0001 (0x0001 - 0x0000)
struct WBP_InviteEntry_C_SetAcceptable final
{
public:
	bool                                          NewAcceptable;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InviteEntry_C_SetAcceptable) == 0x000001, "Wrong alignment on WBP_InviteEntry_C_SetAcceptable");
static_assert(sizeof(WBP_InviteEntry_C_SetAcceptable) == 0x000001, "Wrong size on WBP_InviteEntry_C_SetAcceptable");
static_assert(offsetof(WBP_InviteEntry_C_SetAcceptable, NewAcceptable) == 0x000000, "Member 'WBP_InviteEntry_C_SetAcceptable::NewAcceptable' has a wrong offset!");

// Function WBP_InviteEntry.WBP_InviteEntry_C.SetRejectable
// 0x0001 (0x0001 - 0x0000)
struct WBP_InviteEntry_C_SetRejectable final
{
public:
	bool                                          New_Rejectable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InviteEntry_C_SetRejectable) == 0x000001, "Wrong alignment on WBP_InviteEntry_C_SetRejectable");
static_assert(sizeof(WBP_InviteEntry_C_SetRejectable) == 0x000001, "Wrong size on WBP_InviteEntry_C_SetRejectable");
static_assert(offsetof(WBP_InviteEntry_C_SetRejectable, New_Rejectable) == 0x000000, "Member 'WBP_InviteEntry_C_SetRejectable::New_Rejectable' has a wrong offset!");

// Function WBP_InviteEntry.WBP_InviteEntry_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_InviteEntry_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InviteEntry_C_UnbindData) == 0x000008, "Wrong alignment on WBP_InviteEntry_C_UnbindData");
static_assert(sizeof(WBP_InviteEntry_C_UnbindData) == 0x000008, "Wrong size on WBP_InviteEntry_C_UnbindData");
static_assert(offsetof(WBP_InviteEntry_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_InviteEntry_C_UnbindData::OldUIData' has a wrong offset!");

}

