#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReceivedInvites

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ReceivedInvites.WBP_ReceivedInvites_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReceivedInvites_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReceivedInvites_C_BindData) == 0x000008, "Wrong alignment on WBP_ReceivedInvites_C_BindData");
static_assert(sizeof(WBP_ReceivedInvites_C_BindData) == 0x000008, "Wrong size on WBP_ReceivedInvites_C_BindData");
static_assert(offsetof(WBP_ReceivedInvites_C_BindData, NewUIData) == 0x000000, "Member 'WBP_ReceivedInvites_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_ReceivedInvites.WBP_ReceivedInvites_C.BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_ReceivedInvites.WBP_ReceivedInvites_C.BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_ReceivedInvites.WBP_ReceivedInvites_C.BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(sizeof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(offsetof(WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ReceivedInvites_C_BndEvt__WBP_ReceivedInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_ReceivedInvites.WBP_ReceivedInvites_C.ExecuteUbergraph_WBP_ReceivedInvites
// 0x0148 (0x0148 - 0x0000)
struct WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMatchaPlayerProfileUIData* PlayerProfileUIData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMatchaPlayerProfileUIData*>     K2Node_CustomEvent_ProfileList;                    // 0x0018(0x0010)(ConstParm, ReferenceParm)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_2;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOdyWidget*                             K2Node_DynamicCast_AsOdy_Widget;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_DynamicCast_AsOdy_UI_Data;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data;  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InviteEntry_Base_C*                K2Node_DynamicCast_AsWBP_Invite_Entry_Base;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerProfileUIData*             K2Node_CustomEvent_PlayerProfileUIData_1;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_InviteEntry_Base_C*                K2Node_DynamicCast_AsWBP_Invite_Entry_Base_1;      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_NameBinding_GetValue_ReturnValue;         // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaPlayerProfileUIData*             K2Node_CustomEvent_PlayerProfileUIData;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_NameBinding_GetValue_ReturnValue_1;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaClientServices*                  CallFunc_GetClientServies_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaClientServices*                  CallFunc_GetClientServies_ReturnValue_1;           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<class UMatchaPlayerProfileUIData*>& ProfileList)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UMatchaPlayerProfileUIData* PlayerProfileUIData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites) == 0x000008, "Wrong alignment on WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites");
static_assert(sizeof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites) == 0x000148, "Wrong size on WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, EntryPoint) == 0x000000, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_CustomEvent_ProfileList) == 0x000018, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_CustomEvent_ProfileList' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_ComponentBoundEvent_Item) == 0x000028, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_ComponentBoundEvent_Widget_2) == 0x000030, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_AsOdy_Widget) == 0x000038, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_AsOdy_Widget' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_AsOdy_UI_Data) == 0x000048, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_AsOdy_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_Event_OldUIData) == 0x000058, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data) == 0x000060, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_Event_NewUIData) == 0x000070, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1) == 0x000078, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_ComponentBoundEvent_Widget_1) == 0x000088, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_AsWBP_Invite_Entry_Base) == 0x000090, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_AsWBP_Invite_Entry_Base' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_bSuccess_4) == 0x000098, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_ComponentBoundEvent_Widget) == 0x0000A0, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_CustomEvent_PlayerProfileUIData_1) == 0x0000A8, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_CustomEvent_PlayerProfileUIData_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_AsWBP_Invite_Entry_Base_1) == 0x0000B0, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_AsWBP_Invite_Entry_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_DynamicCast_bSuccess_5) == 0x0000B8, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_NameBinding_GetValue_ReturnValue) == 0x0000BC, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_NameBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_CustomEvent_PlayerProfileUIData) == 0x0000C8, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_CustomEvent_PlayerProfileUIData' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_Conv_NameToString_ReturnValue) == 0x0000D0, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_Conv_StringToName_ReturnValue) == 0x0000E0, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_NameBinding_GetValue_ReturnValue_1) == 0x0000E8, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_NameBinding_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_GetClientServies_ReturnValue) == 0x0000F0, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_GetClientServies_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0000F8, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000108, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_GetClientServies_ReturnValue_1) == 0x000118, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_GetClientServies_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_CreateDelegate_OutputDelegate_1) == 0x000120, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, CallFunc_IsValid_ReturnValue_1) == 0x000130, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites, K2Node_CreateDelegate_OutputDelegate_2) == 0x000134, "Member 'WBP_ReceivedInvites_C_ExecuteUbergraph_WBP_ReceivedInvites::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_ReceivedInvites.WBP_ReceivedInvites_C.HandleReceivedInvitesUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_ReceivedInvites_C_HandleReceivedInvitesUpdated final
{
public:
	TArray<class UMatchaPlayerProfileUIData*>     ProfileList;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ReceivedInvites_C_HandleReceivedInvitesUpdated) == 0x000008, "Wrong alignment on WBP_ReceivedInvites_C_HandleReceivedInvitesUpdated");
static_assert(sizeof(WBP_ReceivedInvites_C_HandleReceivedInvitesUpdated) == 0x000010, "Wrong size on WBP_ReceivedInvites_C_HandleReceivedInvitesUpdated");
static_assert(offsetof(WBP_ReceivedInvites_C_HandleReceivedInvitesUpdated, ProfileList) == 0x000000, "Member 'WBP_ReceivedInvites_C_HandleReceivedInvitesUpdated::ProfileList' has a wrong offset!");

// Function WBP_ReceivedInvites.WBP_ReceivedInvites_C.OnInviteAccepted
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReceivedInvites_C_OnInviteAccepted final
{
public:
	class UMatchaPlayerProfileUIData*             PlayerProfileUIData;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReceivedInvites_C_OnInviteAccepted) == 0x000008, "Wrong alignment on WBP_ReceivedInvites_C_OnInviteAccepted");
static_assert(sizeof(WBP_ReceivedInvites_C_OnInviteAccepted) == 0x000008, "Wrong size on WBP_ReceivedInvites_C_OnInviteAccepted");
static_assert(offsetof(WBP_ReceivedInvites_C_OnInviteAccepted, PlayerProfileUIData) == 0x000000, "Member 'WBP_ReceivedInvites_C_OnInviteAccepted::PlayerProfileUIData' has a wrong offset!");

// Function WBP_ReceivedInvites.WBP_ReceivedInvites_C.OnInviteRejected
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReceivedInvites_C_OnInviteRejected final
{
public:
	class UMatchaPlayerProfileUIData*             PlayerProfileUIData;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReceivedInvites_C_OnInviteRejected) == 0x000008, "Wrong alignment on WBP_ReceivedInvites_C_OnInviteRejected");
static_assert(sizeof(WBP_ReceivedInvites_C_OnInviteRejected) == 0x000008, "Wrong size on WBP_ReceivedInvites_C_OnInviteRejected");
static_assert(offsetof(WBP_ReceivedInvites_C_OnInviteRejected, PlayerProfileUIData) == 0x000000, "Member 'WBP_ReceivedInvites_C_OnInviteRejected::PlayerProfileUIData' has a wrong offset!");

// Function WBP_ReceivedInvites.WBP_ReceivedInvites_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_ReceivedInvites_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ReceivedInvites_C_UnbindData) == 0x000008, "Wrong alignment on WBP_ReceivedInvites_C_UnbindData");
static_assert(sizeof(WBP_ReceivedInvites_C_UnbindData) == 0x000008, "Wrong size on WBP_ReceivedInvites_C_UnbindData");
static_assert(offsetof(WBP_ReceivedInvites_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_ReceivedInvites_C_UnbindData::OldUIData' has a wrong offset!");

}

