#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Keybinds

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "OdyUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Matcha_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.BndEvt__WBP_LocalPlayerOverlay_AudioSlider_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Keybinds_C_BndEvt__WBP_LocalPlayerOverlay_AudioSlider_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_BndEvt__WBP_LocalPlayerOverlay_AudioSlider_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Menu_Keybinds_C_BndEvt__WBP_LocalPlayerOverlay_AudioSlider_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Keybinds_C_BndEvt__WBP_LocalPlayerOverlay_AudioSlider_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Menu_Keybinds_C_BndEvt__WBP_LocalPlayerOverlay_AudioSlider_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_LocalPlayerOverlay_AudioSlider_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_LocalPlayerOverlay_AudioSlider_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_AutoDashOptionComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.BndEvt__WBP_Menu_Keybinds_EffectsAudioSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_EffectsAudioSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_EffectsAudioSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_EffectsAudioSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_EffectsAudioSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_EffectsAudioSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_EffectsAudioSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_EffectsAudioSlider_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_FrameCapSettingsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_HeavyAttackWithMoveStickComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.BndEvt__WBP_Menu_Keybinds_MusicAudioSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_MusicAudioSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_MusicAudioSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_MusicAudioSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_MusicAudioSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_MusicAudioSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_MusicAudioSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_Menu_Keybinds_MusicAudioSlider_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_AttackStickModeComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_Menu_Keybinds_C_BndEvt__WBP_MenuPause_QualitySettingsComboBox_K2Node_ComponentBoundEvent_9_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.ExecuteUbergraph_WBP_Menu_Keybinds
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& InputDeviceTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_4;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_4;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataLayerSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchaPlayerControllerBase*            K2Node_DynamicCast_AsMatcha_Player_Controller_Base; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInputMappingContext*             CallFunc_GetCurrentInputMappingContext_ReturnValue; // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_3;         // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_3;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaUISubsystem*                     CallFunc_GetUISubsystem_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_InputDeviceTag;                 // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	EOdyNavigationDirection                       K2Node_Event_NavDirection;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUISubsystem*                     CallFunc_GetUISubsystem_ReturnValue_1;             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_2;         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_2;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_1;             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_1;        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_2;             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaSnapNetGameInstance*             CallFunc_GetMatchaSnapNetGameInstance_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsPercent_Float_ReturnValue;              // 0x0108(0x0010)()
	class UDataLayerSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_KeybindEntry_C*                    CallFunc_Create_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsPercent_Float_ReturnValue_1;            // 0x0138(0x0010)()
	class FText                                   CallFunc_AsPercent_Float_ReturnValue_2;            // 0x0148(0x0010)()
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_3;             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            K2Node_Event_Args;                                 // 0x0168(0x0050)(ConstParm)
	class FString                                 K2Node_Event_Action;                               // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EOdyNavigationDirection                       K2Node_Event_NavDirection_1;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_4;             // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_5;             // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEnhancedActionKeyMapping              CallFunc_Array_Get_Item;                           // 0x01F8(0x0050)(ContainsInstancedReference, HasGetValueTypeHash)
	class UPlayerMappableKeySettings*             CallFunc_GetPlayerMappableKeySettings_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EAttackStickMoveType                          Temp_byte_Variable;                                // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttackStickMoveType                          Temp_byte_Variable_1;                              // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0258(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EAttackStickMoveType                          K2Node_Select_Default;                             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_KeybindEntry_C*                    K2Node_DynamicCast_AsWBP_Keybind_Entry;            // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E[0x2];                                      // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_KeybindEntry_C*                    K2Node_CustomEvent_Widget;                         // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsHovered;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_KeybindEntry_C* Widget, bool IsHovered)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_6;             // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFrameRateCap                                 CallFunc_Map_Find_Value;                           // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds) == 0x000008, "Wrong alignment on WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds");
static_assert(sizeof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds) == 0x0002E0, "Wrong size on WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, EntryPoint) == 0x000000, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectedItem_4) == 0x000018, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectedItem_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectionType_4) == 0x000028, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectionType_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetGameUserSettings_ReturnValue) == 0x000030, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_SwitchString_CmpSuccess) == 0x000038, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000040, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_DynamicCast_AsMatcha_Player_Controller_Base) == 0x000050, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_DynamicCast_AsMatcha_Player_Controller_Base' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetCurrentInputMappingContext_ReturnValue) == 0x000060, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetCurrentInputMappingContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_IsValid_ReturnValue_2) == 0x000068, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectedItem_3) == 0x000070, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectedItem_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectionType_3) == 0x000080, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectionType_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Contains_ReturnValue) == 0x000081, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetUIDataModel_ReturnValue) == 0x000088, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetUISubsystem_ReturnValue) == 0x000090, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetUISubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_CustomEvent_InputDeviceTag) == 0x000098, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_CustomEvent_InputDeviceTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_Event_NavDirection) == 0x0000A0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_Event_NavDirection' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetUISubsystem_ReturnValue_1) == 0x0000A8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetUISubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectedItem_2) == 0x0000B0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectedItem_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectionType_2) == 0x0000C0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectionType_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetUIDataModel_ReturnValue_1) == 0x0000C8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetUIDataModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Contains_ReturnValue_1) == 0x0000D0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectedItem_1) == 0x0000D8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectionType_1) == 0x0000E8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectionType_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Contains_ReturnValue_2) == 0x0000E9, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetUIDataModel_ReturnValue_2) == 0x0000F0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetUIDataModel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetMatchaSnapNetGameInstance_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetMatchaSnapNetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_IsValid_ReturnValue_3) == 0x000100, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_Value_2) == 0x000104, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_AsPercent_Float_ReturnValue) == 0x000108, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_AsPercent_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000118, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Create_ReturnValue) == 0x000120, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_AddChild_ReturnValue) == 0x000128, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_Value_1) == 0x000130, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_Value) == 0x000134, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_AsPercent_Float_ReturnValue_1) == 0x000138, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_AsPercent_Float_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_AsPercent_Float_ReturnValue_2) == 0x000148, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_AsPercent_Float_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetUIDataModel_ReturnValue_3) == 0x000158, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetUIDataModel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_IsValid_ReturnValue_4) == 0x000160, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_Event_Args) == 0x000168, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_Event_Args' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_Event_Action) == 0x0001B8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_Event_Action' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_Event_NavDirection_1) == 0x0001C8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_Event_NavDirection_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, Temp_int_Array_Index_Variable) == 0x0001CC, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, Temp_int_Loop_Counter_Variable) == 0x0001D0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetUIDataModel_ReturnValue_4) == 0x0001D8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetUIDataModel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetUIDataModel_ReturnValue_5) == 0x0001E8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetUIDataModel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, Temp_int_Array_Index_Variable_1) == 0x0001F0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetPlayerMappableKeySettings_ReturnValue) == 0x000248, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetPlayerMappableKeySettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, Temp_byte_Variable) == 0x000250, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_IsValid_ReturnValue_5) == 0x000251, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, Temp_byte_Variable_1) == 0x000252, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetAllChildren_ReturnValue) == 0x000258, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Array_Get_Item_1) == 0x000268, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_Select_Default) == 0x000270, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_DynamicCast_AsWBP_Keybind_Entry) == 0x000278, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_DynamicCast_AsWBP_Keybind_Entry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_DynamicCast_bSuccess_1) == 0x000280, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Array_Length_ReturnValue_1) == 0x000284, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, Temp_int_Loop_Counter_Variable_1) == 0x000288, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Less_IntInt_ReturnValue) == 0x00028C, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Less_IntInt_ReturnValue_1) == 0x00028D, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Add_IntInt_ReturnValue_1) == 0x000290, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_CustomEvent_Widget) == 0x000298, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_CustomEvent_IsHovered) == 0x0002A0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_CustomEvent_IsHovered' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002A4, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectedItem) == 0x0002B8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, K2Node_ComponentBoundEvent_SelectionType) == 0x0002C8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_GetUIDataModel_ReturnValue_6) == 0x0002D0, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_GetUIDataModel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Map_Find_Value) == 0x0002D8, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds, CallFunc_Map_Find_ReturnValue) == 0x0002D9, "Member 'WBP_Menu_Keybinds_C_ExecuteUbergraph_WBP_Menu_Keybinds::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.OnEntryHoveredChanged_Event
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Keybinds_C_OnEntryHoveredChanged_Event final
{
public:
	class UWBP_KeybindEntry_C*                    Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHovered_0;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_OnEntryHoveredChanged_Event) == 0x000008, "Wrong alignment on WBP_Menu_Keybinds_C_OnEntryHoveredChanged_Event");
static_assert(sizeof(WBP_Menu_Keybinds_C_OnEntryHoveredChanged_Event) == 0x000010, "Wrong size on WBP_Menu_Keybinds_C_OnEntryHoveredChanged_Event");
static_assert(offsetof(WBP_Menu_Keybinds_C_OnEntryHoveredChanged_Event, Widget) == 0x000000, "Member 'WBP_Menu_Keybinds_C_OnEntryHoveredChanged_Event::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_OnEntryHoveredChanged_Event, IsHovered_0) == 0x000008, "Member 'WBP_Menu_Keybinds_C_OnEntryHoveredChanged_Event::IsHovered_0' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.OnInputDeviceChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Keybinds_C_OnInputDeviceChanged final
{
public:
	struct FGameplayTag                           InputDeviceTag;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_OnInputDeviceChanged) == 0x000004, "Wrong alignment on WBP_Menu_Keybinds_C_OnInputDeviceChanged");
static_assert(sizeof(WBP_Menu_Keybinds_C_OnInputDeviceChanged) == 0x000008, "Wrong size on WBP_Menu_Keybinds_C_OnInputDeviceChanged");
static_assert(offsetof(WBP_Menu_Keybinds_C_OnInputDeviceChanged, InputDeviceTag) == 0x000000, "Member 'WBP_Menu_Keybinds_C_OnInputDeviceChanged::InputDeviceTag' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.OnNavigatedAway
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Keybinds_C_OnNavigatedAway final
{
public:
	EOdyNavigationDirection                       NavDirection;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_OnNavigatedAway) == 0x000001, "Wrong alignment on WBP_Menu_Keybinds_C_OnNavigatedAway");
static_assert(sizeof(WBP_Menu_Keybinds_C_OnNavigatedAway) == 0x000001, "Wrong size on WBP_Menu_Keybinds_C_OnNavigatedAway");
static_assert(offsetof(WBP_Menu_Keybinds_C_OnNavigatedAway, NavDirection) == 0x000000, "Member 'WBP_Menu_Keybinds_C_OnNavigatedAway::NavDirection' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.OnNavigatedTo
// 0x0068 (0x0068 - 0x0000)
struct WBP_Menu_Keybinds_C_OnNavigatedTo final
{
public:
	TMap<class FString, class FString>            Args;                                              // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Action;                                            // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EOdyNavigationDirection                       NavDirection;                                      // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keybinds_C_OnNavigatedTo) == 0x000008, "Wrong alignment on WBP_Menu_Keybinds_C_OnNavigatedTo");
static_assert(sizeof(WBP_Menu_Keybinds_C_OnNavigatedTo) == 0x000068, "Wrong size on WBP_Menu_Keybinds_C_OnNavigatedTo");
static_assert(offsetof(WBP_Menu_Keybinds_C_OnNavigatedTo, Args) == 0x000000, "Member 'WBP_Menu_Keybinds_C_OnNavigatedTo::Args' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_OnNavigatedTo, Action) == 0x000050, "Member 'WBP_Menu_Keybinds_C_OnNavigatedTo::Action' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keybinds_C_OnNavigatedTo, NavDirection) == 0x000060, "Member 'WBP_Menu_Keybinds_C_OnNavigatedTo::NavDirection' has a wrong offset!");

// Function WBP_Menu_Keybinds.WBP_Menu_Keybinds_C.UpdateKeybindActionsVisibility
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Keybinds_C_UpdateKeybindActionsVisibility final
{
public:
	bool                                          WidgetWasHovered;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
