#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpawnRegion_PlayerIcon

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_BindData) == 0x000008, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_BindData");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_BindData) == 0x000008, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_BindData");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_BindData, NewUIData) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.CurrentSelectedRegionChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_CurrentSelectedRegionChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_CurrentSelectedRegionChanged) == 0x000004, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_CurrentSelectedRegionChanged");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_CurrentSelectedRegionChanged) == 0x000008, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_CurrentSelectedRegionChanged");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_CurrentSelectedRegionChanged, OldValue) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_CurrentSelectedRegionChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_CurrentSelectedRegionChanged, NewValue) == 0x000004, "Member 'WBP_SpawnRegion_PlayerIcon_C_CurrentSelectedRegionChanged::NewValue' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_CustomEvent final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_CustomEvent) == 0x000004, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_CustomEvent");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_CustomEvent) == 0x000008, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_CustomEvent");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_CustomEvent, OldValue) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_CustomEvent::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_CustomEvent, NewValue) == 0x000004, "Member 'WBP_SpawnRegion_PlayerIcon_C_CustomEvent::NewValue' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowIcon_ShouldShow;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture* OldValue, class UTexture* NewValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue_2;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_2;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerUIData*                    K2Node_DynamicCast_AsMatcha_Player_UI_Data;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerUIData*                    K2Node_DynamicCast_AsMatcha_Player_UI_Data_1;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue_1;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_1;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_CustomEvent_OldValue;                       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_CustomEvent_NewValue;                       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerUIData*                    K2Node_DynamicCast_AsMatcha_Player_UI_Data_2;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue;         // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon) == 0x000008, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon) == 0x0000E0, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, EntryPoint) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, CallFunc_ShouldShowIcon_ShouldShow) == 0x000004, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::CallFunc_ShouldShowIcon_ShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_Event_NewUIData) == 0x000028, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_CustomEvent_OldValue_2) == 0x000030, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_CustomEvent_OldValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_CustomEvent_NewValue_2) == 0x000034, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_CustomEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_DynamicCast_AsMatcha_Player_UI_Data) == 0x000038, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_DynamicCast_AsMatcha_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_Event_OldUIData) == 0x000048, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_DynamicCast_AsMatcha_Player_UI_Data_1) == 0x000050, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_DynamicCast_AsMatcha_Player_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, Temp_struct_Variable) == 0x00005C, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000070, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, Temp_struct_Variable_1) == 0x000078, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_CustomEvent_OldValue_1) == 0x000088, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_CustomEvent_NewValue_1) == 0x00008C, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, Temp_bool_Variable) == 0x000090, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_CustomEvent_OldValue) == 0x000098, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_CustomEvent_NewValue) == 0x0000A0, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, CallFunc_GetUIData_ReturnValue) == 0x0000B8, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_DynamicCast_AsMatcha_Player_UI_Data_2) == 0x0000C0, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_DynamicCast_AsMatcha_Player_UI_Data_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, CallFunc_BoolBinding_GetValue_ReturnValue) == 0x0000C9, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::CallFunc_BoolBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon, K2Node_Select_Default) == 0x0000CC, "Member 'WBP_SpawnRegion_PlayerIcon_C_ExecuteUbergraph_WBP_SpawnRegion_PlayerIcon::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.Initialize
// 0x000C (0x000C - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_Initialize final
{
public:
	ESpawnRegion                                  SpawnRegion_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TeamNumber;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceShowIcon_0;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_Initialize) == 0x000004, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_Initialize");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_Initialize) == 0x00000C, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_Initialize");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_Initialize, SpawnRegion_0) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_Initialize::SpawnRegion_0' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_Initialize, TeamNumber) == 0x000004, "Member 'WBP_SpawnRegion_PlayerIcon_C_Initialize::TeamNumber' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_Initialize, ForceShowIcon_0) == 0x000008, "Member 'WBP_SpawnRegion_PlayerIcon_C_Initialize::ForceShowIcon_0' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.IsPlayerOnSpectatedTeam
// 0x0028 (0x0028 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam final
{
public:
	bool                                          IsOnSpectatedTeam;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerUIData*                    K2Node_DynamicCast_AsMatcha_Player_UI_Data;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam) == 0x000008, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam) == 0x000028, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam, IsOnSpectatedTeam) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam::IsOnSpectatedTeam' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam, CallFunc_GetUIData_ReturnValue) == 0x000008, "Member 'WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam, K2Node_DynamicCast_AsMatcha_Player_UI_Data) == 0x000010, "Member 'WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam::K2Node_DynamicCast_AsMatcha_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam, CallFunc_IntBinding_GetValue_ReturnValue) == 0x00001C, "Member 'WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam::CallFunc_IntBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_SpawnRegion_PlayerIcon_C_IsPlayerOnSpectatedTeam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.PlayerSelectedThisRegion
// 0x0028 (0x0028 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion final
{
public:
	bool                                          IsInSameRegion;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerUIData*                    K2Node_DynamicCast_AsMatcha_Player_UI_Data;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion) == 0x000008, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion) == 0x000028, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion, IsInSameRegion) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion::IsInSameRegion' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion, CallFunc_GetUIData_ReturnValue) == 0x000008, "Member 'WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion, K2Node_DynamicCast_AsMatcha_Player_UI_Data) == 0x000010, "Member 'WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion::K2Node_DynamicCast_AsMatcha_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion, CallFunc_IntBinding_GetValue_ReturnValue) == 0x00001C, "Member 'WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion::CallFunc_IntBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion, CallFunc_Conv_IntToByte_ReturnValue) == 0x000020, "Member 'WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion, CallFunc_GetValidValue_ReturnValue) == 0x000021, "Member 'WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000022, "Member 'WBP_SpawnRegion_PlayerIcon_C_PlayerSelectedThisRegion::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.Portrait Changed
// 0x0010 (0x0010 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_Portrait_Changed final
{
public:
	class UTexture*                               OldValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               NewValue;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_Portrait_Changed) == 0x000008, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_Portrait_Changed");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_Portrait_Changed) == 0x000010, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_Portrait_Changed");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_Portrait_Changed, OldValue) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_Portrait_Changed::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_Portrait_Changed, NewValue) == 0x000008, "Member 'WBP_SpawnRegion_PlayerIcon_C_Portrait_Changed::NewValue' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.SetSpectatedPlayerTeamNumber
// 0x0004 (0x0004 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_SetSpectatedPlayerTeamNumber final
{
public:
	int32                                         NewTeamNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_SetSpectatedPlayerTeamNumber) == 0x000004, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_SetSpectatedPlayerTeamNumber");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_SetSpectatedPlayerTeamNumber) == 0x000004, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_SetSpectatedPlayerTeamNumber");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_SetSpectatedPlayerTeamNumber, NewTeamNumber) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_SetSpectatedPlayerTeamNumber::NewTeamNumber' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.ShouldShowIcon
// 0x0030 (0x0030 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon final
{
public:
	bool                                          ShouldShow;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerOnSpectatedTeam_IsOnSpectatedTeam; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaPlayerUIData*                    K2Node_DynamicCast_AsMatcha_Player_UI_Data;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerOnSpectatedTeam_IsOnSpectatedTeam_1; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerSelectedThisRegion_IsInSameRegion;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon) == 0x000008, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon) == 0x000030, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, ShouldShow) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::ShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, CallFunc_GetUIData_ReturnValue) == 0x000008, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, CallFunc_IsPlayerOnSpectatedTeam_IsOnSpectatedTeam) == 0x000010, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::CallFunc_IsPlayerOnSpectatedTeam_IsOnSpectatedTeam' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, K2Node_DynamicCast_AsMatcha_Player_UI_Data) == 0x000018, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::K2Node_DynamicCast_AsMatcha_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, CallFunc_IsPlayerOnSpectatedTeam_IsOnSpectatedTeam_1) == 0x000021, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::CallFunc_IsPlayerOnSpectatedTeam_IsOnSpectatedTeam_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, CallFunc_IntBinding_GetValue_ReturnValue) == 0x000024, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::CallFunc_IntBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, CallFunc_PlayerSelectedThisRegion_IsInSameRegion) == 0x000028, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::CallFunc_PlayerSelectedThisRegion_IsInSameRegion' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000029, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon, CallFunc_BooleanAND_ReturnValue_1) == 0x00002B, "Member 'WBP_SpawnRegion_PlayerIcon_C_ShouldShowIcon::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_SpawnRegion_PlayerIcon.WBP_SpawnRegion_PlayerIcon_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpawnRegion_PlayerIcon_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_PlayerIcon_C_UnbindData) == 0x000008, "Wrong alignment on WBP_SpawnRegion_PlayerIcon_C_UnbindData");
static_assert(sizeof(WBP_SpawnRegion_PlayerIcon_C_UnbindData) == 0x000008, "Wrong size on WBP_SpawnRegion_PlayerIcon_C_UnbindData");
static_assert(offsetof(WBP_SpawnRegion_PlayerIcon_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_SpawnRegion_PlayerIcon_C_UnbindData::OldUIData' has a wrong offset!");

}

