#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ingame_MatchTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Ingame_MatchTimer.WBP_Ingame_MatchTimer_C
// 0x0040 (0x03D8 - 0x0398)
class UWBP_Ingame_MatchTimer_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_MatchTimer_C*                      MatchTimer;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchaZoneUIData*                      BoundZoneUIData;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShrinking;                                       // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TimerThresholdColor;                               // 0x03B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TimerDefaultDecorativeColor;                       // 0x03C4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void BindZoneUIData(class UMatchaZoneUIData* NewZoneUIData);
	void ExecuteUbergraph_WBP_Ingame_MatchTimer(int32 EntryPoint);
	class FText GetTimerTextValue(double CurrentTimerTime);
	void OnIsShrinkingChanged(bool OldValue, bool NewValue);
	void OnMatchPhaseChanged(int32 OldValue, int32 NewValue);
	void OnMatchStartTimerChanged(const struct FTimespan& OldValue, const struct FTimespan& NewValue);
	void OnSecondsUntilShrinkComplete(float OldValue, float NewValue);
	void OnSecondUntilShrinkChange(float OldValue, float NewValue);
	void SetTimerVisual(double CurrentTimerTime);
	void UnbindData(class UOdyUIData* OldUIData);
	void UnbindZoneUIData(class UMatchaZoneUIData* ZoneUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Ingame_MatchTimer_C">();
	}
	static class UWBP_Ingame_MatchTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Ingame_MatchTimer_C>();
	}
};
static_assert(alignof(UWBP_Ingame_MatchTimer_C) == 0x000008, "Wrong alignment on UWBP_Ingame_MatchTimer_C");
static_assert(sizeof(UWBP_Ingame_MatchTimer_C) == 0x0003D8, "Wrong size on UWBP_Ingame_MatchTimer_C");
static_assert(offsetof(UWBP_Ingame_MatchTimer_C, UberGraphFrame) == 0x000398, "Member 'UWBP_Ingame_MatchTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_MatchTimer_C, MatchTimer) == 0x0003A0, "Member 'UWBP_Ingame_MatchTimer_C::MatchTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_MatchTimer_C, BoundZoneUIData) == 0x0003A8, "Member 'UWBP_Ingame_MatchTimer_C::BoundZoneUIData' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_MatchTimer_C, IsShrinking) == 0x0003B0, "Member 'UWBP_Ingame_MatchTimer_C::IsShrinking' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_MatchTimer_C, TimerThresholdColor) == 0x0003B4, "Member 'UWBP_Ingame_MatchTimer_C::TimerThresholdColor' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_MatchTimer_C, TimerDefaultDecorativeColor) == 0x0003C4, "Member 'UWBP_Ingame_MatchTimer_C::TimerDefaultDecorativeColor' has a wrong offset!");

}

