#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDFeedback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUDFeedback.WBP_HUDFeedback_C
// 0x0028 (0x03C0 - 0x0398)
class UWBP_HUDFeedback_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Border;                                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SuddenDeath;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Motion_SuddenDeath_C*              WBP_Motion_SuddenDeath;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          LastStandStatus;                                   // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HUDFeedback(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUDFeedback_C">();
	}
	static class UWBP_HUDFeedback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUDFeedback_C>();
	}
};
static_assert(alignof(UWBP_HUDFeedback_C) == 0x000008, "Wrong alignment on UWBP_HUDFeedback_C");
static_assert(sizeof(UWBP_HUDFeedback_C) == 0x0003C0, "Wrong size on UWBP_HUDFeedback_C");
static_assert(offsetof(UWBP_HUDFeedback_C, UberGraphFrame) == 0x000398, "Member 'UWBP_HUDFeedback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUDFeedback_C, Border) == 0x0003A0, "Member 'UWBP_HUDFeedback_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_HUDFeedback_C, SuddenDeath) == 0x0003A8, "Member 'UWBP_HUDFeedback_C::SuddenDeath' has a wrong offset!");
static_assert(offsetof(UWBP_HUDFeedback_C, WBP_Motion_SuddenDeath) == 0x0003B0, "Member 'UWBP_HUDFeedback_C::WBP_Motion_SuddenDeath' has a wrong offset!");
static_assert(offsetof(UWBP_HUDFeedback_C, LastStandStatus) == 0x0003B8, "Member 'UWBP_HUDFeedback_C::LastStandStatus' has a wrong offset!");

}

