#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TeammateUI_TeamInfo

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TeammateUI_TeamInfo.WBP_TeammateUI_TeamInfo_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_TeammateUI_TeamInfo_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TeammateUI_TeamInfo_C_BindData) == 0x000008, "Wrong alignment on WBP_TeammateUI_TeamInfo_C_BindData");
static_assert(sizeof(WBP_TeammateUI_TeamInfo_C_BindData) == 0x000008, "Wrong size on WBP_TeammateUI_TeamInfo_C_BindData");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_BindData, NewUIData) == 0x000000, "Member 'WBP_TeammateUI_TeamInfo_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_TeammateUI_TeamInfo.WBP_TeammateUI_TeamInfo_C.ChangeTeamNumber
// 0x0008 (0x0008 - 0x0000)
struct WBP_TeammateUI_TeamInfo_C_ChangeTeamNumber final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TeammateUI_TeamInfo_C_ChangeTeamNumber) == 0x000004, "Wrong alignment on WBP_TeammateUI_TeamInfo_C_ChangeTeamNumber");
static_assert(sizeof(WBP_TeammateUI_TeamInfo_C_ChangeTeamNumber) == 0x000008, "Wrong size on WBP_TeammateUI_TeamInfo_C_ChangeTeamNumber");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ChangeTeamNumber, OldValue) == 0x000000, "Member 'WBP_TeammateUI_TeamInfo_C_ChangeTeamNumber::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ChangeTeamNumber, NewValue) == 0x000004, "Member 'WBP_TeammateUI_TeamInfo_C_ChangeTeamNumber::NewValue' has a wrong offset!");

// Function WBP_TeammateUI_TeamInfo.WBP_TeammateUI_TeamInfo_C.ExecuteUbergraph_WBP_TeammateUI_TeamInfo
// 0x0060 (0x0060 - 0x0000)
struct WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	class UMatchaPlayerUIData*                    K2Node_DynamicCast_AsMatcha_Player_UI_Data;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerUIData*                    K2Node_DynamicCast_AsMatcha_Player_UI_Data_1;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo) == 0x000008, "Wrong alignment on WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo");
static_assert(sizeof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo) == 0x000060, "Wrong size on WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, EntryPoint) == 0x000000, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, K2Node_CustomEvent_OldValue) == 0x000004, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, K2Node_CustomEvent_NewValue) == 0x000008, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, K2Node_Event_OldUIData) == 0x000010, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, K2Node_DynamicCast_AsMatcha_Player_UI_Data) == 0x000028, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::K2Node_DynamicCast_AsMatcha_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, K2Node_Event_NewUIData) == 0x000038, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, K2Node_DynamicCast_AsMatcha_Player_UI_Data_1) == 0x000040, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::K2Node_DynamicCast_AsMatcha_Player_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'WBP_TeammateUI_TeamInfo_C_ExecuteUbergraph_WBP_TeammateUI_TeamInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_TeammateUI_TeamInfo.WBP_TeammateUI_TeamInfo_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_TeammateUI_TeamInfo_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TeammateUI_TeamInfo_C_UnbindData) == 0x000008, "Wrong alignment on WBP_TeammateUI_TeamInfo_C_UnbindData");
static_assert(sizeof(WBP_TeammateUI_TeamInfo_C_UnbindData) == 0x000008, "Wrong size on WBP_TeammateUI_TeamInfo_C_UnbindData");
static_assert(offsetof(WBP_TeammateUI_TeamInfo_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_TeammateUI_TeamInfo_C_UnbindData::OldUIData' has a wrong offset!");

}

