#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpawnRegionMap

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpawnRegionMap.WBP_SpawnRegionMap_C
// 0x0188 (0x0520 - 0x0398)
class UWBP_SpawnRegionMap_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_SpawnRegion_Mark_C*                Arcade;                                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                Beach;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                Biosphere;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                Casino;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                ClarionCorp;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                CorestrikeArena;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                Factory;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                FloatingForest;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_HackPlace_C*           Hack_ArcShield;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_HackPlace_C*           Hack_CoreStrikeGlove;                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_HackPlace_C*           Hack_CrystalRose;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_HackPlace_C*           Hack_JumpPack;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Hacks;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                KaisTower;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                ObeliskOfLight;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                OniMountain;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                ParkingGarage;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RegionsContainer;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                Sewers;                                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                ShoppingCenter;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegion_Mark_C*                SkyLab;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Minimap_VaultIndicator_C*          WBP_Minimap_VaultIndicator;                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Minimap_VaultIndicator_C*          WBP_Minimap_VaultIndicator_2;                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Minimap_VaultIndicator_C*          WBP_Minimap_VaultIndicator_3;                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WorldMap;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<ESpawnRegion, class UWBP_SpawnRegion_Mark_C*> SpawnRegionMapping;                                // 0x0470(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMatchaPlayerUIData*>            PlayersData;                                       // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EHackType, class UWBP_SpawnRegion_HackPlace_C*> HackLocationWidgets;                               // 0x04D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BindData(class UOdyUIData* NewUIData);
	void Cache_Available_Spawn_Region_Widgets(TArray<ESpawnRegion>& AvailableSpawnRegions);
	void CacheHackLocationWidgets();
	void ClearPlayers();
	void Construct();
	void ExecuteUbergraph_WBP_SpawnRegionMap(int32 EntryPoint);
	void OnAvailableHacksChanged();
	void OnInitialized();
	void OnUIDataSet(class UOdyUIData* NewUIData);
	void PreConstruct(bool IsDesignTime);
	void UnbindData(class UOdyUIData* OldUIData);
	void Update_Available_Hacks(class UMatchaGameWorldUIData* WorldUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpawnRegionMap_C">();
	}
	static class UWBP_SpawnRegionMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpawnRegionMap_C>();
	}
};
static_assert(alignof(UWBP_SpawnRegionMap_C) == 0x000008, "Wrong alignment on UWBP_SpawnRegionMap_C");
static_assert(sizeof(UWBP_SpawnRegionMap_C) == 0x000520, "Wrong size on UWBP_SpawnRegionMap_C");
static_assert(offsetof(UWBP_SpawnRegionMap_C, UberGraphFrame) == 0x000398, "Member 'UWBP_SpawnRegionMap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Arcade) == 0x0003A0, "Member 'UWBP_SpawnRegionMap_C::Arcade' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Beach) == 0x0003A8, "Member 'UWBP_SpawnRegionMap_C::Beach' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, BG) == 0x0003B0, "Member 'UWBP_SpawnRegionMap_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Biosphere) == 0x0003B8, "Member 'UWBP_SpawnRegionMap_C::Biosphere' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Casino) == 0x0003C0, "Member 'UWBP_SpawnRegionMap_C::Casino' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, ClarionCorp) == 0x0003C8, "Member 'UWBP_SpawnRegionMap_C::ClarionCorp' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, CorestrikeArena) == 0x0003D0, "Member 'UWBP_SpawnRegionMap_C::CorestrikeArena' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Factory) == 0x0003D8, "Member 'UWBP_SpawnRegionMap_C::Factory' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, FloatingForest) == 0x0003E0, "Member 'UWBP_SpawnRegionMap_C::FloatingForest' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Hack_ArcShield) == 0x0003E8, "Member 'UWBP_SpawnRegionMap_C::Hack_ArcShield' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Hack_CoreStrikeGlove) == 0x0003F0, "Member 'UWBP_SpawnRegionMap_C::Hack_CoreStrikeGlove' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Hack_CrystalRose) == 0x0003F8, "Member 'UWBP_SpawnRegionMap_C::Hack_CrystalRose' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Hack_JumpPack) == 0x000400, "Member 'UWBP_SpawnRegionMap_C::Hack_JumpPack' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Hacks) == 0x000408, "Member 'UWBP_SpawnRegionMap_C::Hacks' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, KaisTower) == 0x000410, "Member 'UWBP_SpawnRegionMap_C::KaisTower' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, ObeliskOfLight) == 0x000418, "Member 'UWBP_SpawnRegionMap_C::ObeliskOfLight' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, OniMountain) == 0x000420, "Member 'UWBP_SpawnRegionMap_C::OniMountain' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, ParkingGarage) == 0x000428, "Member 'UWBP_SpawnRegionMap_C::ParkingGarage' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, RegionsContainer) == 0x000430, "Member 'UWBP_SpawnRegionMap_C::RegionsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, Sewers) == 0x000438, "Member 'UWBP_SpawnRegionMap_C::Sewers' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, ShoppingCenter) == 0x000440, "Member 'UWBP_SpawnRegionMap_C::ShoppingCenter' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, SkyLab) == 0x000448, "Member 'UWBP_SpawnRegionMap_C::SkyLab' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, WBP_Minimap_VaultIndicator) == 0x000450, "Member 'UWBP_SpawnRegionMap_C::WBP_Minimap_VaultIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, WBP_Minimap_VaultIndicator_2) == 0x000458, "Member 'UWBP_SpawnRegionMap_C::WBP_Minimap_VaultIndicator_2' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, WBP_Minimap_VaultIndicator_3) == 0x000460, "Member 'UWBP_SpawnRegionMap_C::WBP_Minimap_VaultIndicator_3' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, WorldMap) == 0x000468, "Member 'UWBP_SpawnRegionMap_C::WorldMap' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, SpawnRegionMapping) == 0x000470, "Member 'UWBP_SpawnRegionMap_C::SpawnRegionMapping' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, PlayersData) == 0x0004C0, "Member 'UWBP_SpawnRegionMap_C::PlayersData' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnRegionMap_C, HackLocationWidgets) == 0x0004D0, "Member 'UWBP_SpawnRegionMap_C::HackLocationWidgets' has a wrong offset!");

}

