#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_SocialHub

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_SocialHub.WBP_Menu_SocialHub_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_SocialHub_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_SocialHub_C_BindData) == 0x000008, "Wrong alignment on WBP_Menu_SocialHub_C_BindData");
static_assert(sizeof(WBP_Menu_SocialHub_C_BindData) == 0x000008, "Wrong size on WBP_Menu_SocialHub_C_BindData");
static_assert(offsetof(WBP_Menu_SocialHub_C_BindData, NewUIData) == 0x000000, "Member 'WBP_Menu_SocialHub_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_Menu_SocialHub.WBP_Menu_SocialHub_C.BndEvt__WBP_LocalPlayerOverlay_ImguiButton_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_SocialHub_C_BndEvt__WBP_LocalPlayerOverlay_ImguiButton_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_SocialHub_C_BndEvt__WBP_LocalPlayerOverlay_ImguiButton_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Menu_SocialHub_C_BndEvt__WBP_LocalPlayerOverlay_ImguiButton_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Menu_SocialHub_C_BndEvt__WBP_LocalPlayerOverlay_ImguiButton_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_Menu_SocialHub_C_BndEvt__WBP_LocalPlayerOverlay_ImguiButton_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Menu_SocialHub_C_BndEvt__WBP_LocalPlayerOverlay_ImguiButton_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_Menu_SocialHub_C_BndEvt__WBP_LocalPlayerOverlay_ImguiButton_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_Menu_SocialHub.WBP_Menu_SocialHub_C.ExecuteUbergraph_WBP_Menu_SocialHub
// 0x01E0 (0x01E0 - 0x0000)
struct WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0018(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_1;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data;  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_OldValue_1;                     // 0x00A8(0x0010)()
	class FText                                   K2Node_CustomEvent_NewValue_1;                     // 0x00B8(0x0010)()
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchaSnapNetPlayerController*         K2Node_DynamicCast_AsMatcha_Snap_Net_Player_Controller; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0110(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0138(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_OldValue;                       // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_2;             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextBinding_GetValue_ReturnValue;         // 0x0168(0x0010)()
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_3;             // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_4;             // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_5;             // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_6;             // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MatchaLocalPlayerUIData_C*          K2Node_DynamicCast_AsBP_Matcha_Local_Player_UI_Data; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MatchaLocalPlayerUIData_C*          K2Node_DynamicCast_AsBP_Matcha_Local_Player_UI_Data_1; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText OldValue, class FText NewValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub) == 0x000008, "Wrong alignment on WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub");
static_assert(sizeof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub) == 0x0001E0, "Wrong size on WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, EntryPoint) == 0x000000, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_GetUIDataModel_ReturnValue) == 0x000008, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_bool_Variable) == 0x000010, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000018, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000038, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00003C, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000040, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000048, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_object_Variable) == 0x000050, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_real_Variable) == 0x000058, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_real_Variable_0) == 0x000060, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_real_Variable_1) == 0x000068, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_bool_Variable_1) == 0x000070, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_real_Variable_1_0) == 0x000078, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_GetUIDataModel_ReturnValue_1) == 0x000080, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_GetUIDataModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_Event_NewUIData) == 0x000088, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data) == 0x000090, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_Event_OldUIData) == 0x0000A0, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_CustomEvent_OldValue_1) == 0x0000A8, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_CustomEvent_NewValue_1) == 0x0000B8, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1) == 0x0000C8, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_real_Variable_2) == 0x0000D8, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_real_Variable_3) == 0x0000E0, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_ComponentBoundEvent_bIsChecked) == 0x0000E8, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_GetPlayerController_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_object_Variable_1) == 0x0000F8, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_AsMatcha_Snap_Net_Player_Controller) == 0x000100, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_AsMatcha_Snap_Net_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000110, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000130, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000134, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000138, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_real_Variable_3_0) == 0x000140, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, Temp_real_Variable_2_0) == 0x000148, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000150, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_CustomEvent_OldValue) == 0x000154, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_CustomEvent_NewValue) == 0x000158, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_GetUIDataModel_ReturnValue_2) == 0x000160, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_GetUIDataModel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_TextBinding_GetValue_ReturnValue) == 0x000168, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_TextBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_IntBinding_GetValue_ReturnValue) == 0x000178, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_IntBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_GetUIDataModel_ReturnValue_3) == 0x000180, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_GetUIDataModel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_GetUIDataModel_ReturnValue_4) == 0x000188, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_GetUIDataModel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_GetUIDataModel_ReturnValue_5) == 0x000190, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_GetUIDataModel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, CallFunc_GetUIDataModel_ReturnValue_6) == 0x000198, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::CallFunc_GetUIDataModel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_AsBP_Matcha_Local_Player_UI_Data) == 0x0001A0, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_AsBP_Matcha_Local_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_bSuccess_3) == 0x0001A8, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_AsBP_Matcha_Local_Player_UI_Data_1) == 0x0001B0, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_AsBP_Matcha_Local_Player_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_DynamicCast_bSuccess_4) == 0x0001B8, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_CreateDelegate_OutputDelegate) == 0x0001BC, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001CC, "Member 'WBP_Menu_SocialHub_C_ExecuteUbergraph_WBP_Menu_SocialHub::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_Menu_SocialHub.WBP_Menu_SocialHub_C.InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Menu_SocialHub_C_InpActEvt_IA_SwitchMode_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Menu_SocialHub.WBP_Menu_SocialHub_C.InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_Menu_SocialHub_C_InpActEvt_IA_UI_Queue_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_Menu_SocialHub.WBP_Menu_SocialHub_C.OnPlayerNameChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_SocialHub_C_OnPlayerNameChanged final
{
public:
	class FText                                   OldValue;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NewValue;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_SocialHub_C_OnPlayerNameChanged) == 0x000008, "Wrong alignment on WBP_Menu_SocialHub_C_OnPlayerNameChanged");
static_assert(sizeof(WBP_Menu_SocialHub_C_OnPlayerNameChanged) == 0x000020, "Wrong size on WBP_Menu_SocialHub_C_OnPlayerNameChanged");
static_assert(offsetof(WBP_Menu_SocialHub_C_OnPlayerNameChanged, OldValue) == 0x000000, "Member 'WBP_Menu_SocialHub_C_OnPlayerNameChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_OnPlayerNameChanged, NewValue) == 0x000010, "Member 'WBP_Menu_SocialHub_C_OnPlayerNameChanged::NewValue' has a wrong offset!");

// Function WBP_Menu_SocialHub.WBP_Menu_SocialHub_C.TeamNumberChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_SocialHub_C_TeamNumberChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_SocialHub_C_TeamNumberChanged) == 0x000004, "Wrong alignment on WBP_Menu_SocialHub_C_TeamNumberChanged");
static_assert(sizeof(WBP_Menu_SocialHub_C_TeamNumberChanged) == 0x000008, "Wrong size on WBP_Menu_SocialHub_C_TeamNumberChanged");
static_assert(offsetof(WBP_Menu_SocialHub_C_TeamNumberChanged, OldValue) == 0x000000, "Member 'WBP_Menu_SocialHub_C_TeamNumberChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_SocialHub_C_TeamNumberChanged, NewValue) == 0x000004, "Member 'WBP_Menu_SocialHub_C_TeamNumberChanged::NewValue' has a wrong offset!");

// Function WBP_Menu_SocialHub.WBP_Menu_SocialHub_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_SocialHub_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_SocialHub_C_UnbindData) == 0x000008, "Wrong alignment on WBP_Menu_SocialHub_C_UnbindData");
static_assert(sizeof(WBP_Menu_SocialHub_C_UnbindData) == 0x000008, "Wrong size on WBP_Menu_SocialHub_C_UnbindData");
static_assert(offsetof(WBP_Menu_SocialHub_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_Menu_SocialHub_C_UnbindData::OldUIData' has a wrong offset!");

}

