#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_ModeOption

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OdyUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_ModeOption.WBP_MainMenu_ModeOption_C
// 0x0108 (0x04A0 - 0x0398)
class UWBP_MainMenu_ModeOption_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Mode;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextOption;                                        // 0x03B8(0x0010)(Edit, BlueprintVisible)
	struct FMargin                                PaddingOption;                                     // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DebugIsSelected;                                   // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         FontSelected;                                      // 0x03E0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         FontNormal;                                        // 0x0440(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ChangeState(bool IsSelected);
	void ExecuteUbergraph_WBP_MainMenu_ModeOption(int32 EntryPoint);
	void OnSelectedQueueIdChanged(class FName OldValue, class FName NewValue);
	void PreConstruct(bool IsDesignTime);
	void UnbindData(class UOdyUIData* OldUIData);
	void UpdateSelectionState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_ModeOption_C">();
	}
	static class UWBP_MainMenu_ModeOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_ModeOption_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_ModeOption_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_ModeOption_C");
static_assert(sizeof(UWBP_MainMenu_ModeOption_C) == 0x0004A0, "Wrong size on UWBP_MainMenu_ModeOption_C");
static_assert(offsetof(UWBP_MainMenu_ModeOption_C, UberGraphFrame) == 0x000398, "Member 'UWBP_MainMenu_ModeOption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_ModeOption_C, HorizontalBox) == 0x0003A0, "Member 'UWBP_MainMenu_ModeOption_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_ModeOption_C, Icon) == 0x0003A8, "Member 'UWBP_MainMenu_ModeOption_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_ModeOption_C, Text_Mode) == 0x0003B0, "Member 'UWBP_MainMenu_ModeOption_C::Text_Mode' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_ModeOption_C, TextOption) == 0x0003B8, "Member 'UWBP_MainMenu_ModeOption_C::TextOption' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_ModeOption_C, PaddingOption) == 0x0003C8, "Member 'UWBP_MainMenu_ModeOption_C::PaddingOption' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_ModeOption_C, DebugIsSelected) == 0x0003D8, "Member 'UWBP_MainMenu_ModeOption_C::DebugIsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_ModeOption_C, FontSelected) == 0x0003E0, "Member 'UWBP_MainMenu_ModeOption_C::FontSelected' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_ModeOption_C, FontNormal) == 0x000440, "Member 'UWBP_MainMenu_ModeOption_C::FontNormal' has a wrong offset!");

}

