#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QueueButton_MainMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "OdyUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_QueueButton_MainMenu.WBP_QueueButton_MainMenu_C.ChangeEnabled
// 0x0060 (0x0060 - 0x0000)
struct WBP_QueueButton_MainMenu_C_ChangeEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x004C(0x0014)()
};
static_assert(alignof(WBP_QueueButton_MainMenu_C_ChangeEnabled) == 0x000004, "Wrong alignment on WBP_QueueButton_MainMenu_C_ChangeEnabled");
static_assert(sizeof(WBP_QueueButton_MainMenu_C_ChangeEnabled) == 0x000060, "Wrong size on WBP_QueueButton_MainMenu_C_ChangeEnabled");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, IsEnabled) == 0x000000, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::IsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, Temp_struct_Variable) == 0x000004, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, Temp_bool_Variable) == 0x000024, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, Temp_real_Variable) == 0x000028, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, Temp_real_Variable_1) == 0x00002C, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, Temp_bool_Variable_1) == 0x000030, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, K2Node_Select_Default) == 0x000034, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, Temp_byte_Variable) == 0x000038, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, Temp_byte_Variable_1) == 0x000039, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, Temp_bool_Variable_2) == 0x00003A, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, K2Node_Select_Default_1) == 0x00003B, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, K2Node_Select_Default_2) == 0x00003C, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeEnabled, K2Node_MakeStruct_SlateColor) == 0x00004C, "Member 'WBP_QueueButton_MainMenu_C_ChangeEnabled::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_QueueButton_MainMenu.WBP_QueueButton_MainMenu_C.ChangeState
// 0x0050 (0x0050 - 0x0000)
struct WBP_QueueButton_MainMenu_C_ChangeState final
{
public:
	bool                                          IsHovering;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QueueButton_MainMenu_C_ChangeState) == 0x000008, "Wrong alignment on WBP_QueueButton_MainMenu_C_ChangeState");
static_assert(sizeof(WBP_QueueButton_MainMenu_C_ChangeState) == 0x000050, "Wrong size on WBP_QueueButton_MainMenu_C_ChangeState");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, IsHovering) == 0x000000, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::IsHovering' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, Temp_bool_Variable) == 0x000001, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, Temp_byte_Variable) == 0x000002, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, K2Node_Select_Default) == 0x000005, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, Temp_real_Variable) == 0x000008, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, Temp_real_Variable_1) == 0x00000C, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, Temp_struct_Variable) == 0x000010, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, K2Node_Select_Default_1) == 0x000020, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, Temp_struct_Variable_1) == 0x000024, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, Temp_bool_Variable_2) == 0x000034, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, K2Node_Select_Default_2) == 0x000038, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeState, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'WBP_QueueButton_MainMenu_C_ChangeState::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_QueueButton_MainMenu.WBP_QueueButton_MainMenu_C.ChangeStateVisual
// 0x0018 (0x0018 - 0x0000)
struct WBP_QueueButton_MainMenu_C_ChangeStateVisual final
{
public:
	bool                                          QueueStart_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QueueButton_MainMenu_C_ChangeStateVisual) == 0x000008, "Wrong alignment on WBP_QueueButton_MainMenu_C_ChangeStateVisual");
static_assert(sizeof(WBP_QueueButton_MainMenu_C_ChangeStateVisual) == 0x000018, "Wrong size on WBP_QueueButton_MainMenu_C_ChangeStateVisual");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeStateVisual, QueueStart_0) == 0x000000, "Member 'WBP_QueueButton_MainMenu_C_ChangeStateVisual::QueueStart_0' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeStateVisual, Temp_bool_Variable) == 0x000001, "Member 'WBP_QueueButton_MainMenu_C_ChangeStateVisual::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeStateVisual, Temp_bool_Variable_1) == 0x000002, "Member 'WBP_QueueButton_MainMenu_C_ChangeStateVisual::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeStateVisual, K2Node_Select_Default) == 0x000008, "Member 'WBP_QueueButton_MainMenu_C_ChangeStateVisual::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ChangeStateVisual, K2Node_Select_Default_1) == 0x000010, "Member 'WBP_QueueButton_MainMenu_C_ChangeStateVisual::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_QueueButton_MainMenu.WBP_QueueButton_MainMenu_C.ExecuteUbergraph_WBP_QueueButton_MainMenu
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OldValue_1;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue_1;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool OldValue, bool NewValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<ETimespanBindingDisplayOption, class FText> K2Node_MakeMap_Map;                                // 0x0018(0x0050)(ConstParm)
	bool                                          K2Node_CustomEvent_OldValue;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue;                       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_CustomEvent_UIData;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data;  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UOdyUIData* UIData)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventRenderer_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_1;             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool OldValue, bool NewValue)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue_1;       // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu) == 0x000008, "Wrong alignment on WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu");
static_assert(sizeof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu) == 0x0000E0, "Wrong size on WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, EntryPoint) == 0x000000, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_CustomEvent_OldValue_1) == 0x000004, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_CustomEvent_NewValue_1) == 0x000005, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_MakeMap_Map) == 0x000018, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_CustomEvent_OldValue) == 0x000068, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_CustomEvent_NewValue) == 0x000069, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_CustomEvent_UIData) == 0x000070, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_CustomEvent_UIData' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data) == 0x000078, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000081, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, CallFunc_GetUIDataModel_ReturnValue) == 0x000088, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_Event_IsDesignTime) == 0x000090, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, CallFunc_GetOwningPlayerCameraManager_ReturnValue) == 0x0000B0, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::CallFunc_GetOwningPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, CallFunc_AkEventRenderer_ReturnValue) == 0x0000B8, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::CallFunc_AkEventRenderer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, CallFunc_GetUIDataModel_ReturnValue_1) == 0x0000C0, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::CallFunc_GetUIDataModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C8, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, CallFunc_BoolBinding_GetValue_ReturnValue) == 0x0000D8, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::CallFunc_BoolBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu, CallFunc_BoolBinding_GetValue_ReturnValue_1) == 0x0000D9, "Member 'WBP_QueueButton_MainMenu_C_ExecuteUbergraph_WBP_QueueButton_MainMenu::CallFunc_BoolBinding_GetValue_ReturnValue_1' has a wrong offset!");

// Function WBP_QueueButton_MainMenu.WBP_QueueButton_MainMenu_C.OnAvailableQueuesChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_QueueButton_MainMenu_C_OnAvailableQueuesChanged final
{
public:
	class UOdyUIData*                             UIData_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QueueButton_MainMenu_C_OnAvailableQueuesChanged) == 0x000008, "Wrong alignment on WBP_QueueButton_MainMenu_C_OnAvailableQueuesChanged");
static_assert(sizeof(WBP_QueueButton_MainMenu_C_OnAvailableQueuesChanged) == 0x000008, "Wrong size on WBP_QueueButton_MainMenu_C_OnAvailableQueuesChanged");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_OnAvailableQueuesChanged, UIData_0) == 0x000000, "Member 'WBP_QueueButton_MainMenu_C_OnAvailableQueuesChanged::UIData_0' has a wrong offset!");

// Function WBP_QueueButton_MainMenu.WBP_QueueButton_MainMenu_C.OnChangedIsAbleToQueue
// 0x0002 (0x0002 - 0x0000)
struct WBP_QueueButton_MainMenu_C_OnChangedIsAbleToQueue final
{
public:
	bool                                          OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QueueButton_MainMenu_C_OnChangedIsAbleToQueue) == 0x000001, "Wrong alignment on WBP_QueueButton_MainMenu_C_OnChangedIsAbleToQueue");
static_assert(sizeof(WBP_QueueButton_MainMenu_C_OnChangedIsAbleToQueue) == 0x000002, "Wrong size on WBP_QueueButton_MainMenu_C_OnChangedIsAbleToQueue");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_OnChangedIsAbleToQueue, OldValue) == 0x000000, "Member 'WBP_QueueButton_MainMenu_C_OnChangedIsAbleToQueue::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_OnChangedIsAbleToQueue, NewValue) == 0x000001, "Member 'WBP_QueueButton_MainMenu_C_OnChangedIsAbleToQueue::NewValue' has a wrong offset!");

// Function WBP_QueueButton_MainMenu.WBP_QueueButton_MainMenu_C.OnQueueStatusChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_QueueButton_MainMenu_C_OnQueueStatusChanged final
{
public:
	bool                                          OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QueueButton_MainMenu_C_OnQueueStatusChanged) == 0x000001, "Wrong alignment on WBP_QueueButton_MainMenu_C_OnQueueStatusChanged");
static_assert(sizeof(WBP_QueueButton_MainMenu_C_OnQueueStatusChanged) == 0x000002, "Wrong size on WBP_QueueButton_MainMenu_C_OnQueueStatusChanged");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_OnQueueStatusChanged, OldValue) == 0x000000, "Member 'WBP_QueueButton_MainMenu_C_OnQueueStatusChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_OnQueueStatusChanged, NewValue) == 0x000001, "Member 'WBP_QueueButton_MainMenu_C_OnQueueStatusChanged::NewValue' has a wrong offset!");

// Function WBP_QueueButton_MainMenu.WBP_QueueButton_MainMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_QueueButton_MainMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QueueButton_MainMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_QueueButton_MainMenu_C_PreConstruct");
static_assert(sizeof(WBP_QueueButton_MainMenu_C_PreConstruct) == 0x000001, "Wrong size on WBP_QueueButton_MainMenu_C_PreConstruct");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_QueueButton_MainMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_QueueButton_MainMenu.WBP_QueueButton_MainMenu_C.SetSizeMaterial
// 0x0040 (0x0040 - 0x0000)
struct WBP_QueueButton_MainMenu_C_SetSizeMaterial final
{
public:
	double                                        Width_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height_0;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QueueButton_MainMenu_C_SetSizeMaterial) == 0x000008, "Wrong alignment on WBP_QueueButton_MainMenu_C_SetSizeMaterial");
static_assert(sizeof(WBP_QueueButton_MainMenu_C_SetSizeMaterial) == 0x000040, "Wrong size on WBP_QueueButton_MainMenu_C_SetSizeMaterial");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_SetSizeMaterial, Width_0) == 0x000000, "Member 'WBP_QueueButton_MainMenu_C_SetSizeMaterial::Width_0' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_SetSizeMaterial, Height_0) == 0x000008, "Member 'WBP_QueueButton_MainMenu_C_SetSizeMaterial::Height_0' has a wrong offset!");
static_assert(offsetof(WBP_QueueButton_MainMenu_C_SetSizeMaterial, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_QueueButton_MainMenu_C_SetSizeMaterial::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
