#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TeammateUI_TeamInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TeammateUI_TeamInfo.WBP_TeammateUI_TeamInfo_C
// 0x0030 (0x03C8 - 0x0398)
class UWBP_TeammateUI_TeamInfo_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IconImage;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SparksCount;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextCoin;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextNumber;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextSparksCount;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void ChangeTeamNumber(int32 OldValue, int32 NewValue);
	void ExecuteUbergraph_WBP_TeammateUI_TeamInfo(int32 EntryPoint);
	void UnbindData(class UOdyUIData* OldUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TeammateUI_TeamInfo_C">();
	}
	static class UWBP_TeammateUI_TeamInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TeammateUI_TeamInfo_C>();
	}
};
static_assert(alignof(UWBP_TeammateUI_TeamInfo_C) == 0x000008, "Wrong alignment on UWBP_TeammateUI_TeamInfo_C");
static_assert(sizeof(UWBP_TeammateUI_TeamInfo_C) == 0x0003C8, "Wrong size on UWBP_TeammateUI_TeamInfo_C");
static_assert(offsetof(UWBP_TeammateUI_TeamInfo_C, UberGraphFrame) == 0x000398, "Member 'UWBP_TeammateUI_TeamInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TeammateUI_TeamInfo_C, IconImage) == 0x0003A0, "Member 'UWBP_TeammateUI_TeamInfo_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_TeammateUI_TeamInfo_C, SparksCount) == 0x0003A8, "Member 'UWBP_TeammateUI_TeamInfo_C::SparksCount' has a wrong offset!");
static_assert(offsetof(UWBP_TeammateUI_TeamInfo_C, TextCoin) == 0x0003B0, "Member 'UWBP_TeammateUI_TeamInfo_C::TextCoin' has a wrong offset!");
static_assert(offsetof(UWBP_TeammateUI_TeamInfo_C, TextNumber) == 0x0003B8, "Member 'UWBP_TeammateUI_TeamInfo_C::TextNumber' has a wrong offset!");
static_assert(offsetof(UWBP_TeammateUI_TeamInfo_C, TextSparksCount) == 0x0003C0, "Member 'UWBP_TeammateUI_TeamInfo_C::TextSparksCount' has a wrong offset!");

}

