#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpawnRegion_Mark

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SpawnRegion_Mark.WBP_SpawnRegion_Mark_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpawnRegion_Mark_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_Mark_C_BindData) == 0x000008, "Wrong alignment on WBP_SpawnRegion_Mark_C_BindData");
static_assert(sizeof(WBP_SpawnRegion_Mark_C_BindData) == 0x000008, "Wrong size on WBP_SpawnRegion_Mark_C_BindData");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_BindData, NewUIData) == 0x000000, "Member 'WBP_SpawnRegion_Mark_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_SpawnRegion_Mark.WBP_SpawnRegion_Mark_C.ClearPlayersInRegion
// 0x0058 (0x0058 - 0x0000)
struct WBP_SpawnRegion_Mark_C_ClearPlayersInRegion final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x000C(0x0014)()
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpawnRegion_PlayerIcon_C*          K2Node_DynamicCast_AsWBP_Spawn_Region_Player_Icon; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion) == 0x000008, "Wrong alignment on WBP_SpawnRegion_Mark_C_ClearPlayersInRegion");
static_assert(sizeof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion) == 0x000058, "Wrong size on WBP_SpawnRegion_Mark_C_ClearPlayersInRegion");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, K2Node_MakeStruct_SlateColor) == 0x00000C, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, K2Node_DynamicCast_AsWBP_Spawn_Region_Player_Icon) == 0x000048, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::K2Node_DynamicCast_AsWBP_Spawn_Region_Player_Icon' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ClearPlayersInRegion, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_SpawnRegion_Mark_C_ClearPlayersInRegion::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_SpawnRegion_Mark.WBP_SpawnRegion_Mark_C.ExecuteUbergraph_WBP_SpawnRegion_Mark
// 0x0120 (0x0120 - 0x0000)
struct WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData_1;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_1;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_2;  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_3;  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         K2Node_CustomEvent_OldValue;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpawnRegion_PlayerIcon_C*          K2Node_DynamicCast_AsWBP_Spawn_Region_Player_Icon; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpawnRegion_PlayerIcon_C*          K2Node_DynamicCast_AsWBP_Spawn_Region_Player_Icon_1; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayNameForRegion_ReturnValue;      // 0x0110(0x0010)()
};
static_assert(alignof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark) == 0x000008, "Wrong alignment on WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark");
static_assert(sizeof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark) == 0x000120, "Wrong size on WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, EntryPoint) == 0x000000, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_Event_NewUIData_1) == 0x000028, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_Event_NewUIData_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data) == 0x000030, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_GetUIData_ReturnValue) == 0x000040, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_1) == 0x000048, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_Event_OldUIData) == 0x000058, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_2) == 0x000060, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_Event_NewUIData) == 0x000070, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_3) == 0x000078, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_3' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, Temp_int_Loop_Counter_Variable_1) == 0x000084, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_IntBinding_GetValue_ReturnValue) == 0x000088, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_IntBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_Add_IntInt_ReturnValue_1) == 0x00008C, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_GetAllChildren_ReturnValue) == 0x000090, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_CustomEvent_OldValue) == 0x0000A0, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_CustomEvent_NewValue) == 0x0000A4, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, Temp_int_Array_Index_Variable_1) == 0x0000AC, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_AsWBP_Spawn_Region_Player_Icon) == 0x0000C0, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_AsWBP_Spawn_Region_Player_Icon' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_bSuccess_4) == 0x0000C8, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000CC, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_GetAllChildren_ReturnValue_1) == 0x0000E0, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_Array_Length_ReturnValue_1) == 0x0000F8, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_AsWBP_Spawn_Region_Player_Icon_1) == 0x000100, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_AsWBP_Spawn_Region_Player_Icon_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, K2Node_DynamicCast_bSuccess_5) == 0x000108, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_Less_IntInt_ReturnValue_1) == 0x000109, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark, CallFunc_GetDisplayNameForRegion_ReturnValue) == 0x000110, "Member 'WBP_SpawnRegion_Mark_C_ExecuteUbergraph_WBP_SpawnRegion_Mark::CallFunc_GetDisplayNameForRegion_ReturnValue' has a wrong offset!");

// Function WBP_SpawnRegion_Mark.WBP_SpawnRegion_Mark_C.OnUIDataSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpawnRegion_Mark_C_OnUIDataSet final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_Mark_C_OnUIDataSet) == 0x000008, "Wrong alignment on WBP_SpawnRegion_Mark_C_OnUIDataSet");
static_assert(sizeof(WBP_SpawnRegion_Mark_C_OnUIDataSet) == 0x000008, "Wrong size on WBP_SpawnRegion_Mark_C_OnUIDataSet");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_OnUIDataSet, NewUIData) == 0x000000, "Member 'WBP_SpawnRegion_Mark_C_OnUIDataSet::NewUIData' has a wrong offset!");

// Function WBP_SpawnRegion_Mark.WBP_SpawnRegion_Mark_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SpawnRegion_Mark_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_Mark_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SpawnRegion_Mark_C_PreConstruct");
static_assert(sizeof(WBP_SpawnRegion_Mark_C_PreConstruct) == 0x000001, "Wrong size on WBP_SpawnRegion_Mark_C_PreConstruct");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SpawnRegion_Mark_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SpawnRegion_Mark.WBP_SpawnRegion_Mark_C.SetVisualEnemiesCounter
// 0x0138 (0x0138 - 0x0000)
struct WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	struct FVector2D                              Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_6;                            // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_7;                            // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_8;                            // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_9;                            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_4;        // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_4;                           // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_5;                           // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter) == 0x000008, "Wrong alignment on WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter");
static_assert(sizeof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter) == 0x000138, "Wrong size on WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Value) == 0x000000, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Value' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_bool_Variable) == 0x000004, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable) == 0x000018, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_bool_Variable_1) == 0x000028, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_real_Variable) == 0x00002C, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_real_Variable_1) == 0x000030, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_bool_Variable_2) == 0x000034, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable_1) == 0x000038, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable_2) == 0x000048, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_bool_Variable_3) == 0x000058, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable_3) == 0x00005C, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_bool_Variable_4) == 0x00006C, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_byte_Variable) == 0x00006D, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_byte_Variable_1) == 0x00006E, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable_4) == 0x000070, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, K2Node_Select_Default) == 0x000080, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable_5) == 0x000088, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable_6) == 0x000098, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable_7) == 0x0000A8, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable_8) == 0x0000B8, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000C8, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x0000C9, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_struct_Variable_9) == 0x0000D0, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, K2Node_Select_Default_1) == 0x0000E0, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x0000F0, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x0000F8, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, CallFunc_GreaterEqual_IntInt_ReturnValue_4) == 0x0000F9, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::CallFunc_GreaterEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, K2Node_Select_Default_2) == 0x0000FC, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, K2Node_Select_Default_3) == 0x00010C, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, Temp_int_Variable) == 0x000110, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, K2Node_Select_Default_4) == 0x000118, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter, K2Node_Select_Default_5) == 0x000128, "Member 'WBP_SpawnRegion_Mark_C_SetVisualEnemiesCounter::K2Node_Select_Default_5' has a wrong offset!");

// Function WBP_SpawnRegion_Mark.WBP_SpawnRegion_Mark_C.TeamNumberChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpawnRegion_Mark_C_TeamNumberChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_Mark_C_TeamNumberChanged) == 0x000004, "Wrong alignment on WBP_SpawnRegion_Mark_C_TeamNumberChanged");
static_assert(sizeof(WBP_SpawnRegion_Mark_C_TeamNumberChanged) == 0x000008, "Wrong size on WBP_SpawnRegion_Mark_C_TeamNumberChanged");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_TeamNumberChanged, OldValue) == 0x000000, "Member 'WBP_SpawnRegion_Mark_C_TeamNumberChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_TeamNumberChanged, NewValue) == 0x000004, "Member 'WBP_SpawnRegion_Mark_C_TeamNumberChanged::NewValue' has a wrong offset!");

// Function WBP_SpawnRegion_Mark.WBP_SpawnRegion_Mark_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpawnRegion_Mark_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_Mark_C_UnbindData) == 0x000008, "Wrong alignment on WBP_SpawnRegion_Mark_C_UnbindData");
static_assert(sizeof(WBP_SpawnRegion_Mark_C_UnbindData) == 0x000008, "Wrong size on WBP_SpawnRegion_Mark_C_UnbindData");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_SpawnRegion_Mark_C_UnbindData::OldUIData' has a wrong offset!");

// Function WBP_SpawnRegion_Mark.WBP_SpawnRegion_Mark_C.UpdateNumEnemiesInRegion
// 0x0050 (0x0050 - 0x0000)
struct WBP_SpawnRegion_Mark_C_UpdateNumEnemiesInRegion final
{
public:
	class UMatchaGameWorldUIData*                 WorldUIData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemiesInRegion;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpectatedPlayerTeamNumber;                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaPlayerUIData*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue_1;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue_2;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpawnRegion_Mark_C_UpdateNumEnemiesInRegion) == 0x000008, "Wrong alignment on WBP_SpawnRegion_Mark_C_UpdateNumEnemiesInRegion");
static_assert(sizeof(WBP_SpawnRegion_Mark_C_UpdateNumEnemiesInRegion) == 0x000050, "Wrong size on WBP_SpawnRegion_Mark_C_UpdateNumEnemiesInRegion");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_UpdateNumEnemiesInRegion, WorldUIData) == 0x000000, "Member 'WBP_SpawnRegion_Mark_C_UpdateNumEnemiesInRegion::WorldUIData' has a wrong offset!");
static_assert(offsetof(WBP_SpawnRegion_Mark_C_UpdateNumEnemiesInRegion, EnemiesInRegion) == 0x000008, "Member 'WBP_SpawnRegion_Mark_C_UpdateNumEnemiesInRegion::EnemiesInRegion' has a wrong offset!");
