#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KillFeed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KillFeed.WBP_KillFeed_C
// 0x0040 (0x03D8 - 0x0398)
class UWBP_KillFeed_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOdyListView*                           KillFeedList;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        VisibleTimeSeconds;                                // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RemainingVisibleTime;                              // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeThresholdSeconds;                              // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 Kill_Feed_UI_Data;                                 // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             UI_Data;                                           // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 Kill_Feed_UI_Data_0;                               // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void BndEvt__WBP_KillFeed_KillFeedList_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void ExecuteUbergraph_WBP_KillFeed(int32 EntryPoint);
	void OnInitialized();
	void OnKillFeedUpdated();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UnbindData(class UOdyUIData* OldUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KillFeed_C">();
	}
	static class UWBP_KillFeed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KillFeed_C>();
	}
};
static_assert(alignof(UWBP_KillFeed_C) == 0x000008, "Wrong alignment on UWBP_KillFeed_C");
static_assert(sizeof(UWBP_KillFeed_C) == 0x0003D8, "Wrong size on UWBP_KillFeed_C");
static_assert(offsetof(UWBP_KillFeed_C, UberGraphFrame) == 0x000398, "Member 'UWBP_KillFeed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeed_C, KillFeedList) == 0x0003A0, "Member 'UWBP_KillFeed_C::KillFeedList' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeed_C, VisibleTimeSeconds) == 0x0003A8, "Member 'UWBP_KillFeed_C::VisibleTimeSeconds' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeed_C, RemainingVisibleTime) == 0x0003B0, "Member 'UWBP_KillFeed_C::RemainingVisibleTime' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeed_C, FadeThresholdSeconds) == 0x0003B8, "Member 'UWBP_KillFeed_C::FadeThresholdSeconds' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeed_C, Kill_Feed_UI_Data) == 0x0003C0, "Member 'UWBP_KillFeed_C::Kill_Feed_UI_Data' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeed_C, UI_Data) == 0x0003C8, "Member 'UWBP_KillFeed_C::UI_Data' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeed_C, Kill_Feed_UI_Data_0) == 0x0003D0, "Member 'UWBP_KillFeed_C::Kill_Feed_UI_Data_0' has a wrong offset!");

}

