#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDFeedback

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUDFeedback.WBP_HUDFeedback_C.ExecuteUbergraph_WBP_HUDFeedback
// 0x0080 (0x0080 - 0x0000)
struct WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FloatBinding_GetValue_ReturnValue;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue;         // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback) == 0x000008, "Wrong alignment on WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback");
static_assert(sizeof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback) == 0x000080, "Wrong size on WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, EntryPoint) == 0x000000, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, Temp_bool_Variable) == 0x000004, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_GetUIData_ReturnValue) == 0x000048, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data) == 0x000058, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_FloatBinding_GetValue_ReturnValue) == 0x000064, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_FloatBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_IntBinding_GetValue_ReturnValue) == 0x000068, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_IntBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00006C, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00006D, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_BoolBinding_GetValue_ReturnValue) == 0x00006E, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_BoolBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_BooleanAND_ReturnValue) == 0x00006F, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, Temp_byte_Variable) == 0x000070, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, Temp_byte_Variable_1) == 0x000071, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, K2Node_Select_Default) == 0x000072, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000073, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'WBP_HUDFeedback_C_ExecuteUbergraph_WBP_HUDFeedback::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_HUDFeedback.WBP_HUDFeedback_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_HUDFeedback_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDFeedback_C_Tick) == 0x000004, "Wrong alignment on WBP_HUDFeedback_C_Tick");
static_assert(sizeof(WBP_HUDFeedback_C_Tick) == 0x00003C, "Wrong size on WBP_HUDFeedback_C_Tick");
static_assert(offsetof(WBP_HUDFeedback_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_HUDFeedback_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HUDFeedback_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_HUDFeedback_C_Tick::InDeltaTime' has a wrong offset!");

}

