#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InviteEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_InviteEntry_Base_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InviteEntry.WBP_InviteEntry_C
// 0x0028 (0x03E0 - 0x03B8)
class UWBP_InviteEntry_C final : public UWBP_InviteEntry_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                AcceptButton;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FlavorIcon;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOdyTextBlock*                          NameText;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RejectButton;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void BndEvt__WBP_InviteEntry_AcceptButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_InviteEntry_RejectButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_InviteEntry(int32 EntryPoint);
	void SetAcceptable(bool NewAcceptable);
	void SetRejectable(bool New_Rejectable);
	void UnbindData(class UOdyUIData* OldUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InviteEntry_C">();
	}
	static class UWBP_InviteEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InviteEntry_C>();
	}
};
static_assert(alignof(UWBP_InviteEntry_C) == 0x000008, "Wrong alignment on UWBP_InviteEntry_C");
static_assert(sizeof(UWBP_InviteEntry_C) == 0x0003E0, "Wrong size on UWBP_InviteEntry_C");
static_assert(offsetof(UWBP_InviteEntry_C, UberGraphFrame) == 0x0003B8, "Member 'UWBP_InviteEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InviteEntry_C, AcceptButton) == 0x0003C0, "Member 'UWBP_InviteEntry_C::AcceptButton' has a wrong offset!");
static_assert(offsetof(UWBP_InviteEntry_C, FlavorIcon) == 0x0003C8, "Member 'UWBP_InviteEntry_C::FlavorIcon' has a wrong offset!");
static_assert(offsetof(UWBP_InviteEntry_C, NameText) == 0x0003D0, "Member 'UWBP_InviteEntry_C::NameText' has a wrong offset!");
static_assert(offsetof(UWBP_InviteEntry_C, RejectButton) == 0x0003D8, "Member 'UWBP_InviteEntry_C::RejectButton' has a wrong offset!");

}

