#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SoftwareCursor_TextEditBeam

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SoftwareCursor_TextEditBeam.WBP_SoftwareCursor_TextEditBeam_C.ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam
// 0x0028 (0x0028 - 0x0000)
struct WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
};
static_assert(alignof(WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam) == 0x000008, "Wrong alignment on WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam");
static_assert(sizeof(WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam) == 0x000028, "Wrong size on WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam");
static_assert(offsetof(WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam, EntryPoint) == 0x000000, "Member 'WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'WBP_SoftwareCursor_TextEditBeam_C_ExecuteUbergraph_WBP_SoftwareCursor_TextEditBeam::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

