#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_Tooltips

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "OdyUI_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.Bind Category Data
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Tooltips_C_Bind_Category_Data final
{
public:
	class UMatchaInventoryCategoryUIData*         CategoryUIData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_Bind_Category_Data) == 0x000008, "Wrong alignment on WBP_Inventory_Tooltips_C_Bind_Category_Data");
static_assert(sizeof(WBP_Inventory_Tooltips_C_Bind_Category_Data) == 0x000008, "Wrong size on WBP_Inventory_Tooltips_C_Bind_Category_Data");
static_assert(offsetof(WBP_Inventory_Tooltips_C_Bind_Category_Data, CategoryUIData) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_Bind_Category_Data::CategoryUIData' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Tooltips_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_BindData) == 0x000008, "Wrong alignment on WBP_Inventory_Tooltips_C_BindData");
static_assert(sizeof(WBP_Inventory_Tooltips_C_BindData) == 0x000008, "Wrong size on WBP_Inventory_Tooltips_C_BindData");
static_assert(offsetof(WBP_Inventory_Tooltips_C_BindData, NewUIData) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.ExecuteUbergraph_WBP_Inventory_Tooltips
// 0x0208 (0x0208 - 0x0000)
struct WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryUIData*                 K2Node_DynamicCast_AsMatcha_Inventory_UI_Data;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryUIData*                 K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_1;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryUIData*                 K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_2;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_CategoryUIData_2;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_OldCategoryUIData;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventorySlotUIData*             CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00B4(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EInputMethod InputMethod)>     K2Node_CreateDelegate_OutputDelegate_3;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         CallFunc_Map_Find_Value;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_CategoryUIData_1;               // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventorySlotUIData*             CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_CategoryUIData;                 // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventorySlotUIData*             CallFunc_Array_Get_Item_2;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x016C(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         CallFunc_Map_Find_Value_1;                         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             Temp_object_Variable;                              // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Select_Default;                             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x01B0(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryCategoryUIData*         CallFunc_Map_Find_Value_2;                         // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Show;                                 // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EB[0x5];                                      // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUISubsystem*                     CallFunc_GetUISubsystem_ReturnValue;               // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputMethod                                  CallFunc_GetInputMethod_ReturnValue;               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputMethod                                  K2Node_CustomEvent_InputMethod;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   K2Node_Select_Default_3;                           // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips) == 0x000008, "Wrong alignment on WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips");
static_assert(sizeof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips) == 0x000208, "Wrong size on WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, EntryPoint) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_Event_NewUIData) == 0x000018, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_Event_OldUIData) == 0x000020, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_DynamicCast_AsMatcha_Inventory_UI_Data) == 0x000028, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_DynamicCast_AsMatcha_Inventory_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_1) == 0x000038, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_GetUIData_ReturnValue) == 0x000058, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_2) == 0x000060, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CustomEvent_CategoryUIData_2) == 0x000070, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CustomEvent_CategoryUIData_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CustomEvent_OldCategoryUIData) == 0x000078, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CustomEvent_OldCategoryUIData' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_int_Variable) == 0x000084, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_IsValid_ReturnValue_2) == 0x0000A0, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000B0, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_struct_Variable) == 0x0000B4, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000BC, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Map_Find_Value) == 0x0000D0, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Map_Find_ReturnValue) == 0x0000D8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_byte_Variable) == 0x0000D9, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_byte_Variable_1) == 0x0000DA, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_bool_Variable) == 0x0000DB, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_byte_Variable_2) == 0x0000DC, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CustomEvent_CategoryUIData_1) == 0x0000E0, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CustomEvent_CategoryUIData_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_IsValid_ReturnValue_3) == 0x0000E9, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000F8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_byte_Variable_3) == 0x0000F9, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_IsValid_ReturnValue_4) == 0x0000FA, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000FC, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_bool_Variable_1) == 0x00010C, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CustomEvent_CategoryUIData) == 0x000110, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CustomEvent_CategoryUIData' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_5) == 0x000118, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000128, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_IsValid_ReturnValue_5) == 0x000129, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_IsValid_ReturnValue_6) == 0x00012A, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_6) == 0x00012C, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Array_Get_Item_2) == 0x000140, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_7) == 0x000148, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x000158, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_8) == 0x00015C, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_struct_Variable_1) == 0x00016C, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_9) == 0x000174, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Map_Find_Value_1) == 0x000188, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Map_Find_ReturnValue_1) == 0x000190, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_object_Variable) == 0x000198, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_bool_Variable_2) == 0x0001A0, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_Select_Default) == 0x0001A8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_struct_Variable_2) == 0x0001B0, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_10) == 0x0001B8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Map_Find_Value_2) == 0x0001C8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_Map_Find_ReturnValue_2) == 0x0001D0, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x0001D1, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CustomEvent_InVisibility) == 0x0001D2, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001D3, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001D4, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_BooleanOR_ReturnValue) == 0x0001D5, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001D8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_Select_Default_1) == 0x0001E8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_Event_Show) == 0x0001E9, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_Event_Show' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_Select_Default_2) == 0x0001EA, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_GetUISubsystem_ReturnValue) == 0x0001F0, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_GetUISubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, CallFunc_GetInputMethod_ReturnValue) == 0x0001F8, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::CallFunc_GetInputMethod_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_CustomEvent_InputMethod) == 0x0001F9, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_CustomEvent_InputMethod' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, Temp_int_Variable_1) == 0x0001FC, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips, K2Node_Select_Default_3) == 0x000200, "Member 'WBP_Inventory_Tooltips_C_ExecuteUbergraph_WBP_Inventory_Tooltips::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.HandleHeldItemVisChange
// 0x0001 (0x0001 - 0x0000)
struct WBP_Inventory_Tooltips_C_HandleHeldItemVisChange final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_HandleHeldItemVisChange) == 0x000001, "Wrong alignment on WBP_Inventory_Tooltips_C_HandleHeldItemVisChange");
static_assert(sizeof(WBP_Inventory_Tooltips_C_HandleHeldItemVisChange) == 0x000001, "Wrong size on WBP_Inventory_Tooltips_C_HandleHeldItemVisChange");
static_assert(offsetof(WBP_Inventory_Tooltips_C_HandleHeldItemVisChange, InVisibility) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_HandleHeldItemVisChange::InVisibility' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.OnHeldCategoryUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Tooltips_C_OnHeldCategoryUpdated final
{
public:
	class UMatchaInventoryCategoryUIData*         CategoryUIData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_OnHeldCategoryUpdated) == 0x000008, "Wrong alignment on WBP_Inventory_Tooltips_C_OnHeldCategoryUpdated");
static_assert(sizeof(WBP_Inventory_Tooltips_C_OnHeldCategoryUpdated) == 0x000008, "Wrong size on WBP_Inventory_Tooltips_C_OnHeldCategoryUpdated");
static_assert(offsetof(WBP_Inventory_Tooltips_C_OnHeldCategoryUpdated, CategoryUIData) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_OnHeldCategoryUpdated::CategoryUIData' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.OnInputMethodChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct WBP_Inventory_Tooltips_C_OnInputMethodChanged_Event final
{
public:
	EInputMethod                                  InputMethod;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_OnInputMethodChanged_Event) == 0x000001, "Wrong alignment on WBP_Inventory_Tooltips_C_OnInputMethodChanged_Event");
static_assert(sizeof(WBP_Inventory_Tooltips_C_OnInputMethodChanged_Event) == 0x000001, "Wrong size on WBP_Inventory_Tooltips_C_OnInputMethodChanged_Event");
static_assert(offsetof(WBP_Inventory_Tooltips_C_OnInputMethodChanged_Event, InputMethod) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_OnInputMethodChanged_Event::InputMethod' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.OnSoulCategoryUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Tooltips_C_OnSoulCategoryUpdated final
{
public:
	class UMatchaInventoryCategoryUIData*         CategoryUIData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_OnSoulCategoryUpdated) == 0x000008, "Wrong alignment on WBP_Inventory_Tooltips_C_OnSoulCategoryUpdated");
static_assert(sizeof(WBP_Inventory_Tooltips_C_OnSoulCategoryUpdated) == 0x000008, "Wrong size on WBP_Inventory_Tooltips_C_OnSoulCategoryUpdated");
static_assert(offsetof(WBP_Inventory_Tooltips_C_OnSoulCategoryUpdated, CategoryUIData) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_OnSoulCategoryUpdated::CategoryUIData' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.SetNewToolTip
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Tooltips_C_SetNewToolTip final
{
public:
	class UTextLayoutWidget*                      TextWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_SetNewToolTip) == 0x000008, "Wrong alignment on WBP_Inventory_Tooltips_C_SetNewToolTip");
static_assert(sizeof(WBP_Inventory_Tooltips_C_SetNewToolTip) == 0x000008, "Wrong size on WBP_Inventory_Tooltips_C_SetNewToolTip");
static_assert(offsetof(WBP_Inventory_Tooltips_C_SetNewToolTip, TextWidget) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_SetNewToolTip::TextWidget' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.ShowTooltip
// 0x0001 (0x0001 - 0x0000)
struct WBP_Inventory_Tooltips_C_ShowTooltip final
{
public:
	bool                                          Show_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_ShowTooltip) == 0x000001, "Wrong alignment on WBP_Inventory_Tooltips_C_ShowTooltip");
static_assert(sizeof(WBP_Inventory_Tooltips_C_ShowTooltip) == 0x000001, "Wrong size on WBP_Inventory_Tooltips_C_ShowTooltip");
static_assert(offsetof(WBP_Inventory_Tooltips_C_ShowTooltip, Show_0) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_ShowTooltip::Show_0' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.UnbindCategoryData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Tooltips_C_UnbindCategoryData final
{
public:
	class UMatchaInventoryCategoryUIData*         OldCategoryUIData;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_UnbindCategoryData) == 0x000008, "Wrong alignment on WBP_Inventory_Tooltips_C_UnbindCategoryData");
static_assert(sizeof(WBP_Inventory_Tooltips_C_UnbindCategoryData) == 0x000008, "Wrong size on WBP_Inventory_Tooltips_C_UnbindCategoryData");
static_assert(offsetof(WBP_Inventory_Tooltips_C_UnbindCategoryData, OldCategoryUIData) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_UnbindCategoryData::OldCategoryUIData' has a wrong offset!");

// Function WBP_Inventory_Tooltips.WBP_Inventory_Tooltips_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Tooltips_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Tooltips_C_UnbindData) == 0x000008, "Wrong alignment on WBP_Inventory_Tooltips_C_UnbindData");
static_assert(sizeof(WBP_Inventory_Tooltips_C_UnbindData) == 0x000008, "Wrong size on WBP_Inventory_Tooltips_C_UnbindData");
static_assert(offsetof(WBP_Inventory_Tooltips_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_Inventory_Tooltips_C_UnbindData::OldUIData' has a wrong offset!");

}

