#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SentInvites

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SentInvites.WBP_SentInvites_C
// 0x0018 (0x03B0 - 0x0398)
class UWBP_SentInvites_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UListView*                              InviteEntries;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_SocialListBase_C*         SocialListBase;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void ExecuteUbergraph_WBP_SentInvites(int32 EntryPoint);
	void HandleSentInvitesUpdated(const TArray<class UMatchaPlayerProfileUIData*>& ProfileList);
	void OnEntryCanceled(class UMatchaPlayerProfileUIData* PlayerProfileUIData);
	void PreConstruct(bool IsDesignTime);
	void UnbindData(class UOdyUIData* OldUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SentInvites_C">();
	}
	static class UWBP_SentInvites_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SentInvites_C>();
	}
};
static_assert(alignof(UWBP_SentInvites_C) == 0x000008, "Wrong alignment on UWBP_SentInvites_C");
static_assert(sizeof(UWBP_SentInvites_C) == 0x0003B0, "Wrong size on UWBP_SentInvites_C");
static_assert(offsetof(UWBP_SentInvites_C, UberGraphFrame) == 0x000398, "Member 'UWBP_SentInvites_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SentInvites_C, InviteEntries) == 0x0003A0, "Member 'UWBP_SentInvites_C::InviteEntries' has a wrong offset!");
static_assert(offsetof(UWBP_SentInvites_C, SocialListBase) == 0x0003A8, "Member 'UWBP_SentInvites_C::SocialListBase' has a wrong offset!");

}

