#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TeamAttackIndicators

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_structs.hpp"
#include "OdyUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TeamAttackIndicators.WBP_TeamAttackIndicators_C
// 0x0078 (0x0410 - 0x0398)
class UWBP_TeamAttackIndicators_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CanCastWisps;                                      // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowWarningIndicator;                              // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         AssistAttackInputUIController;                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CanCastIconLeft;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CanCastIconRight;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CurrentTargetIndicatorOverlay;                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GlitchMark;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_119;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBinding_C*                    KeyboardControlIndicator;                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TeamAttackWarningOverlay;                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningImage;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBinding_C*                    WBP_InputBinding;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBinding_C*                    WBP_InputBinding_1;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DisableTeamAttackTarget();
	void EnableTeamAttackTarget();
	void ExecuteUbergraph_WBP_TeamAttackIndicators(int32 EntryPoint);
	void HideOrShowKBMSpecificIA(EInputMethod InputMethod);
	void PlayTeamAttackWarning();
	void StopTeamAttackWarning();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ToggleGlitchMarkIndicator(bool ShouldBeVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TeamAttackIndicators_C">();
	}
	static class UWBP_TeamAttackIndicators_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TeamAttackIndicators_C>();
	}
};
static_assert(alignof(UWBP_TeamAttackIndicators_C) == 0x000008, "Wrong alignment on UWBP_TeamAttackIndicators_C");
static_assert(sizeof(UWBP_TeamAttackIndicators_C) == 0x000410, "Wrong size on UWBP_TeamAttackIndicators_C");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, UberGraphFrame) == 0x000398, "Member 'UWBP_TeamAttackIndicators_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, CanCastWisps) == 0x0003A0, "Member 'UWBP_TeamAttackIndicators_C::CanCastWisps' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, ShowWarningIndicator) == 0x0003A8, "Member 'UWBP_TeamAttackIndicators_C::ShowWarningIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, AssistAttackInputUIController) == 0x0003B0, "Member 'UWBP_TeamAttackIndicators_C::AssistAttackInputUIController' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, CanCastIconLeft) == 0x0003B8, "Member 'UWBP_TeamAttackIndicators_C::CanCastIconLeft' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, CanCastIconRight) == 0x0003C0, "Member 'UWBP_TeamAttackIndicators_C::CanCastIconRight' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, CurrentTargetIndicatorOverlay) == 0x0003C8, "Member 'UWBP_TeamAttackIndicators_C::CurrentTargetIndicatorOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, GlitchMark) == 0x0003D0, "Member 'UWBP_TeamAttackIndicators_C::GlitchMark' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, Image_119) == 0x0003D8, "Member 'UWBP_TeamAttackIndicators_C::Image_119' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, KeyboardControlIndicator) == 0x0003E0, "Member 'UWBP_TeamAttackIndicators_C::KeyboardControlIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, TeamAttackWarningOverlay) == 0x0003E8, "Member 'UWBP_TeamAttackIndicators_C::TeamAttackWarningOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, WarningImage) == 0x0003F0, "Member 'UWBP_TeamAttackIndicators_C::WarningImage' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, WBP_InputBinding) == 0x0003F8, "Member 'UWBP_TeamAttackIndicators_C::WBP_InputBinding' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, WBP_InputBinding_1) == 0x000400, "Member 'UWBP_TeamAttackIndicators_C::WBP_InputBinding_1' has a wrong offset!");
static_assert(offsetof(UWBP_TeamAttackIndicators_C, Angle) == 0x000408, "Member 'UWBP_TeamAttackIndicators_C::Angle' has a wrong offset!");

}

