#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InviteEntry_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_InviteEntry_Base.WBP_InviteEntry_Base_C.Accepted__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InviteEntry_Base_C_Accepted__DelegateSignature final
{
public:
	class UMatchaPlayerProfileUIData*             PlayerProfileUIData;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InviteEntry_Base_C_Accepted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InviteEntry_Base_C_Accepted__DelegateSignature");
static_assert(sizeof(WBP_InviteEntry_Base_C_Accepted__DelegateSignature) == 0x000008, "Wrong size on WBP_InviteEntry_Base_C_Accepted__DelegateSignature");
static_assert(offsetof(WBP_InviteEntry_Base_C_Accepted__DelegateSignature, PlayerProfileUIData) == 0x000000, "Member 'WBP_InviteEntry_Base_C_Accepted__DelegateSignature::PlayerProfileUIData' has a wrong offset!");

// Function WBP_InviteEntry_Base.WBP_InviteEntry_Base_C.Rejected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InviteEntry_Base_C_Rejected__DelegateSignature final
{
public:
	class UMatchaPlayerProfileUIData*             PlayerProfileUIData;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InviteEntry_Base_C_Rejected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InviteEntry_Base_C_Rejected__DelegateSignature");
static_assert(sizeof(WBP_InviteEntry_Base_C_Rejected__DelegateSignature) == 0x000008, "Wrong size on WBP_InviteEntry_Base_C_Rejected__DelegateSignature");
static_assert(offsetof(WBP_InviteEntry_Base_C_Rejected__DelegateSignature, PlayerProfileUIData) == 0x000000, "Member 'WBP_InviteEntry_Base_C_Rejected__DelegateSignature::PlayerProfileUIData' has a wrong offset!");

}

