#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputBinding

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputBinding.WBP_InputBinding_C.ExecuteUbergraph_WBP_InputBinding
// 0x0008 (0x0008 - 0x0000)
struct WBP_InputBinding_C_ExecuteUbergraph_WBP_InputBinding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBinding_C_ExecuteUbergraph_WBP_InputBinding) == 0x000004, "Wrong alignment on WBP_InputBinding_C_ExecuteUbergraph_WBP_InputBinding");
static_assert(sizeof(WBP_InputBinding_C_ExecuteUbergraph_WBP_InputBinding) == 0x000008, "Wrong size on WBP_InputBinding_C_ExecuteUbergraph_WBP_InputBinding");
static_assert(offsetof(WBP_InputBinding_C_ExecuteUbergraph_WBP_InputBinding, EntryPoint) == 0x000000, "Member 'WBP_InputBinding_C_ExecuteUbergraph_WBP_InputBinding::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_ExecuteUbergraph_WBP_InputBinding, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_InputBinding_C_ExecuteUbergraph_WBP_InputBinding::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_InputBinding.WBP_InputBinding_C.Init
// 0x0028 (0x0028 - 0x0000)
struct WBP_InputBinding_C_Init final
{
public:
	class UInputAction*                           InInputAction;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   InKey;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	double                                        InSize;                                            // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBinding_C_Init) == 0x000008, "Wrong alignment on WBP_InputBinding_C_Init");
static_assert(sizeof(WBP_InputBinding_C_Init) == 0x000028, "Wrong size on WBP_InputBinding_C_Init");
static_assert(offsetof(WBP_InputBinding_C_Init, InInputAction) == 0x000000, "Member 'WBP_InputBinding_C_Init::InInputAction' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_Init, InKey) == 0x000008, "Member 'WBP_InputBinding_C_Init::InKey' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_Init, InSize) == 0x000020, "Member 'WBP_InputBinding_C_Init::InSize' has a wrong offset!");

// Function WBP_InputBinding.WBP_InputBinding_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputBinding_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBinding_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_InputBinding_C_PreConstruct");
static_assert(sizeof(WBP_InputBinding_C_PreConstruct) == 0x000001, "Wrong size on WBP_InputBinding_C_PreConstruct");
static_assert(offsetof(WBP_InputBinding_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_InputBinding_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_InputBinding.WBP_InputBinding_C.SetInputAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_InputBinding_C_SetInputAction final
{
public:
	class UInputAction*                           InputAction_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBinding_C_SetInputAction) == 0x000008, "Wrong alignment on WBP_InputBinding_C_SetInputAction");
static_assert(sizeof(WBP_InputBinding_C_SetInputAction) == 0x000008, "Wrong size on WBP_InputBinding_C_SetInputAction");
static_assert(offsetof(WBP_InputBinding_C_SetInputAction, InputAction_0) == 0x000000, "Member 'WBP_InputBinding_C_SetInputAction::InputAction_0' has a wrong offset!");

// Function WBP_InputBinding.WBP_InputBinding_C.UpdateBinding
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_InputBinding_C_UpdateBinding final
{
public:
	class FName                                   CallFunc_GetKeyName_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsValid_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0010)()
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBinding_C_UpdateBinding) == 0x000008, "Wrong alignment on WBP_InputBinding_C_UpdateBinding");
static_assert(sizeof(WBP_InputBinding_C_UpdateBinding) == 0x0000A0, "Wrong size on WBP_InputBinding_C_UpdateBinding");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_GetKeyName_ReturnValue) == 0x000000, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_GetKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_Key_IsValid_ReturnValue) == 0x000008, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_Key_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_GetObjectName_ReturnValue) == 0x000040, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000098, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_InputBinding_C_UpdateBinding, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00009C, "Member 'WBP_InputBinding_C_UpdateBinding::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

}

