#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchStatusOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"
#include "Matcha_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C
// 0x0068 (0x0400 - 0x0398)
class UWBP_MatchStatusOverlay_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewRareChest;                                      // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_01;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EventsOverlay;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PinkGlitchyLines;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_BG;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_Text;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Squares;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchaZoneUIData*                      BoundZoneUIData;                                   // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_InGameInfoBar_C*                   InfoBarRef;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HideGameplayNotificationHandle;                    // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousGameplayEventId;                           // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void BindZoneUIData(class UMatchaZoneUIData* ZoneUIData);
	void DoPlayerCountWarning(int32 PlayersRemaining, bool IsMatchStart);
	void ExecuteUbergraph_WBP_MatchStatusOverlay(int32 EntryPoint);
	class FText Get_WarningTimeDisplay_Text(double TimeInSeconds);
	void HideText();
	void OnCycleIndexChanged(int32 OldValue, int32 NewValue);
	void OnInitialized();
	void OnIsShrinkingChanged(bool OldValue, bool NewValue);
	void OnMatchPhaseChanged(int32 OldValue, int32 NewValue);
	void OnSecondsUntilShrinkChanged(float OldValue, float NewValue);
	void OnWorldUIDataUpdated();
	void ProcessNewGameplayEvent(const struct FMatchaGameplayEventNotificationData& NotificationData);
	void ResetUI();
	void ShowChestUnlockStartedText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UnbindData(class UOdyUIData* OldUIData);
	void UnbindZoneUIData(class UMatchaZoneUIData* Zone_UIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MatchStatusOverlay_C">();
	}
	static class UWBP_MatchStatusOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MatchStatusOverlay_C>();
	}
};
static_assert(alignof(UWBP_MatchStatusOverlay_C) == 0x000008, "Wrong alignment on UWBP_MatchStatusOverlay_C");
static_assert(sizeof(UWBP_MatchStatusOverlay_C) == 0x000400, "Wrong size on UWBP_MatchStatusOverlay_C");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, UberGraphFrame) == 0x000398, "Member 'UWBP_MatchStatusOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, NewRareChest) == 0x0003A0, "Member 'UWBP_MatchStatusOverlay_C::NewRareChest' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, BG_01) == 0x0003A8, "Member 'UWBP_MatchStatusOverlay_C::BG_01' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, EventsOverlay) == 0x0003B0, "Member 'UWBP_MatchStatusOverlay_C::EventsOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, Overlay) == 0x0003B8, "Member 'UWBP_MatchStatusOverlay_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, PinkGlitchyLines) == 0x0003C0, "Member 'UWBP_MatchStatusOverlay_C::PinkGlitchyLines' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, RetainerBox_BG) == 0x0003C8, "Member 'UWBP_MatchStatusOverlay_C::RetainerBox_BG' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, RetainerBox_Text) == 0x0003D0, "Member 'UWBP_MatchStatusOverlay_C::RetainerBox_Text' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, Squares) == 0x0003D8, "Member 'UWBP_MatchStatusOverlay_C::Squares' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, BoundZoneUIData) == 0x0003E0, "Member 'UWBP_MatchStatusOverlay_C::BoundZoneUIData' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, InfoBarRef) == 0x0003E8, "Member 'UWBP_MatchStatusOverlay_C::InfoBarRef' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, HideGameplayNotificationHandle) == 0x0003F0, "Member 'UWBP_MatchStatusOverlay_C::HideGameplayNotificationHandle' has a wrong offset!");
static_assert(offsetof(UWBP_MatchStatusOverlay_C, PreviousGameplayEventId) == 0x0003F8, "Member 'UWBP_MatchStatusOverlay_C::PreviousGameplayEventId' has a wrong offset!");

}

