#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialOptions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SocialOptions.WBP_SocialOptions_C
// 0x0048 (0x03E0 - 0x0398)
class UWBP_SocialOptions_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_SocialOptions_ButtonTab_C*         InvitedTab_Button;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_InviteOption_C*           InviteOption;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Party_C*                           Party;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ReceivedInvites_C*                 ReceivedInvites;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialOptions_ButtonTab_C*         RequestsTab_Button;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SentInvites_C*                     SentInvites;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SocialPartyOptions_Vertical;                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_SocialOptions;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void BndEvt__WBP_SocialOptions_InvitedTab_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__WBP_SocialOptions_RequestsTab_Button_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void ChangedPartyState(bool OldValue, bool NewValue);
	void ExecuteUbergraph_WBP_SocialOptions(int32 EntryPoint);
	void HandleReceivedInvitesUpdated(const TArray<class UMatchaPlayerProfileUIData*>& ProfileList);
	void HandleSentInvitesUpdated(const TArray<class UMatchaPlayerProfileUIData*>& ProfileList);
	void PreConstruct(bool IsDesignTime);
	void SetTabOptionToStart(bool UseRequestsTab);
	void UnbindData(class UOdyUIData* OldUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SocialOptions_C">();
	}
	static class UWBP_SocialOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SocialOptions_C>();
	}
};
static_assert(alignof(UWBP_SocialOptions_C) == 0x000008, "Wrong alignment on UWBP_SocialOptions_C");
static_assert(sizeof(UWBP_SocialOptions_C) == 0x0003E0, "Wrong size on UWBP_SocialOptions_C");
static_assert(offsetof(UWBP_SocialOptions_C, UberGraphFrame) == 0x000398, "Member 'UWBP_SocialOptions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SocialOptions_C, InvitedTab_Button) == 0x0003A0, "Member 'UWBP_SocialOptions_C::InvitedTab_Button' has a wrong offset!");
static_assert(offsetof(UWBP_SocialOptions_C, InviteOption) == 0x0003A8, "Member 'UWBP_SocialOptions_C::InviteOption' has a wrong offset!");
static_assert(offsetof(UWBP_SocialOptions_C, Party) == 0x0003B0, "Member 'UWBP_SocialOptions_C::Party' has a wrong offset!");
static_assert(offsetof(UWBP_SocialOptions_C, ReceivedInvites) == 0x0003B8, "Member 'UWBP_SocialOptions_C::ReceivedInvites' has a wrong offset!");
static_assert(offsetof(UWBP_SocialOptions_C, RequestsTab_Button) == 0x0003C0, "Member 'UWBP_SocialOptions_C::RequestsTab_Button' has a wrong offset!");
static_assert(offsetof(UWBP_SocialOptions_C, SentInvites) == 0x0003C8, "Member 'UWBP_SocialOptions_C::SentInvites' has a wrong offset!");
static_assert(offsetof(UWBP_SocialOptions_C, SocialPartyOptions_Vertical) == 0x0003D0, "Member 'UWBP_SocialOptions_C::SocialPartyOptions_Vertical' has a wrong offset!");
static_assert(offsetof(UWBP_SocialOptions_C, Switcher_SocialOptions) == 0x0003D8, "Member 'UWBP_SocialOptions_C::Switcher_SocialOptions' has a wrong offset!");

}

