#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FinalZoneMinimapIndicator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "WBP_MinimapIndicator_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FinalZoneMinimapIndicator.WBP_FinalZoneMinimapIndicator_C
// 0x0040 (0x0410 - 0x03D0)
class UWBP_FinalZoneMinimapIndicator_C final : public UWBP_MinimapIndicator_Base_C
{
public:
	class UImage*                                 Image_102;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsZoneActive;                                      // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldPosition;                                     // 0x03E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldSize;                                         // 0x03F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FinalZoneMinimapIndicator_C">();
	}
	static class UWBP_FinalZoneMinimapIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FinalZoneMinimapIndicator_C>();
	}
};
static_assert(alignof(UWBP_FinalZoneMinimapIndicator_C) == 0x000008, "Wrong alignment on UWBP_FinalZoneMinimapIndicator_C");
static_assert(sizeof(UWBP_FinalZoneMinimapIndicator_C) == 0x000410, "Wrong size on UWBP_FinalZoneMinimapIndicator_C");
static_assert(offsetof(UWBP_FinalZoneMinimapIndicator_C, Image_102) == 0x0003D0, "Member 'UWBP_FinalZoneMinimapIndicator_C::Image_102' has a wrong offset!");
static_assert(offsetof(UWBP_FinalZoneMinimapIndicator_C, IsZoneActive) == 0x0003D8, "Member 'UWBP_FinalZoneMinimapIndicator_C::IsZoneActive' has a wrong offset!");
static_assert(offsetof(UWBP_FinalZoneMinimapIndicator_C, WorldPosition) == 0x0003E0, "Member 'UWBP_FinalZoneMinimapIndicator_C::WorldPosition' has a wrong offset!");
static_assert(offsetof(UWBP_FinalZoneMinimapIndicator_C, WorldSize) == 0x0003F8, "Member 'UWBP_FinalZoneMinimapIndicator_C::WorldSize' has a wrong offset!");

}

