#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_CharacterSelect

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "StructUtils_structs.hpp"
#include "FCharacterSelectEntryUIData_InitParams_structs.hpp"
#include "Engine_structs.hpp"
#include "OdyUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_CharacterSelect_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterSelect_C_BindData) == 0x000008, "Wrong alignment on WBP_Menu_CharacterSelect_C_BindData");
static_assert(sizeof(WBP_Menu_CharacterSelect_C_BindData) == 0x000008, "Wrong size on WBP_Menu_CharacterSelect_C_BindData");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_BindData, NewUIData) == 0x000000, "Member 'WBP_Menu_CharacterSelect_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_CharacterSelect_C_BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterSelect_C_BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_CharacterSelect_C_BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_Menu_CharacterSelect_C_BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_Menu_CharacterSelect_C_BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_Menu_CharacterSelect_C_BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_Menu_CharacterSelect_C_BndEvt__WBP_Menu_CharacterSelect_CharacterTileView_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.CharacterClassChanged
// 0x0100 (0x0100 - 0x0000)
struct WBP_Menu_CharacterSelect_C_CharacterClassChanged final
{
public:
	class UClass*                                 CharacterClass;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDesignTimeDebug;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UOdyUIAssetData*                        CallFunc_GetUIAssetData_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_AssetUIData_MatchaCharacter_C*      K2Node_DynamicCast_AsBP_Asset_UI_Data_Matcha_Character; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           CallFunc_GetAvailableCharacters_ReturnValue;       // 0x0070(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0088(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0010)()
};
static_assert(alignof(WBP_Menu_CharacterSelect_C_CharacterClassChanged) == 0x000008, "Wrong alignment on WBP_Menu_CharacterSelect_C_CharacterClassChanged");
static_assert(sizeof(WBP_Menu_CharacterSelect_C_CharacterClassChanged) == 0x000100, "Wrong size on WBP_Menu_CharacterSelect_C_CharacterClassChanged");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, CharacterClass) == 0x000000, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::CharacterClass' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, IsDesignTimeDebug) == 0x000008, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::IsDesignTimeDebug' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000018, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, CallFunc_GetUIAssetData_ReturnValue) == 0x000040, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::CallFunc_GetUIAssetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, K2Node_DynamicCast_AsBP_Asset_UI_Data_Matcha_Character) == 0x000048, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::K2Node_DynamicCast_AsBP_Asset_UI_Data_Matcha_Character' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000058, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, K2Node_DynamicCast_AsTexture_2D) == 0x000060, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, CallFunc_GetAvailableCharacters_ReturnValue) == 0x000070, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::CallFunc_GetAvailableCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, CallFunc_Array_Find_ReturnValue) == 0x000080, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, CallFunc_Conv_IntToText_ReturnValue) == 0x000088, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CharacterClassChanged, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_CharacterSelect_C_CharacterClassChanged::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.CreateCharacterSelectUIDatas
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas final
{
public:
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterSelectEntryUIData_C*       CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MatchaCharacterUIData_C*            CallFunc_SpawnObject_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFCharacterSelectEntryUIData_InitParams K2Node_MakeStruct_FCharacterSelectEntryUIData_InitParams; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInstancedStruct                       CallFunc_MakeInstancedStruct_ReturnValue;          // 0x0028(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           CallFunc_GetAvailableCharacters_ReturnValue;       // 0x0040(0x0010)(ConstParm, ReferenceParm)
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item;                           // 0x0050(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaCharacterUIData_InitParams      K2Node_MakeStruct_MatchaCharacterUIData_InitParams; // 0x0080(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       CallFunc_MakeInstancedStruct_ReturnValue_1;        // 0x00B0(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas) == 0x000008, "Wrong alignment on WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas");
static_assert(sizeof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas) == 0x0000C8, "Wrong size on WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_GetUIDataModel_ReturnValue) == 0x000000, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_SpawnObject_ReturnValue_1) == 0x000010, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, K2Node_MakeStruct_FCharacterSelectEntryUIData_InitParams) == 0x000020, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::K2Node_MakeStruct_FCharacterSelectEntryUIData_InitParams' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_MakeInstancedStruct_ReturnValue) == 0x000028, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_MakeInstancedStruct_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_GetAvailableCharacters_ReturnValue) == 0x000040, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_GetAvailableCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, K2Node_MakeStruct_MatchaCharacterUIData_InitParams) == 0x000080, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::K2Node_MakeStruct_MatchaCharacterUIData_InitParams' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_MakeInstancedStruct_ReturnValue_1) == 0x0000B0, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_MakeInstancedStruct_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_CharacterSelect_C_CreateCharacterSelectUIDatas::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.ExecuteUbergraph_WBP_Menu_CharacterSelect
// 0x02F8 (0x02F8 - 0x0000)
struct WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MatchaCharacterUIData_C*            K2Node_DynamicCast_AsBP_Matcha_Character_UI_Data;  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MatchaCharacterUIData_C*            K2Node_DynamicCast_AsBP_Matcha_Character_UI_Data_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterSelectEntryUIData_C*       K2Node_CustomEvent_CharacterSelectUIData_1;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterSelectTile_C*             K2Node_DynamicCast_AsWBP_Character_Select_Tile;    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_CharacterSelectEntryUIData_C* CharacterSelectUIData)> K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_CharacterSelectEntryUIData_C* CharacterSelectUIData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterSelectEntryUIData_C*       K2Node_CustomEvent_CharacterSelectUIData;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchaPlayerControllerBase*            K2Node_DynamicCast_AsMatcha_Player_Controller_Base; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchaSnapNetPlayerController*         K2Node_DynamicCast_AsMatcha_Snap_Net_Player_Controller; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_1;             // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaTeamUIData*                      CallFunc_FindTeamUIDataForTeamNumber_ReturnValue;  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOdyNavigationDirection                       K2Node_Event_NavDirection_1;                       // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            K2Node_Event_Args;                                 // 0x0150(0x0050)(ConstParm)
	class FString                                 K2Node_Event_Action;                               // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EOdyNavigationDirection                       K2Node_Event_NavDirection;                         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchaCharacterUIData_InitParams      K2Node_MakeStruct_MatchaCharacterUIData_InitParams; // 0x01B8(0x0028)()
	struct FInstancedStruct                       CallFunc_MakeInstancedStruct_ReturnValue;          // 0x01E0(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity_1; // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_2;             // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MatchaCharacterUIData_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_NewUIData_1;                          // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MatchaCharacterUIData_C*            K2Node_DynamicCast_AsBP_Matcha_Character_UI_Data_2; // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerUIData*                    K2Node_DynamicCast_AsMatcha_Player_UI_Data;        // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCanvas* Canvas, int32 Width, int32 Height)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x027C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x028C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_3;             // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                K2Node_CustomEvent_Canvas;                         // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Width;                          // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Height;                         // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasRenderTarget2D*                  CallFunc_CreateCanvasRenderTarget2D_ReturnValue;   // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x02CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x02DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect) == 0x000008, "Wrong alignment on WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect");
static_assert(sizeof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect) == 0x0002F8, "Wrong size on WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, EntryPoint) == 0x000000, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, Temp_class_Variable) == 0x000008, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity) == 0x000010, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_ClassDynamicCast_bSuccess) == 0x000018, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_Event_NewUIData) == 0x000028, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_Event_OldUIData) == 0x000030, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_AsBP_Matcha_Character_UI_Data) == 0x000038, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_AsBP_Matcha_Character_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_AsBP_Matcha_Character_UI_Data_1) == 0x000048, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_AsBP_Matcha_Character_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_ComponentBoundEvent_Item) == 0x000058, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_ComponentBoundEvent_Widget) == 0x000060, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CustomEvent_CharacterSelectUIData_1) == 0x000068, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CustomEvent_CharacterSelectUIData_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_AsWBP_Character_Select_Tile) == 0x000070, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_AsWBP_Character_Select_Tile' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CustomEvent_CharacterSelectUIData) == 0x0000A0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CustomEvent_CharacterSelectUIData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_AsMatcha_Player_Controller_Base) == 0x0000B0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_AsMatcha_Player_Controller_Base' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000C0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_AsMatcha_Snap_Net_Player_Controller) == 0x0000C8, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_AsMatcha_Snap_Net_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_bSuccess_4) == 0x0000D0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000D1, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_IsValid_ReturnValue) == 0x0000D2, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D4, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_GetUIDataModel_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_4) == 0x000100, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_5) == 0x000110, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_6) == 0x000120, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CustomEvent_OldValue) == 0x000130, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CustomEvent_NewValue) == 0x000134, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_GetUIDataModel_ReturnValue_1) == 0x000138, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_GetUIDataModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_FindTeamUIDataForTeamNumber_ReturnValue) == 0x000140, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_FindTeamUIDataForTeamNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_IsValid_ReturnValue_1) == 0x000148, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_Event_NavDirection_1) == 0x000149, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_Event_NavDirection_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_Event_Args) == 0x000150, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_Event_Args' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_Event_Action) == 0x0001A0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_Event_Action' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_Event_NavDirection) == 0x0001B0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_Event_NavDirection' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_Contains_ReturnValue) == 0x0001B1, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_MakeStruct_MatchaCharacterUIData_InitParams) == 0x0001B8, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_MakeStruct_MatchaCharacterUIData_InitParams' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_MakeInstancedStruct_ReturnValue) == 0x0001E0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_MakeInstancedStruct_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0001F0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0001F8, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_IsValid_ReturnValue_2) == 0x000200, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_PlayAnimation_ReturnValue) == 0x000208, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000210, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000218, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity_1) == 0x000220, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_ClassDynamicCast_bSuccess_1) == 0x000228, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_GetUIDataModel_ReturnValue_2) == 0x000230, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_GetUIDataModel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_7) == 0x000238, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_SpawnObject_ReturnValue) == 0x000248, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_Event_NewUIData_1) == 0x000250, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_Event_NewUIData_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_AsBP_Matcha_Character_UI_Data_2) == 0x000258, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_AsBP_Matcha_Character_UI_Data_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_bSuccess_5) == 0x000260, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_GetOuterObject_ReturnValue) == 0x000268, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_AsMatcha_Player_UI_Data) == 0x000270, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_AsMatcha_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_DynamicCast_bSuccess_6) == 0x000278, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_8) == 0x00027C, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_9) == 0x00028C, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_GetUIDataModel_ReturnValue_3) == 0x0002A0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_GetUIDataModel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0002A8, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CustomEvent_Canvas) == 0x0002B0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CustomEvent_Canvas' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CustomEvent_Width) == 0x0002B8, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CustomEvent_Width' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CustomEvent_Height) == 0x0002BC, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CustomEvent_Height' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_CreateCanvasRenderTarget2D_ReturnValue) == 0x0002C0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_CreateCanvasRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_Event_IsDesignTime) == 0x0002C8, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_10) == 0x0002CC, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, K2Node_CreateDelegate_OutputDelegate_11) == 0x0002DC, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect, CallFunc_PlayAnimation_ReturnValue_1) == 0x0002F0, "Member 'WBP_Menu_CharacterSelect_C_ExecuteUbergraph_WBP_Menu_CharacterSelect::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.OnCharacterClicked_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_CharacterSelect_C_OnCharacterClicked_Event final
{
public:
	class UBP_CharacterSelectEntryUIData_C*       CharacterSelectUIData;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterSelect_C_OnCharacterClicked_Event) == 0x000008, "Wrong alignment on WBP_Menu_CharacterSelect_C_OnCharacterClicked_Event");
static_assert(sizeof(WBP_Menu_CharacterSelect_C_OnCharacterClicked_Event) == 0x000008, "Wrong size on WBP_Menu_CharacterSelect_C_OnCharacterClicked_Event");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_OnCharacterClicked_Event, CharacterSelectUIData) == 0x000000, "Member 'WBP_Menu_CharacterSelect_C_OnCharacterClicked_Event::CharacterSelectUIData' has a wrong offset!");

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.OnCharacterHovered_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_CharacterSelect_C_OnCharacterHovered_Event final
{
public:
	class UBP_CharacterSelectEntryUIData_C*       CharacterSelectUIData;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterSelect_C_OnCharacterHovered_Event) == 0x000008, "Wrong alignment on WBP_Menu_CharacterSelect_C_OnCharacterHovered_Event");
static_assert(sizeof(WBP_Menu_CharacterSelect_C_OnCharacterHovered_Event) == 0x000008, "Wrong size on WBP_Menu_CharacterSelect_C_OnCharacterHovered_Event");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_OnCharacterHovered_Event, CharacterSelectUIData) == 0x000000, "Member 'WBP_Menu_CharacterSelect_C_OnCharacterHovered_Event::CharacterSelectUIData' has a wrong offset!");

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.OnLoaded_6FC00F2E4B6D1BDD4F67E58FB7F221F6
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_CharacterSelect_C_OnLoaded_6FC00F2E4B6D1BDD4F67E58FB7F221F6 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterSelect_C_OnLoaded_6FC00F2E4B6D1BDD4F67E58FB7F221F6) == 0x000008, "Wrong alignment on WBP_Menu_CharacterSelect_C_OnLoaded_6FC00F2E4B6D1BDD4F67E58FB7F221F6");
static_assert(sizeof(WBP_Menu_CharacterSelect_C_OnLoaded_6FC00F2E4B6D1BDD4F67E58FB7F221F6) == 0x000008, "Wrong size on WBP_Menu_CharacterSelect_C_OnLoaded_6FC00F2E4B6D1BDD4F67E58FB7F221F6");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_OnLoaded_6FC00F2E4B6D1BDD4F67E58FB7F221F6, Loaded) == 0x000000, "Member 'WBP_Menu_CharacterSelect_C_OnLoaded_6FC00F2E4B6D1BDD4F67E58FB7F221F6::Loaded' has a wrong offset!");

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.OnNavigatedAway
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_CharacterSelect_C_OnNavigatedAway final
{
public:
	EOdyNavigationDirection                       NavDirection;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterSelect_C_OnNavigatedAway) == 0x000001, "Wrong alignment on WBP_Menu_CharacterSelect_C_OnNavigatedAway");
static_assert(sizeof(WBP_Menu_CharacterSelect_C_OnNavigatedAway) == 0x000001, "Wrong size on WBP_Menu_CharacterSelect_C_OnNavigatedAway");
static_assert(offsetof(WBP_Menu_CharacterSelect_C_OnNavigatedAway, NavDirection) == 0x000000, "Member 'WBP_Menu_CharacterSelect_C_OnNavigatedAway::NavDirection' has a wrong offset!");

// Function WBP_Menu_CharacterSelect.WBP_Menu_CharacterSelect_C.OnNavigatedTo
// 0x0068 (0x0068 - 0x0000)
