#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchStatusOverlay

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_MatchStatusOverlay_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_BindData) == 0x000008, "Wrong alignment on WBP_MatchStatusOverlay_C_BindData");
static_assert(sizeof(WBP_MatchStatusOverlay_C_BindData) == 0x000008, "Wrong size on WBP_MatchStatusOverlay_C_BindData");
static_assert(offsetof(WBP_MatchStatusOverlay_C_BindData, NewUIData) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.BindZoneUIData
// 0x0008 (0x0008 - 0x0000)
struct WBP_MatchStatusOverlay_C_BindZoneUIData final
{
public:
	class UMatchaZoneUIData*                      ZoneUIData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_BindZoneUIData) == 0x000008, "Wrong alignment on WBP_MatchStatusOverlay_C_BindZoneUIData");
static_assert(sizeof(WBP_MatchStatusOverlay_C_BindZoneUIData) == 0x000008, "Wrong size on WBP_MatchStatusOverlay_C_BindZoneUIData");
static_assert(offsetof(WBP_MatchStatusOverlay_C_BindZoneUIData, ZoneUIData) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_BindZoneUIData::ZoneUIData' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.DoPlayerCountWarning
// 0x0008 (0x0008 - 0x0000)
struct WBP_MatchStatusOverlay_C_DoPlayerCountWarning final
{
public:
	int32                                         PlayersRemaining;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMatchStart;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_DoPlayerCountWarning) == 0x000004, "Wrong alignment on WBP_MatchStatusOverlay_C_DoPlayerCountWarning");
static_assert(sizeof(WBP_MatchStatusOverlay_C_DoPlayerCountWarning) == 0x000008, "Wrong size on WBP_MatchStatusOverlay_C_DoPlayerCountWarning");
static_assert(offsetof(WBP_MatchStatusOverlay_C_DoPlayerCountWarning, PlayersRemaining) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_DoPlayerCountWarning::PlayersRemaining' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_DoPlayerCountWarning, IsMatchStart) == 0x000004, "Member 'WBP_MatchStatusOverlay_C_DoPlayerCountWarning::IsMatchStart' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.ExecuteUbergraph_WBP_MatchStatusOverlay
// 0x0178 (0x0178 - 0x0000)
struct WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_1;  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_2;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue;         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventRenderer_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue_1; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayersRemaining;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsMatchStart;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventRenderer_ReturnValue_1;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OldValue_1;                     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue_1;                     // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_OldValue_2;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_2;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue_2; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue_3; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventRenderer_ReturnValue_2;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventRenderer_ReturnValue_3;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue_3;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_3;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaZoneUIData*                      K2Node_CustomEvent_Zone_UIData;                    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaZoneUIData*                      K2Node_CustomEvent_ZoneUIData;                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool OldValue, bool NewValue)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float OldValue, float NewValue)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay) == 0x000008, "Wrong alignment on WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay");
static_assert(sizeof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay) == 0x000178, "Wrong size on WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, EntryPoint) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_OldValue) == 0x000004, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_NewValue) == 0x000008, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_GetValidValue_ReturnValue) == 0x00000D, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_Event_NewUIData) == 0x000010, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data) == 0x000018, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_Event_OldUIData) == 0x000028, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_1) == 0x000030, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_GetUIData_ReturnValue) == 0x000040, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_2) == 0x000048, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_2' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_BoolBinding_GetValue_ReturnValue) == 0x000051, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_BoolBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_IsValid_ReturnValue) == 0x000052, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_GetOwningPlayerCameraManager_ReturnValue) == 0x000058, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_GetOwningPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_AkEventRenderer_ReturnValue) == 0x000060, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_AkEventRenderer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_GetUIDataModel_ReturnValue) == 0x000068, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_GetOwningPlayerCameraManager_ReturnValue_1) == 0x000070, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_GetOwningPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_PlayersRemaining) == 0x000078, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_PlayersRemaining' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_IsMatchStart) == 0x00007C, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_IsMatchStart' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_AkEventRenderer_ReturnValue_1) == 0x000080, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_AkEventRenderer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_OldValue_1) == 0x000084, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_NewValue_1) == 0x000085, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_OldValue_2) == 0x000088, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_OldValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_NewValue_2) == 0x00008C, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_GetOwningPlayerCameraManager_ReturnValue_2) == 0x000090, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_GetOwningPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_GetOwningPlayerCameraManager_ReturnValue_3) == 0x000098, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_GetOwningPlayerCameraManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_AkEventRenderer_ReturnValue_2) == 0x0000A0, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_AkEventRenderer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_AkEventRenderer_ReturnValue_3) == 0x0000A4, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_AkEventRenderer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_OldValue_3) == 0x0000A8, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_OldValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_NewValue_3) == 0x0000AC, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_NewValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_Zone_UIData) == 0x0000B8, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_Zone_UIData' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_IsValid_ReturnValue_2) == 0x0000C0, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CustomEvent_ZoneUIData) == 0x0000C8, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CustomEvent_ZoneUIData' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000D0, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_Event_MyGeometry) == 0x0000D4, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_Event_InDeltaTime) == 0x00010C, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CreateDelegate_OutputDelegate) == 0x000110, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000120, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000130, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CreateDelegate_OutputDelegate_2) == 0x000138, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CreateDelegate_OutputDelegate_3) == 0x000148, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CreateDelegate_OutputDelegate_4) == 0x000158, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay, K2Node_CreateDelegate_OutputDelegate_5) == 0x000168, "Member 'WBP_MatchStatusOverlay_C_ExecuteUbergraph_WBP_MatchStatusOverlay::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.Get_WarningTimeDisplay_Text
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text final
{
public:
	double                                        TimeInSeconds;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0010)()
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)()
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0100(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0118(0x0048)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0168(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0178(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0188(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0198(0x0010)()
};
static_assert(alignof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text) == 0x000008, "Wrong alignment on WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text");
static_assert(sizeof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text) == 0x0001A8, "Wrong size on WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, TimeInSeconds) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::TimeInSeconds' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, ReturnValue) == 0x000008, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, Temp_bool_Variable) == 0x000018, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000019, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00001A, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_FFloor_ReturnValue) == 0x00001C, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_FFloor_ReturnValue_1) == 0x000020, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_Divide_IntInt_ReturnValue) == 0x000038, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000088, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, K2Node_MakeArray_Array) == 0x000090, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_Percent_IntInt_ReturnValue) == 0x0000F8, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, Temp_text_Variable) == 0x000100, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000110, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, K2Node_MakeStruct_FormatArgumentData_2) == 0x000118, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, Temp_bool_Variable_1) == 0x000160, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, K2Node_MakeArray_Array_1) == 0x000168, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, CallFunc_Format_ReturnValue_1) == 0x000178, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, K2Node_Select_Default) == 0x000188, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text, K2Node_Select_Default_1) == 0x000198, "Member 'WBP_MatchStatusOverlay_C_Get_WarningTimeDisplay_Text::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.OnCycleIndexChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_MatchStatusOverlay_C_OnCycleIndexChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_OnCycleIndexChanged) == 0x000004, "Wrong alignment on WBP_MatchStatusOverlay_C_OnCycleIndexChanged");
static_assert(sizeof(WBP_MatchStatusOverlay_C_OnCycleIndexChanged) == 0x000008, "Wrong size on WBP_MatchStatusOverlay_C_OnCycleIndexChanged");
static_assert(offsetof(WBP_MatchStatusOverlay_C_OnCycleIndexChanged, OldValue) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_OnCycleIndexChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_OnCycleIndexChanged, NewValue) == 0x000004, "Member 'WBP_MatchStatusOverlay_C_OnCycleIndexChanged::NewValue' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.OnIsShrinkingChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_MatchStatusOverlay_C_OnIsShrinkingChanged final
{
public:
	bool                                          OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_OnIsShrinkingChanged) == 0x000001, "Wrong alignment on WBP_MatchStatusOverlay_C_OnIsShrinkingChanged");
static_assert(sizeof(WBP_MatchStatusOverlay_C_OnIsShrinkingChanged) == 0x000002, "Wrong size on WBP_MatchStatusOverlay_C_OnIsShrinkingChanged");
static_assert(offsetof(WBP_MatchStatusOverlay_C_OnIsShrinkingChanged, OldValue) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_OnIsShrinkingChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_OnIsShrinkingChanged, NewValue) == 0x000001, "Member 'WBP_MatchStatusOverlay_C_OnIsShrinkingChanged::NewValue' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.OnMatchPhaseChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_MatchStatusOverlay_C_OnMatchPhaseChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_OnMatchPhaseChanged) == 0x000004, "Wrong alignment on WBP_MatchStatusOverlay_C_OnMatchPhaseChanged");
static_assert(sizeof(WBP_MatchStatusOverlay_C_OnMatchPhaseChanged) == 0x000008, "Wrong size on WBP_MatchStatusOverlay_C_OnMatchPhaseChanged");
static_assert(offsetof(WBP_MatchStatusOverlay_C_OnMatchPhaseChanged, OldValue) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_OnMatchPhaseChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_OnMatchPhaseChanged, NewValue) == 0x000004, "Member 'WBP_MatchStatusOverlay_C_OnMatchPhaseChanged::NewValue' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.OnSecondsUntilShrinkChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_MatchStatusOverlay_C_OnSecondsUntilShrinkChanged final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_OnSecondsUntilShrinkChanged) == 0x000004, "Wrong alignment on WBP_MatchStatusOverlay_C_OnSecondsUntilShrinkChanged");
static_assert(sizeof(WBP_MatchStatusOverlay_C_OnSecondsUntilShrinkChanged) == 0x000008, "Wrong size on WBP_MatchStatusOverlay_C_OnSecondsUntilShrinkChanged");
static_assert(offsetof(WBP_MatchStatusOverlay_C_OnSecondsUntilShrinkChanged, OldValue) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_OnSecondsUntilShrinkChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_OnSecondsUntilShrinkChanged, NewValue) == 0x000004, "Member 'WBP_MatchStatusOverlay_C_OnSecondsUntilShrinkChanged::NewValue' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.ProcessNewGameplayEvent
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent final
{
public:
	struct FMatchaGameplayEventNotificationData   NotificationData;                                  // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm)
	EMatchaGameplayEventType                      NewEventType;                                      // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnRegion                                  NewEventRegion;                                    // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventRenderer_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_SnapNetPropertyInt32ToInt_ReturnValue; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_SnapNetPropertyEnumToByte_ReturnValue; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_SnapNetPropertyEnumToByte_ReturnValue_1; // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent) == 0x000008, "Wrong alignment on WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent");
static_assert(sizeof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent) == 0x0000F8, "Wrong size on WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, NotificationData) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::NotificationData' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, NewEventType) == 0x0000C8, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::NewEventType' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, NewEventRegion) == 0x0000C9, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::NewEventRegion' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_GetOwningPlayerCameraManager_ReturnValue) == 0x0000D0, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_GetOwningPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_AkEventRenderer_ReturnValue) == 0x0000D8, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_AkEventRenderer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_Conv_SnapNetPropertyInt32ToInt_ReturnValue) == 0x0000DC, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_Conv_SnapNetPropertyInt32ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_Conv_SnapNetPropertyEnumToByte_ReturnValue) == 0x0000E0, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_Conv_SnapNetPropertyEnumToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_GetValidValue_ReturnValue) == 0x0000E1, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_Conv_SnapNetPropertyEnumToByte_ReturnValue_1) == 0x0000E2, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_Conv_SnapNetPropertyEnumToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_GetValidValue_ReturnValue_1) == 0x0000E3, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000E4, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000F0, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent, K2Node_SwitchEnum_CmpSuccess) == 0x0000F1, "Member 'WBP_MatchStatusOverlay_C_ProcessNewGameplayEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_MatchStatusOverlay_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_Tick) == 0x000004, "Wrong alignment on WBP_MatchStatusOverlay_C_Tick");
static_assert(sizeof(WBP_MatchStatusOverlay_C_Tick) == 0x00003C, "Wrong size on WBP_MatchStatusOverlay_C_Tick");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MatchStatusOverlay_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_MatchStatusOverlay_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_MatchStatusOverlay_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_UnbindData) == 0x000008, "Wrong alignment on WBP_MatchStatusOverlay_C_UnbindData");
static_assert(sizeof(WBP_MatchStatusOverlay_C_UnbindData) == 0x000008, "Wrong size on WBP_MatchStatusOverlay_C_UnbindData");
static_assert(offsetof(WBP_MatchStatusOverlay_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_UnbindData::OldUIData' has a wrong offset!");

// Function WBP_MatchStatusOverlay.WBP_MatchStatusOverlay_C.UnbindZoneUIData
// 0x0008 (0x0008 - 0x0000)
struct WBP_MatchStatusOverlay_C_UnbindZoneUIData final
{
public:
	class UMatchaZoneUIData*                      Zone_UIData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchStatusOverlay_C_UnbindZoneUIData) == 0x000008, "Wrong alignment on WBP_MatchStatusOverlay_C_UnbindZoneUIData");
static_assert(sizeof(WBP_MatchStatusOverlay_C_UnbindZoneUIData) == 0x000008, "Wrong size on WBP_MatchStatusOverlay_C_UnbindZoneUIData");
static_assert(offsetof(WBP_MatchStatusOverlay_C_UnbindZoneUIData, Zone_UIData) == 0x000000, "Member 'WBP_MatchStatusOverlay_C_UnbindZoneUIData::Zone_UIData' has a wrong offset!");

}

