#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FloatingIndicator_TimedChest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_FloatingIndicator_TimedChest.WBP_FloatingIndicator_TimedChest_C.ExecuteUbergraph_WBP_FloatingIndicator_TimedChest
// 0x0080 (0x0080 - 0x0000)
struct WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0010)()
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest) == 0x000008, "Wrong alignment on WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest");
static_assert(sizeof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest) == 0x000080, "Wrong size on WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, EntryPoint) == 0x000000, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, Temp_bool_Variable) == 0x000004, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, Temp_byte_Variable) == 0x000005, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000048, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000050, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, CallFunc_Conv_IntToText_ReturnValue) == 0x000058, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, CallFunc_SafeDivide_ReturnValue) == 0x000068, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000070, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000078, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, K2Node_Select_Default) == 0x000079, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00007C, "Member 'WBP_FloatingIndicator_TimedChest_C_ExecuteUbergraph_WBP_FloatingIndicator_TimedChest::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_FloatingIndicator_TimedChest.WBP_FloatingIndicator_TimedChest_C.SetChestIndicator
// 0x0008 (0x0008 - 0x0000)
struct WBP_FloatingIndicator_TimedChest_C_SetChestIndicator final
{
public:
	class AR_TimedChest_C*                        Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicator_TimedChest_C_SetChestIndicator) == 0x000008, "Wrong alignment on WBP_FloatingIndicator_TimedChest_C_SetChestIndicator");
static_assert(sizeof(WBP_FloatingIndicator_TimedChest_C_SetChestIndicator) == 0x000008, "Wrong size on WBP_FloatingIndicator_TimedChest_C_SetChestIndicator");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_SetChestIndicator, Actor) == 0x000000, "Member 'WBP_FloatingIndicator_TimedChest_C_SetChestIndicator::Actor' has a wrong offset!");

// Function WBP_FloatingIndicator_TimedChest.WBP_FloatingIndicator_TimedChest_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_FloatingIndicator_TimedChest_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicator_TimedChest_C_Tick) == 0x000004, "Wrong alignment on WBP_FloatingIndicator_TimedChest_C_Tick");
static_assert(sizeof(WBP_FloatingIndicator_TimedChest_C_Tick) == 0x00003C, "Wrong size on WBP_FloatingIndicator_TimedChest_C_Tick");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_FloatingIndicator_TimedChest_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_FloatingIndicator_TimedChest_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_FloatingIndicator_TimedChest.WBP_FloatingIndicator_TimedChest_C.TickIndicator
// 0x0090 (0x0090 - 0x0000)
struct WBP_FloatingIndicator_TimedChest_C_TickIndicator final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0028(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ScreenToWidgetLocal_LocalCoordinate;      // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicator_TimedChest_C_TickIndicator) == 0x000008, "Wrong alignment on WBP_FloatingIndicator_TimedChest_C_TickIndicator");
static_assert(sizeof(WBP_FloatingIndicator_TimedChest_C_TickIndicator) == 0x000090, "Wrong size on WBP_FloatingIndicator_TimedChest_C_TickIndicator");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_TickIndicator, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_FloatingIndicator_TimedChest_C_TickIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_TickIndicator, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'WBP_FloatingIndicator_TimedChest_C_TickIndicator::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_TickIndicator, CallFunc_GetParent_ReturnValue) == 0x000020, "Member 'WBP_FloatingIndicator_TimedChest_C_TickIndicator::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_TickIndicator, CallFunc_GetCachedGeometry_ReturnValue) == 0x000028, "Member 'WBP_FloatingIndicator_TimedChest_C_TickIndicator::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_TickIndicator, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'WBP_FloatingIndicator_TimedChest_C_TickIndicator::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_TickIndicator, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000068, "Member 'WBP_FloatingIndicator_TimedChest_C_TickIndicator::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_TickIndicator, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x000078, "Member 'WBP_FloatingIndicator_TimedChest_C_TickIndicator::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_TickIndicator, CallFunc_ScreenToWidgetLocal_LocalCoordinate) == 0x000080, "Member 'WBP_FloatingIndicator_TimedChest_C_TickIndicator::CallFunc_ScreenToWidgetLocal_LocalCoordinate' has a wrong offset!");

// Function WBP_FloatingIndicator_TimedChest.WBP_FloatingIndicator_TimedChest_C.UpdateCompass
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_FloatingIndicator_TimedChest_C_UpdateCompass final
{
public:
	double                                        CallFunc_GetPI_ReturnValue;                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_HeadingAngle_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass) == 0x000008, "Wrong alignment on WBP_FloatingIndicator_TimedChest_C_UpdateCompass");
static_assert(sizeof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass) == 0x0000A0, "Wrong size on WBP_FloatingIndicator_TimedChest_C_UpdateCompass");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_GetPI_ReturnValue) == 0x000000, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_GetViewportSize_ReturnValue) == 0x000008, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000020, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000030, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_Normal2D_ReturnValue) == 0x000040, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000050, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000068, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_Vector_HeadingAngle_ReturnValue) == 0x000080, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_Vector_HeadingAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000090, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdateCompass, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000098, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdateCompass::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function WBP_FloatingIndicator_TimedChest.WBP_FloatingIndicator_TimedChest_C.UpdatePosition
// 0x0140 (0x0140 - 0x0000)
struct WBP_FloatingIndicator_TimedChest_C_UpdatePosition final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0040(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_1;  // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_3;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_3;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_4;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_4;                        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicator_TimedChest_C_UpdatePosition) == 0x000008, "Wrong alignment on WBP_FloatingIndicator_TimedChest_C_UpdatePosition");
static_assert(sizeof(WBP_FloatingIndicator_TimedChest_C_UpdatePosition) == 0x000140, "Wrong size on WBP_FloatingIndicator_TimedChest_C_UpdatePosition");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdatePosition, Temp_bool_Variable) == 0x000000, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdatePosition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicator_TimedChest_C_UpdatePosition, Temp_byte_Variable) == 0x000001, "Member 'WBP_FloatingIndicator_TimedChest_C_UpdatePosition::Temp_byte_Variable' has a wrong offset!");
