#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SentInvites

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SentInvites.WBP_SentInvites_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_SentInvites_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SentInvites_C_BindData) == 0x000008, "Wrong alignment on WBP_SentInvites_C_BindData");
static_assert(sizeof(WBP_SentInvites_C_BindData) == 0x000008, "Wrong size on WBP_SentInvites_C_BindData");
static_assert(offsetof(WBP_SentInvites_C_BindData, NewUIData) == 0x000000, "Member 'WBP_SentInvites_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_SentInvites.WBP_SentInvites_C.BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_SentInvites.WBP_SentInvites_C.BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_SentInvites.WBP_SentInvites_C.BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(sizeof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(offsetof(WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_SentInvites_C_BndEvt__WBP_SentInvites_InviteEntries_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_SentInvites.WBP_SentInvites_C.ExecuteUbergraph_WBP_SentInvites
// 0x0100 (0x0100 - 0x0000)
struct WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<class UMatchaPlayerProfileUIData*>& ProfileList)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMatchaPlayerProfileUIData*>     K2Node_CustomEvent_ProfileList;                    // 0x0038(0x0010)(ConstParm, ReferenceParm)
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_2;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMatchaPlayerProfileUIData* PlayerProfileUIData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyWidget*                             K2Node_DynamicCast_AsOdy_Widget;                   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_DynamicCast_AsOdy_UI_Data;                  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InviteEntry_C*                     K2Node_DynamicCast_AsWBP_Invite_Entry;             // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InviteEntry_C*                     K2Node_DynamicCast_AsWBP_Invite_Entry_1;           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaPlayerProfileUIData*             K2Node_CustomEvent_PlayerProfileUIData;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaClientServices*                  CallFunc_GetClientServies_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_NameBinding_GetValue_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites) == 0x000008, "Wrong alignment on WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites");
static_assert(sizeof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites) == 0x000100, "Wrong size on WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, EntryPoint) == 0x000000, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_Event_NewUIData) == 0x000008, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data) == 0x000020, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_Event_IsDesignTime) == 0x000029, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_Event_OldUIData) == 0x000030, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_CustomEvent_ProfileList) == 0x000038, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_CustomEvent_ProfileList' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1) == 0x000048, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_ComponentBoundEvent_Item) == 0x000058, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_ComponentBoundEvent_Widget_2) == 0x000060, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_AsOdy_Widget) == 0x000078, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_AsOdy_Widget' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_AsOdy_UI_Data) == 0x000088, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_AsOdy_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_ComponentBoundEvent_Widget_1) == 0x000098, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_AsWBP_Invite_Entry) == 0x0000A0, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_AsWBP_Invite_Entry' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_bSuccess_4) == 0x0000A8, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_ComponentBoundEvent_Widget) == 0x0000B0, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_AsWBP_Invite_Entry_1) == 0x0000B8, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_AsWBP_Invite_Entry_1' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_DynamicCast_bSuccess_5) == 0x0000C0, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, K2Node_CustomEvent_PlayerProfileUIData) == 0x0000C8, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::K2Node_CustomEvent_PlayerProfileUIData' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, CallFunc_GetClientServies_ReturnValue) == 0x0000D0, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::CallFunc_GetClientServies_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, CallFunc_NameBinding_GetValue_ReturnValue) == 0x0000D8, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::CallFunc_NameBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, CallFunc_Conv_NameToString_ReturnValue) == 0x0000E8, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites, CallFunc_Conv_StringToName_ReturnValue) == 0x0000F8, "Member 'WBP_SentInvites_C_ExecuteUbergraph_WBP_SentInvites::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function WBP_SentInvites.WBP_SentInvites_C.HandleSentInvitesUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_SentInvites_C_HandleSentInvitesUpdated final
{
public:
	TArray<class UMatchaPlayerProfileUIData*>     ProfileList;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SentInvites_C_HandleSentInvitesUpdated) == 0x000008, "Wrong alignment on WBP_SentInvites_C_HandleSentInvitesUpdated");
static_assert(sizeof(WBP_SentInvites_C_HandleSentInvitesUpdated) == 0x000010, "Wrong size on WBP_SentInvites_C_HandleSentInvitesUpdated");
static_assert(offsetof(WBP_SentInvites_C_HandleSentInvitesUpdated, ProfileList) == 0x000000, "Member 'WBP_SentInvites_C_HandleSentInvitesUpdated::ProfileList' has a wrong offset!");

// Function WBP_SentInvites.WBP_SentInvites_C.OnEntryCanceled
// 0x0008 (0x0008 - 0x0000)
struct WBP_SentInvites_C_OnEntryCanceled final
{
public:
	class UMatchaPlayerProfileUIData*             PlayerProfileUIData;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SentInvites_C_OnEntryCanceled) == 0x000008, "Wrong alignment on WBP_SentInvites_C_OnEntryCanceled");
static_assert(sizeof(WBP_SentInvites_C_OnEntryCanceled) == 0x000008, "Wrong size on WBP_SentInvites_C_OnEntryCanceled");
static_assert(offsetof(WBP_SentInvites_C_OnEntryCanceled, PlayerProfileUIData) == 0x000000, "Member 'WBP_SentInvites_C_OnEntryCanceled::PlayerProfileUIData' has a wrong offset!");

// Function WBP_SentInvites.WBP_SentInvites_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SentInvites_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SentInvites_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SentInvites_C_PreConstruct");
static_assert(sizeof(WBP_SentInvites_C_PreConstruct) == 0x000001, "Wrong size on WBP_SentInvites_C_PreConstruct");
static_assert(offsetof(WBP_SentInvites_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SentInvites_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SentInvites.WBP_SentInvites_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_SentInvites_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SentInvites_C_UnbindData) == 0x000008, "Wrong alignment on WBP_SentInvites_C_UnbindData");
static_assert(sizeof(WBP_SentInvites_C_UnbindData) == 0x000008, "Wrong size on WBP_SentInvites_C_UnbindData");
static_assert(offsetof(WBP_SentInvites_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_SentInvites_C_UnbindData::OldUIData' has a wrong offset!");

}

