#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Party

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Party.WBP_Party_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Party_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Party_C_BindData) == 0x000008, "Wrong alignment on WBP_Party_C_BindData");
static_assert(sizeof(WBP_Party_C_BindData) == 0x000008, "Wrong size on WBP_Party_C_BindData");
static_assert(offsetof(WBP_Party_C_BindData, NewUIData) == 0x000000, "Member 'WBP_Party_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_Party.WBP_Party_C.BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Party_C_BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Party_C_BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Party_C_BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_Party_C_BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_Party_C_BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_Party_C_BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_Party_C_BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_Party_C_BndEvt__WBP_Party_PartyMembers_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Party.WBP_Party_C.ChangedQueueStatus
// 0x0002 (0x0002 - 0x0000)
struct WBP_Party_C_ChangedQueueStatus final
{
public:
	bool                                          OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Party_C_ChangedQueueStatus) == 0x000001, "Wrong alignment on WBP_Party_C_ChangedQueueStatus");
static_assert(sizeof(WBP_Party_C_ChangedQueueStatus) == 0x000002, "Wrong size on WBP_Party_C_ChangedQueueStatus");
static_assert(offsetof(WBP_Party_C_ChangedQueueStatus, OldValue) == 0x000000, "Member 'WBP_Party_C_ChangedQueueStatus::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ChangedQueueStatus, NewValue) == 0x000001, "Member 'WBP_Party_C_ChangedQueueStatus::NewValue' has a wrong offset!");

// Function WBP_Party.WBP_Party_C.ExecuteUbergraph_WBP_Party
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Party_C_ExecuteUbergraph_WBP_Party final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMatchaPlayerProfileUIData*>     K2Node_CustomEvent_ProfileList;                    // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(TArray<class UMatchaPlayerProfileUIData*>& ProfileList)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_InviteEntry_C*                     K2Node_DynamicCast_AsWBP_Invite_Entry;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data;  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_DynamicCast_AsOdy_UI_Data;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaClientServices*                  CallFunc_GetClientServies_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OldValue;                       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue;                       // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool OldValue, bool NewValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Party_C_ExecuteUbergraph_WBP_Party) == 0x000008, "Wrong alignment on WBP_Party_C_ExecuteUbergraph_WBP_Party");
static_assert(sizeof(WBP_Party_C_ExecuteUbergraph_WBP_Party) == 0x0000B0, "Wrong size on WBP_Party_C_ExecuteUbergraph_WBP_Party");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, EntryPoint) == 0x000000, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_CustomEvent_ProfileList) == 0x000008, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_CustomEvent_ProfileList' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, CallFunc_Array_IsEmpty_ReturnValue) == 0x000028, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_ComponentBoundEvent_Item) == 0x000030, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_ComponentBoundEvent_Widget) == 0x000038, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_Event_OldUIData) == 0x000040, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_DynamicCast_AsWBP_Invite_Entry) == 0x000048, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_DynamicCast_AsWBP_Invite_Entry' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data) == 0x000058, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_DynamicCast_AsOdy_UI_Data) == 0x000068, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_DynamicCast_AsOdy_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_Event_NewUIData) == 0x000078, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1) == 0x000080, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, CallFunc_GetClientServies_ReturnValue) == 0x000090, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::CallFunc_GetClientServies_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_CustomEvent_OldValue) == 0x000099, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_CustomEvent_NewValue) == 0x00009A, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Party_C_ExecuteUbergraph_WBP_Party, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AC, "Member 'WBP_Party_C_ExecuteUbergraph_WBP_Party::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_Party.WBP_Party_C.HandleTeamMembersUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_Party_C_HandleTeamMembersUpdated final
{
public:
	TArray<class UMatchaPlayerProfileUIData*>     ProfileList;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Party_C_HandleTeamMembersUpdated) == 0x000008, "Wrong alignment on WBP_Party_C_HandleTeamMembersUpdated");
static_assert(sizeof(WBP_Party_C_HandleTeamMembersUpdated) == 0x000010, "Wrong size on WBP_Party_C_HandleTeamMembersUpdated");
static_assert(offsetof(WBP_Party_C_HandleTeamMembersUpdated, ProfileList) == 0x000000, "Member 'WBP_Party_C_HandleTeamMembersUpdated::ProfileList' has a wrong offset!");

// Function WBP_Party.WBP_Party_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Party_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Party_C_UnbindData) == 0x000008, "Wrong alignment on WBP_Party_C_UnbindData");
static_assert(sizeof(WBP_Party_C_UnbindData) == 0x000008, "Wrong size on WBP_Party_C_UnbindData");
static_assert(offsetof(WBP_Party_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_Party_C_UnbindData::OldUIData' has a wrong offset!");

}

