#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FloatingIndicators_Panel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_FloatingIndicators_Panel.WBP_FloatingIndicators_Panel_C.AddTimedChestFloatingIndicator
// 0x0028 (0x0028 - 0x0000)
struct WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator final
{
public:
	class AR_TimedChest_C*                        Timed_Chest;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_FloatingIndicator_TimedChest_C*    FloatingIndicator;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_FloatingIndicator_TimedChest_C*    NewParam;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_FloatingIndicator_TimedChest_C*    AvailableFloatingIndicator;                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CreateNew;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator) == 0x000008, "Wrong alignment on WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator");
static_assert(sizeof(WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator) == 0x000028, "Wrong size on WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator, Timed_Chest) == 0x000000, "Member 'WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator::Timed_Chest' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator, FloatingIndicator) == 0x000008, "Member 'WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator::FloatingIndicator' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator, NewParam) == 0x000010, "Member 'WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator, AvailableFloatingIndicator) == 0x000018, "Member 'WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator::AvailableFloatingIndicator' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator, CreateNew) == 0x000020, "Member 'WBP_FloatingIndicators_Panel_C_AddTimedChestFloatingIndicator::CreateNew' has a wrong offset!");

// Function WBP_FloatingIndicators_Panel.WBP_FloatingIndicators_Panel_C.AddAllyIndicator
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_FloatingIndicators_Panel_C_AddAllyIndicator final
{
public:
	class UMatchaPlayerUIData*                    Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_FloatingIndicator_C*               FloatingIndicator;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FloatingIndicator_C*               AvailableFloatingIndicator;                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0048(0x0020)(NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_FloatingIndicator_C*               CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_FloatingIndicator_C*               CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator) == 0x000008, "Wrong alignment on WBP_FloatingIndicators_Panel_C_AddAllyIndicator");
static_assert(sizeof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator) == 0x0000A8, "Wrong size on WBP_FloatingIndicators_Panel_C_AddAllyIndicator");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, Player) == 0x000000, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::Player' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, FloatingIndicator) == 0x000008, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::FloatingIndicator' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, Index_0) == 0x000010, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, AvailableFloatingIndicator) == 0x000018, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::AvailableFloatingIndicator' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, Temp_bool_True_if_break_was_hit_Variable) == 0x000024, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_Not_PreBool_ReturnValue) == 0x000025, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_GetViewportSize_ReturnValue) == 0x000028, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000038, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, K2Node_MakeStruct_Anchors) == 0x000048, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_GetOwningPlayer_ReturnValue) == 0x000068, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_Create_ReturnValue) == 0x000070, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_AddChild_ReturnValue) == 0x000088, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_BooleanAND_ReturnValue) == 0x0000A1, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddAllyIndicator, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000A2, "Member 'WBP_FloatingIndicators_Panel_C_AddAllyIndicator::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_FloatingIndicators_Panel.WBP_FloatingIndicators_Panel_C.AddEnemyIndicator
// 0x0018 (0x0018 - 0x0000)
struct WBP_FloatingIndicators_Panel_C_AddEnemyIndicator final
{
public:
	class UMatchaPlayerUIData*                    PlayerUIData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_FloatingIndicator_C*               FloatingIndicator;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_FloatingIndicator_C*               AvailableFloatingIndicator;                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicators_Panel_C_AddEnemyIndicator) == 0x000008, "Wrong alignment on WBP_FloatingIndicators_Panel_C_AddEnemyIndicator");
static_assert(sizeof(WBP_FloatingIndicators_Panel_C_AddEnemyIndicator) == 0x000018, "Wrong size on WBP_FloatingIndicators_Panel_C_AddEnemyIndicator");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddEnemyIndicator, PlayerUIData) == 0x000000, "Member 'WBP_FloatingIndicators_Panel_C_AddEnemyIndicator::PlayerUIData' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddEnemyIndicator, FloatingIndicator) == 0x000008, "Member 'WBP_FloatingIndicators_Panel_C_AddEnemyIndicator::FloatingIndicator' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_AddEnemyIndicator, AvailableFloatingIndicator) == 0x000010, "Member 'WBP_FloatingIndicators_Panel_C_AddEnemyIndicator::AvailableFloatingIndicator' has a wrong offset!");

// Function WBP_FloatingIndicators_Panel.WBP_FloatingIndicators_Panel_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_FloatingIndicators_Panel_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicators_Panel_C_Tick) == 0x000004, "Wrong alignment on WBP_FloatingIndicators_Panel_C_Tick");
static_assert(sizeof(WBP_FloatingIndicators_Panel_C_Tick) == 0x00003C, "Wrong size on WBP_FloatingIndicators_Panel_C_Tick");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_FloatingIndicators_Panel_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_FloatingIndicators_Panel_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_FloatingIndicators_Panel.WBP_FloatingIndicators_Panel_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_FloatingIndicators_Panel_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicators_Panel_C_BindData) == 0x000008, "Wrong alignment on WBP_FloatingIndicators_Panel_C_BindData");
static_assert(sizeof(WBP_FloatingIndicators_Panel_C_BindData) == 0x000008, "Wrong size on WBP_FloatingIndicators_Panel_C_BindData");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_BindData, NewUIData) == 0x000000, "Member 'WBP_FloatingIndicators_Panel_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_FloatingIndicators_Panel.WBP_FloatingIndicators_Panel_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_FloatingIndicators_Panel_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicators_Panel_C_UnbindData) == 0x000008, "Wrong alignment on WBP_FloatingIndicators_Panel_C_UnbindData");
static_assert(sizeof(WBP_FloatingIndicators_Panel_C_UnbindData) == 0x000008, "Wrong size on WBP_FloatingIndicators_Panel_C_UnbindData");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_FloatingIndicators_Panel_C_UnbindData::OldUIData' has a wrong offset!");

// Function WBP_FloatingIndicators_Panel.WBP_FloatingIndicators_Panel_C.UpdateRelevantEnemyPlayerIndicators
// 0x0010 (0x0010 - 0x0000)
struct WBP_FloatingIndicators_Panel_C_UpdateRelevantEnemyPlayerIndicators final
{
public:
	TArray<int32>                                 RelevantEnemyPlayerIndicesArray;                   // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_FloatingIndicators_Panel_C_UpdateRelevantEnemyPlayerIndicators) == 0x000008, "Wrong alignment on WBP_FloatingIndicators_Panel_C_UpdateRelevantEnemyPlayerIndicators");
static_assert(sizeof(WBP_FloatingIndicators_Panel_C_UpdateRelevantEnemyPlayerIndicators) == 0x000010, "Wrong size on WBP_FloatingIndicators_Panel_C_UpdateRelevantEnemyPlayerIndicators");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_UpdateRelevantEnemyPlayerIndicators, RelevantEnemyPlayerIndicesArray) == 0x000000, "Member 'WBP_FloatingIndicators_Panel_C_UpdateRelevantEnemyPlayerIndicators::RelevantEnemyPlayerIndicesArray' has a wrong offset!");

// Function WBP_FloatingIndicators_Panel.WBP_FloatingIndicators_Panel_C.ExecuteUbergraph_WBP_FloatingIndicators_Panel
// 0x0198 (0x0198 - 0x0000)
struct WBP_FloatingIndicators_Panel_C_ExecuteUbergraph_WBP_FloatingIndicators_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaTeamUIData*                      K2Node_DynamicCast_AsMatcha_Team_UI_Data;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaTeamUIData*                      K2Node_DynamicCast_AsMatcha_Team_UI_Data_1;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaTeamUIData*                      K2Node_DynamicCast_AsMatcha_Team_UI_Data_2;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerUIData*                    CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FloatingIndicator_C*               CallFunc_AddAllyIndicator_FloatingIndicator;       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_FloatingIndicator_C*               CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetWorldRenderPositionForPlayer_OutPosition; // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWorldRenderPositionForPlayer_ReturnValue; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FloatingIndicator_C*               CallFunc_Array_Get_Item_2;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_CustomEvent_RelevantEnemyPlayerIndicesArray; // 0x0140(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaPlayerUIData*                    CallFunc_FindPlayerUIDataForPlayerIndex_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FloatingIndicator_C*               CallFunc_AddEnemyIndicator_FloatingIndicator;      // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FloatingIndicator_C*               CallFunc_Array_Get_Item_4;                         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue_1;                  // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaTeamUIData*                      K2Node_DynamicCast_AsMatcha_Team_UI_Data_3;        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FloatingIndicators_Panel_C_ExecuteUbergraph_WBP_FloatingIndicators_Panel) == 0x000008, "Wrong alignment on WBP_FloatingIndicators_Panel_C_ExecuteUbergraph_WBP_FloatingIndicators_Panel");
static_assert(sizeof(WBP_FloatingIndicators_Panel_C_ExecuteUbergraph_WBP_FloatingIndicators_Panel) == 0x000198, "Wrong size on WBP_FloatingIndicators_Panel_C_ExecuteUbergraph_WBP_FloatingIndicators_Panel");
static_assert(offsetof(WBP_FloatingIndicators_Panel_C_ExecuteUbergraph_WBP_FloatingIndicators_Panel, EntryPoint) == 0x000000, "Member 'WBP_FloatingIndicators_Panel_C_ExecuteUbergraph_WBP_FloatingIndicators_Panel::EntryPoint' has a wrong offset!");
