#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PowerProgressPromptsSection

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.ArmorCountChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_ArmorCountChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_ArmorCountChanged) == 0x000004, "Wrong alignment on WBP_PowerProgressPromptsSection_C_ArmorCountChanged");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_ArmorCountChanged) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_ArmorCountChanged");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ArmorCountChanged, OldValue) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_ArmorCountChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ArmorCountChanged, NewValue) == 0x000004, "Member 'WBP_PowerProgressPromptsSection_C_ArmorCountChanged::NewValue' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.Bind Feet Category Data
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_Bind_Feet_Category_Data final
{
public:
	class UMatchaInventoryCategoryUIData*         CategoryUIData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_Bind_Feet_Category_Data) == 0x000008, "Wrong alignment on WBP_PowerProgressPromptsSection_C_Bind_Feet_Category_Data");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_Bind_Feet_Category_Data) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_Bind_Feet_Category_Data");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_Bind_Feet_Category_Data, CategoryUIData) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_Bind_Feet_Category_Data::CategoryUIData' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.Bind Hands Category Data
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_Bind_Hands_Category_Data final
{
public:
	class UMatchaInventoryCategoryUIData*         CategoryUIData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_Bind_Hands_Category_Data) == 0x000008, "Wrong alignment on WBP_PowerProgressPromptsSection_C_Bind_Hands_Category_Data");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_Bind_Hands_Category_Data) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_Bind_Hands_Category_Data");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_Bind_Hands_Category_Data, CategoryUIData) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_Bind_Hands_Category_Data::CategoryUIData' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.BindBodyCategoryData
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_BindBodyCategoryData final
{
public:
	class UMatchaInventoryCategoryUIData*         CategoryUIData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_BindBodyCategoryData) == 0x000008, "Wrong alignment on WBP_PowerProgressPromptsSection_C_BindBodyCategoryData");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_BindBodyCategoryData) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_BindBodyCategoryData");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_BindBodyCategoryData, CategoryUIData) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_BindBodyCategoryData::CategoryUIData' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_BindData) == 0x000008, "Wrong alignment on WBP_PowerProgressPromptsSection_C_BindData");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_BindData) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_BindData");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_BindData, NewUIData) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.BootsCountChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_BootsCountChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_BootsCountChanged) == 0x000004, "Wrong alignment on WBP_PowerProgressPromptsSection_C_BootsCountChanged");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_BootsCountChanged) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_BootsCountChanged");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_BootsCountChanged, OldValue) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_BootsCountChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_BootsCountChanged, NewValue) == 0x000004, "Member 'WBP_PowerProgressPromptsSection_C_BootsCountChanged::NewValue' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.ExecuteUbergraph_WBP_PowerProgressPromptsSection
// 0x0278 (0x0278 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Show;                                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryUIData*                 K2Node_DynamicCast_AsMatcha_Inventory_UI_Data;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryUIData*                 K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_1;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_CategoryUIData_2;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_OldCategoryUIData_2;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventorySlotUIData*             CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryUIData*                 K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_2;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0094(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventorySlotUIData*             CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryCategoryUIData*         CallFunc_Map_Find_Value;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_OldCategoryUIData_1;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_CategoryUIData_1;               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00DC(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         CallFunc_Map_Find_Value_1;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_CategoryUIData;                 // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventoryCategoryUIData*         K2Node_CustomEvent_OldCategoryUIData;              // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaInventorySlotUIData*             CallFunc_Array_Get_Item_2;                         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText OldValue, class FText NewValue)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_OldValue_8;                     // 0x0178(0x0010)()
	class FText                                   K2Node_CustomEvent_NewValue_8;                     // 0x0188(0x0010)()
	int32                                         K2Node_CustomEvent_OldValue_7;                     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_7;                     // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x01B0(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryCategoryUIData*         CallFunc_Map_Find_Value_2;                         // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_2;      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_OldValue_6;                     // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_6;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText OldValue, class FText NewValue)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_OldValue_5;                     // 0x01E0(0x0010)()
	class FText                                   K2Node_CustomEvent_NewValue_5;                     // 0x01F0(0x0010)()
	int32                                         K2Node_CustomEvent_OldValue_4;                     // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_4;                     // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_OldValue_3;                     // 0x0208(0x0010)()
	class FText                                   K2Node_CustomEvent_NewValue_3;                     // 0x0218(0x0010)()
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0228(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue_2;                     // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_2;                     // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue_1;                     // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_1;                     // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldValue;                       // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldValue, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText OldValue, class FText NewValue)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0264(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection) == 0x000008, "Wrong alignment on WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection) == 0x000278, "Wrong size on WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, EntryPoint) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_Event_Show) == 0x000004, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_Event_Show' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_Event_NewUIData) == 0x000008, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_Event_OldUIData) == 0x000010, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_DynamicCast_AsMatcha_Inventory_UI_Data) == 0x000018, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_DynamicCast_AsMatcha_Inventory_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_1) == 0x000028, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_CategoryUIData_2) == 0x000048, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_CategoryUIData_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldCategoryUIData_2) == 0x000050, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldCategoryUIData_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000078, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_2) == 0x000079, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_GetUIData_ReturnValue) == 0x000080, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_2) == 0x000088, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_DynamicCast_AsMatcha_Inventory_UI_Data_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, Temp_struct_Variable) == 0x000094, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Map_Find_Value) == 0x0000A8, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Map_Find_ReturnValue) == 0x0000B0, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000B1, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_3) == 0x0000B2, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldCategoryUIData_1) == 0x0000B8, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldCategoryUIData_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_CategoryUIData_1) == 0x0000C0, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_CategoryUIData_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_4) == 0x0000C8, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_5) == 0x0000C9, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000CC, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, Temp_struct_Variable_1) == 0x0000DC, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000E4, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Map_Find_Value_1) == 0x0000E8, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Map_Find_ReturnValue_1) == 0x0000F0, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_CategoryUIData) == 0x0000F8, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_CategoryUIData' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_3) == 0x000100, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_6) == 0x000110, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_4) == 0x000114, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_5) == 0x000124, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldCategoryUIData) == 0x000138, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldCategoryUIData' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_6) == 0x000140, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_7) == 0x000150, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000151, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_8) == 0x000152, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Array_Get_Item_2) == 0x000158, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x000160, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_7) == 0x000164, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldValue_8) == 0x000178, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldValue_8' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_NewValue_8) == 0x000188, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_NewValue_8' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldValue_7) == 0x000198, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldValue_7' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_NewValue_7) == 0x00019C, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_NewValue_7' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001A0, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, Temp_struct_Variable_2) == 0x0001B0, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Map_Find_Value_2) == 0x0001B8, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_Map_Find_ReturnValue_2) == 0x0001C0, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_NotEqual_ObjectObject_ReturnValue_2) == 0x0001C1, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_NotEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldValue_6) == 0x0001C4, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldValue_6' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_NewValue_6) == 0x0001C8, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_NewValue_6' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001CC, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldValue_5) == 0x0001E0, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_NewValue_5) == 0x0001F0, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_NewValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldValue_4) == 0x000200, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_NewValue_4) == 0x000204, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_NewValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldValue_3) == 0x000208, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_NewValue_3) == 0x000218, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_NewValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_10) == 0x000228, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldValue_2) == 0x000238, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_NewValue_2) == 0x00023C, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldValue_1) == 0x000240, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_NewValue_1) == 0x000244, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_OldValue) == 0x000248, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CustomEvent_NewValue) == 0x00024C, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_11) == 0x000250, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_9) == 0x000260, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, K2Node_CreateDelegate_OutputDelegate_12) == 0x000264, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_10) == 0x000274, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection, CallFunc_IsValid_ReturnValue_11) == 0x000275, "Member 'WBP_PowerProgressPromptsSection_C_ExecuteUbergraph_WBP_PowerProgressPromptsSection::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.GloveCountChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_GloveCountChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_GloveCountChanged) == 0x000004, "Wrong alignment on WBP_PowerProgressPromptsSection_C_GloveCountChanged");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_GloveCountChanged) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_GloveCountChanged");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_GloveCountChanged, OldValue) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_GloveCountChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_GloveCountChanged, NewValue) == 0x000004, "Member 'WBP_PowerProgressPromptsSection_C_GloveCountChanged::NewValue' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.OnArmorNameChange
// 0x0020 (0x0020 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_OnArmorNameChange final
{
public:
	class FText                                   OldValue;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NewValue;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_OnArmorNameChange) == 0x000008, "Wrong alignment on WBP_PowerProgressPromptsSection_C_OnArmorNameChange");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_OnArmorNameChange) == 0x000020, "Wrong size on WBP_PowerProgressPromptsSection_C_OnArmorNameChange");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnArmorNameChange, OldValue) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_OnArmorNameChange::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnArmorNameChange, NewValue) == 0x000010, "Member 'WBP_PowerProgressPromptsSection_C_OnArmorNameChange::NewValue' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.OnArmorRarityChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_OnArmorRarityChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_OnArmorRarityChanged) == 0x000004, "Wrong alignment on WBP_PowerProgressPromptsSection_C_OnArmorRarityChanged");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_OnArmorRarityChanged) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_OnArmorRarityChanged");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnArmorRarityChanged, OldValue) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_OnArmorRarityChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnArmorRarityChanged, NewValue) == 0x000004, "Member 'WBP_PowerProgressPromptsSection_C_OnArmorRarityChanged::NewValue' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.OnGearNameChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_OnGearNameChanged final
{
public:
	class FText                                   OldValue;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NewValue;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_OnGearNameChanged) == 0x000008, "Wrong alignment on WBP_PowerProgressPromptsSection_C_OnGearNameChanged");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_OnGearNameChanged) == 0x000020, "Wrong size on WBP_PowerProgressPromptsSection_C_OnGearNameChanged");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnGearNameChanged, OldValue) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_OnGearNameChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnGearNameChanged, NewValue) == 0x000010, "Member 'WBP_PowerProgressPromptsSection_C_OnGearNameChanged::NewValue' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.OnGearRarityChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_OnGearRarityChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_OnGearRarityChanged) == 0x000004, "Wrong alignment on WBP_PowerProgressPromptsSection_C_OnGearRarityChanged");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_OnGearRarityChanged) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_OnGearRarityChanged");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnGearRarityChanged, OldValue) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_OnGearRarityChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnGearRarityChanged, NewValue) == 0x000004, "Member 'WBP_PowerProgressPromptsSection_C_OnGearRarityChanged::NewValue' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.OnGlovesNameChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_OnGlovesNameChanged final
{
public:
	class FText                                   OldValue;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NewValue;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_OnGlovesNameChanged) == 0x000008, "Wrong alignment on WBP_PowerProgressPromptsSection_C_OnGlovesNameChanged");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_OnGlovesNameChanged) == 0x000020, "Wrong size on WBP_PowerProgressPromptsSection_C_OnGlovesNameChanged");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnGlovesNameChanged, OldValue) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_OnGlovesNameChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnGlovesNameChanged, NewValue) == 0x000010, "Member 'WBP_PowerProgressPromptsSection_C_OnGlovesNameChanged::NewValue' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.OnGlovesRarityChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_OnGlovesRarityChanged final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_OnGlovesRarityChanged) == 0x000004, "Wrong alignment on WBP_PowerProgressPromptsSection_C_OnGlovesRarityChanged");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_OnGlovesRarityChanged) == 0x000008, "Wrong size on WBP_PowerProgressPromptsSection_C_OnGlovesRarityChanged");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnGlovesRarityChanged, OldValue) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_OnGlovesRarityChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_OnGlovesRarityChanged, NewValue) == 0x000004, "Member 'WBP_PowerProgressPromptsSection_C_OnGlovesRarityChanged::NewValue' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.ShowTooltip
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerProgressPromptsSection_C_ShowTooltip final
{
public:
	bool                                          Show_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_ShowTooltip) == 0x000001, "Wrong alignment on WBP_PowerProgressPromptsSection_C_ShowTooltip");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_ShowTooltip) == 0x000001, "Wrong size on WBP_PowerProgressPromptsSection_C_ShowTooltip");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_ShowTooltip, Show_0) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_ShowTooltip::Show_0' has a wrong offset!");

// Function WBP_PowerProgressPromptsSection.WBP_PowerProgressPromptsSection_C.TryPromptIncreasedGearRarity
// 0x000C (0x000C - 0x0000)
struct WBP_PowerProgressPromptsSection_C_TryPromptIncreasedGearRarity final
{
public:
	int32                                         GearTypeInt;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldRarity;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewRarity;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PowerProgressPromptsSection_C_TryPromptIncreasedGearRarity) == 0x000004, "Wrong alignment on WBP_PowerProgressPromptsSection_C_TryPromptIncreasedGearRarity");
static_assert(sizeof(WBP_PowerProgressPromptsSection_C_TryPromptIncreasedGearRarity) == 0x00000C, "Wrong size on WBP_PowerProgressPromptsSection_C_TryPromptIncreasedGearRarity");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_TryPromptIncreasedGearRarity, GearTypeInt) == 0x000000, "Member 'WBP_PowerProgressPromptsSection_C_TryPromptIncreasedGearRarity::GearTypeInt' has a wrong offset!");
static_assert(offsetof(WBP_PowerProgressPromptsSection_C_TryPromptIncreasedGearRarity, OldRarity) == 0x000004, "Member 'WBP_PowerProgressPromptsSection_C_TryPromptIncreasedGearRarity::OldRarity' has a wrong offset!");
