#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InGameInfoBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InGameInfoBar.WBP_InGameInfoBar_C
// 0x0080 (0x0418 - 0x0398)
class UWBP_InGameInfoBar_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             EarnedKOs;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayersLeft;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        CurrentTimerTime;                                  // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                BoundPlayerState;                                  // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMatchaTeamUIData*>              TeamUIData;                                        // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TotalAlivePlayers;                                 // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalPlayers;                                      // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaZoneUIData*                      BoundZoneUIData;                                   // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShrinking;                                       // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnNumPlayersLeftUpdate;                            // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         StartingTotalPlayers;                              // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 PlayersRemainingThreshold;                         // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BindData(class UOdyUIData* NewUIData);
	void BindZoneUIData(class UMatchaZoneUIData* NewZoneUIData);
	void Construct();
	void ExecuteUbergraph_WBP_InGameInfoBar(int32 EntryPoint);
	class FText Get_ShrinkTimer_Text();
	void OnIsShrinkingChanged(bool OldValue, bool NewValue);
	void OnNumPlayersLeftUpdate__DelegateSignature(int32 NumLeft);
	void OnSecondsUntilShrinkComplete(float OldValue, float NewValue);
	void OnSecondUntilShrinkChange(float OldValue, float NewValue);
	void StartTimer(bool WarningOnly, double TimeToTickdown, double GameTimeStampStarted);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UnbindData(class UOdyUIData* OldUIData);
	void UnbindZoneUIData(class UMatchaZoneUIData* ZoneUIData);
	void UpdateKOAmount(int32 NewKOValue);
	void UpdatePlayerCounts(int32 OldValue, int32 NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InGameInfoBar_C">();
	}
	static class UWBP_InGameInfoBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InGameInfoBar_C>();
	}
};
static_assert(alignof(UWBP_InGameInfoBar_C) == 0x000008, "Wrong alignment on UWBP_InGameInfoBar_C");
static_assert(sizeof(UWBP_InGameInfoBar_C) == 0x000418, "Wrong size on UWBP_InGameInfoBar_C");
static_assert(offsetof(UWBP_InGameInfoBar_C, UberGraphFrame) == 0x000398, "Member 'UWBP_InGameInfoBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, EarnedKOs) == 0x0003A0, "Member 'UWBP_InGameInfoBar_C::EarnedKOs' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, Image) == 0x0003A8, "Member 'UWBP_InGameInfoBar_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, PlayersLeft) == 0x0003B0, "Member 'UWBP_InGameInfoBar_C::PlayersLeft' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, CurrentTimerTime) == 0x0003B8, "Member 'UWBP_InGameInfoBar_C::CurrentTimerTime' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, BoundPlayerState) == 0x0003C0, "Member 'UWBP_InGameInfoBar_C::BoundPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, TeamUIData) == 0x0003C8, "Member 'UWBP_InGameInfoBar_C::TeamUIData' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, TotalAlivePlayers) == 0x0003D8, "Member 'UWBP_InGameInfoBar_C::TotalAlivePlayers' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, TotalPlayers) == 0x0003DC, "Member 'UWBP_InGameInfoBar_C::TotalPlayers' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, BoundZoneUIData) == 0x0003E0, "Member 'UWBP_InGameInfoBar_C::BoundZoneUIData' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, IsShrinking) == 0x0003E8, "Member 'UWBP_InGameInfoBar_C::IsShrinking' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, OnNumPlayersLeftUpdate) == 0x0003F0, "Member 'UWBP_InGameInfoBar_C::OnNumPlayersLeftUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, StartingTotalPlayers) == 0x000400, "Member 'UWBP_InGameInfoBar_C::StartingTotalPlayers' has a wrong offset!");
static_assert(offsetof(UWBP_InGameInfoBar_C, PlayersRemainingThreshold) == 0x000408, "Member 'UWBP_InGameInfoBar_C::PlayersRemainingThreshold' has a wrong offset!");

}

