#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActionListForScreen_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OdyUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActionListForScreen_Item.WBP_ActionListForScreen_Item_C
// 0x0048 (0x03E0 - 0x0398)
class UWBP_ActionListForScreen_Item_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBinding_C*                    InputBinding;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputAction*                           Input_Action;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   TextAction;                                        // 0x03C0(0x0010)(Edit, BlueprintVisible)
	struct FMargin                                ActionPadding;                                     // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_ActionListForScreen_Item(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActionListForScreen_Item_C">();
	}
	static class UWBP_ActionListForScreen_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActionListForScreen_Item_C>();
	}
};
static_assert(alignof(UWBP_ActionListForScreen_Item_C) == 0x000008, "Wrong alignment on UWBP_ActionListForScreen_Item_C");
static_assert(sizeof(UWBP_ActionListForScreen_Item_C) == 0x0003E0, "Wrong size on UWBP_ActionListForScreen_Item_C");
static_assert(offsetof(UWBP_ActionListForScreen_Item_C, UberGraphFrame) == 0x000398, "Member 'UWBP_ActionListForScreen_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ActionListForScreen_Item_C, HorizontalBox) == 0x0003A0, "Member 'UWBP_ActionListForScreen_Item_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_ActionListForScreen_Item_C, InputBinding) == 0x0003A8, "Member 'UWBP_ActionListForScreen_Item_C::InputBinding' has a wrong offset!");
static_assert(offsetof(UWBP_ActionListForScreen_Item_C, Text) == 0x0003B0, "Member 'UWBP_ActionListForScreen_Item_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_ActionListForScreen_Item_C, Input_Action) == 0x0003B8, "Member 'UWBP_ActionListForScreen_Item_C::Input_Action' has a wrong offset!");
static_assert(offsetof(UWBP_ActionListForScreen_Item_C, TextAction) == 0x0003C0, "Member 'UWBP_ActionListForScreen_Item_C::TextAction' has a wrong offset!");
static_assert(offsetof(UWBP_ActionListForScreen_Item_C, ActionPadding) == 0x0003D0, "Member 'UWBP_ActionListForScreen_Item_C::ActionPadding' has a wrong offset!");

}

