#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventorySlot_Prompt

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_InventorySlot_Prompt.WBP_InventorySlot_Prompt_C.ExecuteUbergraph_WBP_InventorySlot_Prompt
// 0x0018 (0x0018 - 0x0000)
struct WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt) == 0x000008, "Wrong alignment on WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt");
static_assert(sizeof(WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt) == 0x000018, "Wrong size on WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt");
static_assert(offsetof(WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt, EntryPoint) == 0x000000, "Member 'WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_InventorySlot_Prompt_C_ExecuteUbergraph_WBP_InventorySlot_Prompt::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_InventorySlot_Prompt.WBP_InventorySlot_Prompt_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_InventorySlot_Prompt_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_Prompt_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_InventorySlot_Prompt_C_PreConstruct");
static_assert(sizeof(WBP_InventorySlot_Prompt_C_PreConstruct) == 0x000001, "Wrong size on WBP_InventorySlot_Prompt_C_PreConstruct");
static_assert(offsetof(WBP_InventorySlot_Prompt_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_InventorySlot_Prompt_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

