#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugConnectionInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugConnectionInfo.WBP_DebugConnectionInfo_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugConnectionInfo_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugConnectionInfo_C_BindData) == 0x000008, "Wrong alignment on WBP_DebugConnectionInfo_C_BindData");
static_assert(sizeof(WBP_DebugConnectionInfo_C_BindData) == 0x000008, "Wrong size on WBP_DebugConnectionInfo_C_BindData");
static_assert(offsetof(WBP_DebugConnectionInfo_C_BindData, NewUIData) == 0x000000, "Member 'WBP_DebugConnectionInfo_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_DebugConnectionInfo.WBP_DebugConnectionInfo_C.ExecuteUbergraph_WBP_DebugConnectionInfo
// 0x03E0 (0x03E0 - 0x0000)
struct WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float OldValue, float NewValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_4;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_4;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_3;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_3;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Round64_ReturnValue;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Round64_ReturnValue_1;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00F8(0x0010)()
	int64                                         CallFunc_Divide_Int64Int64_ReturnValue;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Divide_Int64Int64_ReturnValue_1;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_ClampInt64_ReturnValue;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_ClampInt64_ReturnValue_1;                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data;  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_OldValue_2;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_2;                     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0158(0x0010)()
	class UMatchaLocalPlayerUIData*               K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0178(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01D0(0x0010)()
	float                                         K2Node_CustomEvent_OldValue_1;                     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_1;                     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Round64_ReturnValue_2;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x01F0(0x0010)()
	int64                                         CallFunc_Divide_Int64Int64_ReturnValue_2;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0208(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_ClampInt64_ReturnValue_2;                 // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0258(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0268(0x0010)()
	TDelegate<void(class FName OldValue, class FName NewValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBuildNumber_ReturnValue;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_OldValue;                       // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NewValue;                       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x02A0(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x02B0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x02C0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0308(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0318(0x0010)()
	int64                                         Temp_int64_Variable;                               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float OldValue, float NewValue)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0330(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0340(0x0014)()
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Temp_int64_Variable_1;                             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float OldValue, float NewValue)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0360(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0370(0x0014)()
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Temp_int64_Variable_2;                             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x0390(0x0014)()
	TDelegate<void(float OldValue, float NewValue)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x03A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Round64_A_ImplicitCast;                   // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round64_A_ImplicitCast_1;                 // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_1;   // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round64_A_ImplicitCast_2;                 // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo) == 0x000008, "Wrong alignment on WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo");
static_assert(sizeof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo) == 0x0003E0, "Wrong size on WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, EntryPoint) == 0x000000, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_OldValue_4) == 0x000014, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_OldValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_NewValue_4) == 0x000018, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_NewValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_OldValue_3) == 0x00001C, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_OldValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_NewValue_3) == 0x000020, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_NewValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Round64_ReturnValue) == 0x000028, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Round64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Round64_ReturnValue_1) == 0x000030, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Round64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeArray_Array_1) == 0x0000D8, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Format_ReturnValue_1) == 0x0000F8, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Divide_Int64Int64_ReturnValue) == 0x000108, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Divide_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Divide_Int64Int64_ReturnValue_1) == 0x000110, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Divide_Int64Int64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_ClampInt64_ReturnValue) == 0x000118, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_ClampInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_ClampInt64_ReturnValue_1) == 0x000120, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_ClampInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_GetUIDataModel_ReturnValue) == 0x000128, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_Event_OldUIData) == 0x000130, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data) == 0x000138, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_OldValue_2) == 0x000144, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_OldValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_NewValue_2) == 0x000148, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_Event_NewUIData) == 0x000150, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000158, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1) == 0x000168, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_DynamicCast_AsMatcha_Local_Player_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeStruct_FormatArgumentData_2) == 0x000178, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeArray_Array_2) == 0x0001C0, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Format_ReturnValue_2) == 0x0001D0, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_OldValue_1) == 0x0001E0, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_NewValue_1) == 0x0001E4, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Round64_ReturnValue_2) == 0x0001E8, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Round64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x0001F0, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Divide_Int64Int64_ReturnValue_2) == 0x000200, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Divide_Int64Int64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeStruct_FormatArgumentData_3) == 0x000208, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_ClampInt64_ReturnValue_2) == 0x000250, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_ClampInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeArray_Array_3) == 0x000258, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Format_ReturnValue_3) == 0x000268, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CreateDelegate_OutputDelegate_1) == 0x000278, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_GetBuildNumber_ReturnValue) == 0x000288, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_GetBuildNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_OldValue) == 0x000290, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CustomEvent_NewValue) == 0x000298, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Conv_NameToText_ReturnValue) == 0x0002A0, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0002B0, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeStruct_FormatArgumentData_4) == 0x0002C0, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_MakeArray_Array_4) == 0x000308, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Format_ReturnValue_4) == 0x000318, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, Temp_int64_Variable) == 0x000328, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::Temp_int64_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CreateDelegate_OutputDelegate_2) == 0x000330, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_Select_Default) == 0x000340, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, Temp_int64_Variable_1) == 0x000358, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::Temp_int64_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CreateDelegate_OutputDelegate_3) == 0x000360, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_Select_Default_1) == 0x000370, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, Temp_int64_Variable_2) == 0x000388, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::Temp_int64_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_Select_Default_2) == 0x000390, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003A4, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Round64_A_ImplicitCast) == 0x0003B8, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Round64_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Round64_A_ImplicitCast_1) == 0x0003C0, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Round64_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0003C8, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Conv_DoubleToText_Value_ImplicitCast_1) == 0x0003D0, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Conv_DoubleToText_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo, CallFunc_Round64_A_ImplicitCast_2) == 0x0003D8, "Member 'WBP_DebugConnectionInfo_C_ExecuteUbergraph_WBP_DebugConnectionInfo::CallFunc_Round64_A_ImplicitCast_2' has a wrong offset!");

// Function WBP_DebugConnectionInfo.WBP_DebugConnectionInfo_C.OnFrameTimeChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugConnectionInfo_C_OnFrameTimeChanged final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugConnectionInfo_C_OnFrameTimeChanged) == 0x000004, "Wrong alignment on WBP_DebugConnectionInfo_C_OnFrameTimeChanged");
static_assert(sizeof(WBP_DebugConnectionInfo_C_OnFrameTimeChanged) == 0x000008, "Wrong size on WBP_DebugConnectionInfo_C_OnFrameTimeChanged");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnFrameTimeChanged, OldValue) == 0x000000, "Member 'WBP_DebugConnectionInfo_C_OnFrameTimeChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnFrameTimeChanged, NewValue) == 0x000004, "Member 'WBP_DebugConnectionInfo_C_OnFrameTimeChanged::NewValue' has a wrong offset!");

// Function WBP_DebugConnectionInfo.WBP_DebugConnectionInfo_C.OnJitterChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugConnectionInfo_C_OnJitterChanged final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugConnectionInfo_C_OnJitterChanged) == 0x000004, "Wrong alignment on WBP_DebugConnectionInfo_C_OnJitterChanged");
static_assert(sizeof(WBP_DebugConnectionInfo_C_OnJitterChanged) == 0x000008, "Wrong size on WBP_DebugConnectionInfo_C_OnJitterChanged");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnJitterChanged, OldValue) == 0x000000, "Member 'WBP_DebugConnectionInfo_C_OnJitterChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnJitterChanged, NewValue) == 0x000004, "Member 'WBP_DebugConnectionInfo_C_OnJitterChanged::NewValue' has a wrong offset!");

// Function WBP_DebugConnectionInfo.WBP_DebugConnectionInfo_C.OnLatencyChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugConnectionInfo_C_OnLatencyChanged final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugConnectionInfo_C_OnLatencyChanged) == 0x000004, "Wrong alignment on WBP_DebugConnectionInfo_C_OnLatencyChanged");
static_assert(sizeof(WBP_DebugConnectionInfo_C_OnLatencyChanged) == 0x000008, "Wrong size on WBP_DebugConnectionInfo_C_OnLatencyChanged");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnLatencyChanged, OldValue) == 0x000000, "Member 'WBP_DebugConnectionInfo_C_OnLatencyChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnLatencyChanged, NewValue) == 0x000004, "Member 'WBP_DebugConnectionInfo_C_OnLatencyChanged::NewValue' has a wrong offset!");

// Function WBP_DebugConnectionInfo.WBP_DebugConnectionInfo_C.OnPacketLossChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugConnectionInfo_C_OnPacketLossChanged final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugConnectionInfo_C_OnPacketLossChanged) == 0x000004, "Wrong alignment on WBP_DebugConnectionInfo_C_OnPacketLossChanged");
static_assert(sizeof(WBP_DebugConnectionInfo_C_OnPacketLossChanged) == 0x000008, "Wrong size on WBP_DebugConnectionInfo_C_OnPacketLossChanged");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnPacketLossChanged, OldValue) == 0x000000, "Member 'WBP_DebugConnectionInfo_C_OnPacketLossChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnPacketLossChanged, NewValue) == 0x000004, "Member 'WBP_DebugConnectionInfo_C_OnPacketLossChanged::NewValue' has a wrong offset!");

// Function WBP_DebugConnectionInfo.WBP_DebugConnectionInfo_C.OnPlayerIdChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_DebugConnectionInfo_C_OnPlayerIdChanged final
{
public:
	class FName                                   OldValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewValue;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugConnectionInfo_C_OnPlayerIdChanged) == 0x000004, "Wrong alignment on WBP_DebugConnectionInfo_C_OnPlayerIdChanged");
static_assert(sizeof(WBP_DebugConnectionInfo_C_OnPlayerIdChanged) == 0x000010, "Wrong size on WBP_DebugConnectionInfo_C_OnPlayerIdChanged");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnPlayerIdChanged, OldValue) == 0x000000, "Member 'WBP_DebugConnectionInfo_C_OnPlayerIdChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugConnectionInfo_C_OnPlayerIdChanged, NewValue) == 0x000008, "Member 'WBP_DebugConnectionInfo_C_OnPlayerIdChanged::NewValue' has a wrong offset!");

// Function WBP_DebugConnectionInfo.WBP_DebugConnectionInfo_C.UnbindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugConnectionInfo_C_UnbindData final
{
public:
	class UOdyUIData*                             OldUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugConnectionInfo_C_UnbindData) == 0x000008, "Wrong alignment on WBP_DebugConnectionInfo_C_UnbindData");
static_assert(sizeof(WBP_DebugConnectionInfo_C_UnbindData) == 0x000008, "Wrong size on WBP_DebugConnectionInfo_C_UnbindData");
static_assert(offsetof(WBP_DebugConnectionInfo_C_UnbindData, OldUIData) == 0x000000, "Member 'WBP_DebugConnectionInfo_C_UnbindData::OldUIData' has a wrong offset!");

}

