#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HealthBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HealthBar.WBP_HealthBar_C.ExecuteUbergraph_WBP_HealthBar
// 0x0004 (0x0004 - 0x0000)
struct WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar) == 0x000004, "Wrong alignment on WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar");
static_assert(sizeof(WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar) == 0x000004, "Wrong size on WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar");
static_assert(offsetof(WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar, EntryPoint) == 0x000000, "Member 'WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar::EntryPoint' has a wrong offset!");

// Function WBP_HealthBar.WBP_HealthBar_C.SetHealth
// 0x0040 (0x0040 - 0x0000)
struct WBP_HealthBar_C_SetHealth final
{
public:
	double                                        CurrentDamage;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDamage;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FCeil64_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_ClampInt64_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0030(0x0010)()
};
static_assert(alignof(WBP_HealthBar_C_SetHealth) == 0x000008, "Wrong alignment on WBP_HealthBar_C_SetHealth");
static_assert(sizeof(WBP_HealthBar_C_SetHealth) == 0x000040, "Wrong size on WBP_HealthBar_C_SetHealth");
static_assert(offsetof(WBP_HealthBar_C_SetHealth, CurrentDamage) == 0x000000, "Member 'WBP_HealthBar_C_SetHealth::CurrentDamage' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealth, MaxDamage) == 0x000008, "Member 'WBP_HealthBar_C_SetHealth::MaxDamage' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealth, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_HealthBar_C_SetHealth::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealth, CallFunc_Conv_DoubleToInt64_ReturnValue) == 0x000018, "Member 'WBP_HealthBar_C_SetHealth::CallFunc_Conv_DoubleToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealth, CallFunc_FCeil64_ReturnValue) == 0x000020, "Member 'WBP_HealthBar_C_SetHealth::CallFunc_FCeil64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealth, CallFunc_ClampInt64_ReturnValue) == 0x000028, "Member 'WBP_HealthBar_C_SetHealth::CallFunc_ClampInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealth, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000030, "Member 'WBP_HealthBar_C_SetHealth::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");

// Function WBP_HealthBar.WBP_HealthBar_C.SetHealthBarPercent
// 0x0028 (0x0028 - 0x0000)
struct WBP_HealthBar_C_SetHealthBarPercent final
{
public:
	double                                        CurrentDamage;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDamage;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealthBar_C_SetHealthBarPercent) == 0x000008, "Wrong alignment on WBP_HealthBar_C_SetHealthBarPercent");
static_assert(sizeof(WBP_HealthBar_C_SetHealthBarPercent) == 0x000028, "Wrong size on WBP_HealthBar_C_SetHealthBarPercent");
static_assert(offsetof(WBP_HealthBar_C_SetHealthBarPercent, CurrentDamage) == 0x000000, "Member 'WBP_HealthBar_C_SetHealthBarPercent::CurrentDamage' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealthBarPercent, MaxDamage) == 0x000008, "Member 'WBP_HealthBar_C_SetHealthBarPercent::MaxDamage' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealthBarPercent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_HealthBar_C_SetHealthBarPercent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealthBarPercent, CallFunc_SafeDivide_ReturnValue) == 0x000018, "Member 'WBP_HealthBar_C_SetHealthBarPercent::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetHealthBarPercent, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000020, "Member 'WBP_HealthBar_C_SetHealthBarPercent::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

}

