#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterSelectTile

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectTile_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_BindData) == 0x000008, "Wrong alignment on WBP_CharacterSelectTile_C_BindData");
static_assert(sizeof(WBP_CharacterSelectTile_C_BindData) == 0x000008, "Wrong size on WBP_CharacterSelectTile_C_BindData");
static_assert(offsetof(WBP_CharacterSelectTile_C_BindData, NewUIData) == 0x000000, "Member 'WBP_CharacterSelectTile_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterSelectTile_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_CharacterSelectTile_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_CharacterSelectTile_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_CharacterSelectTile_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_CharacterSelectTile_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_CharacterSelectTile_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterSelectTile_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_CharacterSelectTile_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_CharacterSelectTile_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_CharacterSelectTile_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_CharacterSelectTile_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_CharacterSelectTile_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.CustomEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_CharacterSelectTile_C_CustomEvent final
{
public:
	bool                                          OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_CustomEvent) == 0x000001, "Wrong alignment on WBP_CharacterSelectTile_C_CustomEvent");
static_assert(sizeof(WBP_CharacterSelectTile_C_CustomEvent) == 0x000002, "Wrong size on WBP_CharacterSelectTile_C_CustomEvent");
static_assert(offsetof(WBP_CharacterSelectTile_C_CustomEvent, OldValue) == 0x000000, "Member 'WBP_CharacterSelectTile_C_CustomEvent::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_CustomEvent, NewValue) == 0x000001, "Member 'WBP_CharacterSelectTile_C_CustomEvent::NewValue' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.ExecuteUbergraph_WBP_CharacterSelectTile
// 0x0108 (0x0108 - 0x0000)
struct WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_NewUIData_1;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventRenderer_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterSelectEntryUIData_C*       K2Node_DynamicCast_AsBP_Character_Select_Entry_UI_Data; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OldValue_4;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue_4;                     // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OldValue_3;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue_3;                     // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_CustomEvent_OldValue_2;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_CustomEvent_NewValue_2;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OldValue_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue_1;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OldValue;                       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue;                       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterSelectEntryUIData_C*       K2Node_DynamicCast_AsBP_Character_Select_Entry_UI_Data_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIAssetData*                        CallFunc_GetUIAssetData_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_AssetUIData_MatchaCharacter_C*      K2Node_DynamicCast_AsBP_Asset_UI_Data_Matcha_Character; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_DynamicCast_AsOdy_UI_Data;                  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool OldValue, bool NewValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool OldValue, bool NewValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMaterialInterface* OldValue, class UMaterialInterface* NewValue)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool OldValue, bool NewValue)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool OldValue, bool NewValue)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile) == 0x000008, "Wrong alignment on WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile");
static_assert(sizeof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile) == 0x000108, "Wrong size on WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, EntryPoint) == 0x000000, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, CallFunc_GetOwningPlayerCameraManager_ReturnValue) == 0x000008, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::CallFunc_GetOwningPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_Event_NewUIData_1) == 0x000010, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_Event_NewUIData_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, CallFunc_AkEventRenderer_ReturnValue) == 0x000018, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::CallFunc_AkEventRenderer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_DynamicCast_AsBP_Character_Select_Entry_UI_Data) == 0x000020, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_DynamicCast_AsBP_Character_Select_Entry_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_OldValue_4) == 0x00002A, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_OldValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_NewValue_4) == 0x00002B, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_NewValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_OldValue_3) == 0x00002C, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_OldValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_NewValue_3) == 0x00002D, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_NewValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_OldValue_2) == 0x000030, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_OldValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_NewValue_2) == 0x000038, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_OldValue_1) == 0x000040, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_NewValue_1) == 0x000041, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_OldValue) == 0x000042, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CustomEvent_NewValue) == 0x000043, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_Event_NewUIData) == 0x000048, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_DynamicCast_AsBP_Character_Select_Entry_UI_Data_1) == 0x000050, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_DynamicCast_AsBP_Character_Select_Entry_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_Event_IsDesignTime) == 0x000059, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000060, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000068, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity) == 0x000070, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_ClassDynamicCast_AsMatcha_Snap_Net_Character_Entity' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_ClassDynamicCast_bSuccess) == 0x000078, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, CallFunc_GetUIAssetData_ReturnValue) == 0x000080, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::CallFunc_GetUIAssetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_DynamicCast_AsBP_Asset_UI_Data_Matcha_Character) == 0x000088, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_DynamicCast_AsBP_Asset_UI_Data_Matcha_Character' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_Event_ListItemObject) == 0x000098, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_Event_bIsSelected) == 0x0000A0, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_DynamicCast_AsOdy_UI_Data) == 0x0000A8, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_DynamicCast_AsOdy_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_Event_bIsExpanded) == 0x0000B1, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D4, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E4, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F4, "Member 'WBP_CharacterSelectTile_C_ExecuteUbergraph_WBP_CharacterSelectTile::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.OnCharacterClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectTile_C_OnCharacterClicked__DelegateSignature final
{
public:
	class UBP_CharacterSelectEntryUIData_C*       CharacterSelectUIData_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_OnCharacterClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectTile_C_OnCharacterClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectTile_C_OnCharacterClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectTile_C_OnCharacterClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnCharacterClicked__DelegateSignature, CharacterSelectUIData_0) == 0x000000, "Member 'WBP_CharacterSelectTile_C_OnCharacterClicked__DelegateSignature::CharacterSelectUIData_0' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.OnCharacterHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectTile_C_OnCharacterHovered__DelegateSignature final
{
public:
	class UBP_CharacterSelectEntryUIData_C*       CharacterSelectUIData_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_OnCharacterHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectTile_C_OnCharacterHovered__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectTile_C_OnCharacterHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectTile_C_OnCharacterHovered__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnCharacterHovered__DelegateSignature, CharacterSelectUIData_0) == 0x000000, "Member 'WBP_CharacterSelectTile_C_OnCharacterHovered__DelegateSignature::CharacterSelectUIData_0' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.OnCharacterPortraitChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_CharacterSelectTile_C_OnCharacterPortraitChanged final
{
public:
	class UMaterialInterface*                     OldValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NewValue;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_OnCharacterPortraitChanged) == 0x000008, "Wrong alignment on WBP_CharacterSelectTile_C_OnCharacterPortraitChanged");
static_assert(sizeof(WBP_CharacterSelectTile_C_OnCharacterPortraitChanged) == 0x000010, "Wrong size on WBP_CharacterSelectTile_C_OnCharacterPortraitChanged");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnCharacterPortraitChanged, OldValue) == 0x000000, "Member 'WBP_CharacterSelectTile_C_OnCharacterPortraitChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnCharacterPortraitChanged, NewValue) == 0x000008, "Member 'WBP_CharacterSelectTile_C_OnCharacterPortraitChanged::NewValue' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.OnIsLocallySelectedChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_CharacterSelectTile_C_OnIsLocallySelectedChanged final
{
public:
	bool                                          OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_OnIsLocallySelectedChanged) == 0x000001, "Wrong alignment on WBP_CharacterSelectTile_C_OnIsLocallySelectedChanged");
static_assert(sizeof(WBP_CharacterSelectTile_C_OnIsLocallySelectedChanged) == 0x000002, "Wrong size on WBP_CharacterSelectTile_C_OnIsLocallySelectedChanged");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnIsLocallySelectedChanged, OldValue) == 0x000000, "Member 'WBP_CharacterSelectTile_C_OnIsLocallySelectedChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnIsLocallySelectedChanged, NewValue) == 0x000001, "Member 'WBP_CharacterSelectTile_C_OnIsLocallySelectedChanged::NewValue' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.OnIsTeammateHoveredChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_CharacterSelectTile_C_OnIsTeammateHoveredChanged final
{
public:
	bool                                          OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_OnIsTeammateHoveredChanged) == 0x000001, "Wrong alignment on WBP_CharacterSelectTile_C_OnIsTeammateHoveredChanged");
static_assert(sizeof(WBP_CharacterSelectTile_C_OnIsTeammateHoveredChanged) == 0x000002, "Wrong size on WBP_CharacterSelectTile_C_OnIsTeammateHoveredChanged");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnIsTeammateHoveredChanged, OldValue) == 0x000000, "Member 'WBP_CharacterSelectTile_C_OnIsTeammateHoveredChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnIsTeammateHoveredChanged, NewValue) == 0x000001, "Member 'WBP_CharacterSelectTile_C_OnIsTeammateHoveredChanged::NewValue' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.OnIsUnavailableChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_CharacterSelectTile_C_OnIsUnavailableChanged final
{
public:
	bool                                          OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_OnIsUnavailableChanged) == 0x000001, "Wrong alignment on WBP_CharacterSelectTile_C_OnIsUnavailableChanged");
static_assert(sizeof(WBP_CharacterSelectTile_C_OnIsUnavailableChanged) == 0x000002, "Wrong size on WBP_CharacterSelectTile_C_OnIsUnavailableChanged");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnIsUnavailableChanged, OldValue) == 0x000000, "Member 'WBP_CharacterSelectTile_C_OnIsUnavailableChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnIsUnavailableChanged, NewValue) == 0x000001, "Member 'WBP_CharacterSelectTile_C_OnIsUnavailableChanged::NewValue' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectTile_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_CharacterSelectTile_C_OnListItemObjectSet");
static_assert(sizeof(WBP_CharacterSelectTile_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_CharacterSelectTile_C_OnListItemObjectSet");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_CharacterSelectTile_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.OnUIDataSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectTile_C_OnUIDataSet final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_OnUIDataSet) == 0x000008, "Wrong alignment on WBP_CharacterSelectTile_C_OnUIDataSet");
static_assert(sizeof(WBP_CharacterSelectTile_C_OnUIDataSet) == 0x000008, "Wrong size on WBP_CharacterSelectTile_C_OnUIDataSet");
static_assert(offsetof(WBP_CharacterSelectTile_C_OnUIDataSet, NewUIData) == 0x000000, "Member 'WBP_CharacterSelectTile_C_OnUIDataSet::NewUIData' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterSelectTile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CharacterSelectTile_C_PreConstruct");
static_assert(sizeof(WBP_CharacterSelectTile_C_PreConstruct) == 0x000001, "Wrong size on WBP_CharacterSelectTile_C_PreConstruct");
static_assert(offsetof(WBP_CharacterSelectTile_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CharacterSelectTile_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CharacterSelectTile.WBP_CharacterSelectTile_C.UpdateButtonVisualState
// 0x0080 (0x0080 - 0x0000)
struct WBP_CharacterSelectTile_C_UpdateButtonVisualState final
{
public:
	class UMaterialInstanceDynamic*               Local_MID;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue_1;       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue_2;       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue_3;       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue_4;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue_5;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_2;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_3;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_4;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectTile_C_UpdateButtonVisualState) == 0x000008, "Wrong alignment on WBP_CharacterSelectTile_C_UpdateButtonVisualState");
static_assert(sizeof(WBP_CharacterSelectTile_C_UpdateButtonVisualState) == 0x000080, "Wrong size on WBP_CharacterSelectTile_C_UpdateButtonVisualState");
static_assert(offsetof(WBP_CharacterSelectTile_C_UpdateButtonVisualState, Local_MID) == 0x000000, "Member 'WBP_CharacterSelectTile_C_UpdateButtonVisualState::Local_MID' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectTile_C_UpdateButtonVisualState, Temp_byte_Variable) == 0x000008, "Member 'WBP_CharacterSelectTile_C_UpdateButtonVisualState::Temp_byte_Variable' has a wrong offset!");
