#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HealthBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HealthBar.WBP_HealthBar_C
// 0x0030 (0x03C8 - 0x0398)
class UWBP_HealthBar_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           HealthBar;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOdyTextBlock*                          HealthNumber;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   ColorsByTeam;                                      // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShowHealthNumber;                                 // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HealthBar(int32 EntryPoint);
	void SetHealth(double CurrentDamage, double MaxDamage);

	void SetHealthBarPercent(double CurrentDamage, double MaxDamage) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HealthBar_C">();
	}
	static class UWBP_HealthBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HealthBar_C>();
	}
};
static_assert(alignof(UWBP_HealthBar_C) == 0x000008, "Wrong alignment on UWBP_HealthBar_C");
static_assert(sizeof(UWBP_HealthBar_C) == 0x0003C8, "Wrong size on UWBP_HealthBar_C");
static_assert(offsetof(UWBP_HealthBar_C, UberGraphFrame) == 0x000398, "Member 'UWBP_HealthBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HealthBar_C, HealthBar) == 0x0003A0, "Member 'UWBP_HealthBar_C::HealthBar' has a wrong offset!");
static_assert(offsetof(UWBP_HealthBar_C, HealthNumber) == 0x0003A8, "Member 'UWBP_HealthBar_C::HealthNumber' has a wrong offset!");
static_assert(offsetof(UWBP_HealthBar_C, ColorsByTeam) == 0x0003B0, "Member 'UWBP_HealthBar_C::ColorsByTeam' has a wrong offset!");
static_assert(offsetof(UWBP_HealthBar_C, bShowHealthNumber) == 0x0003C0, "Member 'UWBP_HealthBar_C::bShowHealthNumber' has a wrong offset!");

}

