#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Motion_SuddenDeath

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Motion_SuddenDeath.WBP_Motion_SuddenDeath_C
// 0x0030 (0x03C8 - 0x0398)
class UWBP_Motion_SuddenDeath_C final : public UOdyWidget
{
public:
	class UWidgetAnimation*                       SuddenDeathStart;                                  // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGDark;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SuddenDeath_Overlay;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InGameInfoBar_C*                   InfoBarRef;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HideGameplayNotificationHandle;                    // 0x03C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void PlaySuddenDeathAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Motion_SuddenDeath_C">();
	}
	static class UWBP_Motion_SuddenDeath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Motion_SuddenDeath_C>();
	}
};
static_assert(alignof(UWBP_Motion_SuddenDeath_C) == 0x000008, "Wrong alignment on UWBP_Motion_SuddenDeath_C");
static_assert(sizeof(UWBP_Motion_SuddenDeath_C) == 0x0003C8, "Wrong size on UWBP_Motion_SuddenDeath_C");
static_assert(offsetof(UWBP_Motion_SuddenDeath_C, SuddenDeathStart) == 0x000398, "Member 'UWBP_Motion_SuddenDeath_C::SuddenDeathStart' has a wrong offset!");
static_assert(offsetof(UWBP_Motion_SuddenDeath_C, BG) == 0x0003A0, "Member 'UWBP_Motion_SuddenDeath_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Motion_SuddenDeath_C, BGDark) == 0x0003A8, "Member 'UWBP_Motion_SuddenDeath_C::BGDark' has a wrong offset!");
static_assert(offsetof(UWBP_Motion_SuddenDeath_C, SuddenDeath_Overlay) == 0x0003B0, "Member 'UWBP_Motion_SuddenDeath_C::SuddenDeath_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_Motion_SuddenDeath_C, InfoBarRef) == 0x0003B8, "Member 'UWBP_Motion_SuddenDeath_C::InfoBarRef' has a wrong offset!");
static_assert(offsetof(UWBP_Motion_SuddenDeath_C, HideGameplayNotificationHandle) == 0x0003C0, "Member 'UWBP_Motion_SuddenDeath_C::HideGameplayNotificationHandle' has a wrong offset!");

}

