#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_structs.hpp"
#include "OdyUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Inventory.WBP_Inventory_C
// 0x00F8 (0x0490 - 0x0398)
class UWBP_Inventory_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RadialSelectGrow;                                  // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_Prompt_C*            CancelPrompt;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_Prompt_C*            DropPrompt;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_QuickThrowPrompt_TEMP_C* GamePad_QuickThrowPrompt_TEMP;                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GamepadDpad;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   HeldItemSlot;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBinding_C*                    KeyboardBinding1;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBinding_C*                    KeyboardBinding2;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBinding_C*                    KeyboardBinding3;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBinding_C*                    KeyboardBinding4;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_GamepadInventory;                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_KeyboardInventory;                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Prompts;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   QuickbarSlot1;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   QuickbarSlot1_Keyboard;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   QuickbarSlot2;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   QuickbarSlot2_Keyboard;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   QuickbarSlot3;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   QuickbarSlot3_Keyboard;                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   QuickbarSlot4;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   QuickbarSlot4_Keyboard;                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RadialBG;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   SoulItemSlot;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SparksRowContainer;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventorySlot_Prompt_C*            UsePrompt;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchaInventoryCategoryUIData*         BoundQuickBarCategoryUIData;                       // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryCategoryUIData*         BoundHeldCategoryUIData;                           // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMatchaInventoryCategoryUIData*         BoundSoulCategoryUIData;                           // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LastRadialActivated;                               // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLastKnownInputWasGamepad;                         // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateGamePadRadial(bool Activate);
	void Bind_Category_Data(class UMatchaInventoryCategoryUIData* CategoryUIData);
	void BindData(class UOdyUIData* NewUIData);
	void BindOnChangeHeldItem();
	void ChangeHeldItem();
	void ExecuteUbergraph_WBP_Inventory(int32 EntryPoint);
	void GetQuickBarItems_Controller(TArray<class UWBP_InventorySlot_C*>* Array);
	void HeldItemVisChange(ESlateVisibility InVisibility);
	void OnCategoriesUpdated();
	void OnHeldCategoryUpdated(class UMatchaInventoryCategoryUIData* CategoryUIData);
	void OnHeldItemSlotsUpdated();
	void OnInitialized();
	void OnInputMethodChanged_Event(EInputMethod InputMethod);
	void OnSlotsUpdated();
	void OnSoulCategoryUpdated(class UMatchaInventoryCategoryUIData* CategoryUIData);
	void OnSoulItemSlotsUpdated();
	void ResetUI();
	void UnbindCategoryData(class UMatchaInventoryCategoryUIData* OldCategoryUIData);
	void UnbindData(class UOdyUIData* OldUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Inventory_C">();
	}
	static class UWBP_Inventory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Inventory_C>();
	}
};
static_assert(alignof(UWBP_Inventory_C) == 0x000008, "Wrong alignment on UWBP_Inventory_C");
static_assert(sizeof(UWBP_Inventory_C) == 0x000490, "Wrong size on UWBP_Inventory_C");
static_assert(offsetof(UWBP_Inventory_C, UberGraphFrame) == 0x000398, "Member 'UWBP_Inventory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, RadialSelectGrow) == 0x0003A0, "Member 'UWBP_Inventory_C::RadialSelectGrow' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, CancelPrompt) == 0x0003A8, "Member 'UWBP_Inventory_C::CancelPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, DropPrompt) == 0x0003B0, "Member 'UWBP_Inventory_C::DropPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, GamePad_QuickThrowPrompt_TEMP) == 0x0003B8, "Member 'UWBP_Inventory_C::GamePad_QuickThrowPrompt_TEMP' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, GamepadDpad) == 0x0003C0, "Member 'UWBP_Inventory_C::GamepadDpad' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, HeldItemSlot) == 0x0003C8, "Member 'UWBP_Inventory_C::HeldItemSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, ItemName) == 0x0003D0, "Member 'UWBP_Inventory_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, KeyboardBinding1) == 0x0003D8, "Member 'UWBP_Inventory_C::KeyboardBinding1' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, KeyboardBinding2) == 0x0003E0, "Member 'UWBP_Inventory_C::KeyboardBinding2' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, KeyboardBinding3) == 0x0003E8, "Member 'UWBP_Inventory_C::KeyboardBinding3' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, KeyboardBinding4) == 0x0003F0, "Member 'UWBP_Inventory_C::KeyboardBinding4' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, Overlay_GamepadInventory) == 0x0003F8, "Member 'UWBP_Inventory_C::Overlay_GamepadInventory' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, Overlay_KeyboardInventory) == 0x000400, "Member 'UWBP_Inventory_C::Overlay_KeyboardInventory' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, Overlay_Prompts) == 0x000408, "Member 'UWBP_Inventory_C::Overlay_Prompts' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, QuickbarSlot1) == 0x000410, "Member 'UWBP_Inventory_C::QuickbarSlot1' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, QuickbarSlot1_Keyboard) == 0x000418, "Member 'UWBP_Inventory_C::QuickbarSlot1_Keyboard' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, QuickbarSlot2) == 0x000420, "Member 'UWBP_Inventory_C::QuickbarSlot2' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, QuickbarSlot2_Keyboard) == 0x000428, "Member 'UWBP_Inventory_C::QuickbarSlot2_Keyboard' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, QuickbarSlot3) == 0x000430, "Member 'UWBP_Inventory_C::QuickbarSlot3' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, QuickbarSlot3_Keyboard) == 0x000438, "Member 'UWBP_Inventory_C::QuickbarSlot3_Keyboard' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, QuickbarSlot4) == 0x000440, "Member 'UWBP_Inventory_C::QuickbarSlot4' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, QuickbarSlot4_Keyboard) == 0x000448, "Member 'UWBP_Inventory_C::QuickbarSlot4_Keyboard' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, RadialBG) == 0x000450, "Member 'UWBP_Inventory_C::RadialBG' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, SoulItemSlot) == 0x000458, "Member 'UWBP_Inventory_C::SoulItemSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, SparksRowContainer) == 0x000460, "Member 'UWBP_Inventory_C::SparksRowContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, UsePrompt) == 0x000468, "Member 'UWBP_Inventory_C::UsePrompt' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, BoundQuickBarCategoryUIData) == 0x000470, "Member 'UWBP_Inventory_C::BoundQuickBarCategoryUIData' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, BoundHeldCategoryUIData) == 0x000478, "Member 'UWBP_Inventory_C::BoundHeldCategoryUIData' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, BoundSoulCategoryUIData) == 0x000480, "Member 'UWBP_Inventory_C::BoundSoulCategoryUIData' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, LastRadialActivated) == 0x000488, "Member 'UWBP_Inventory_C::LastRadialActivated' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_C, bLastKnownInputWasGamepad) == 0x000489, "Member 'UWBP_Inventory_C::bLastKnownInputWasGamepad' has a wrong offset!");

}

