#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InGameUI

#include "Basic.hpp"

#include "Matcha_structs.hpp"
#include "OdyUI_structs.hpp"
#include "EHUDMapState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_InGameUI.WBP_InGameUI_C.BindData
// 0x0008 (0x0008 - 0x0000)
struct WBP_InGameUI_C_BindData final
{
public:
	class UOdyUIData*                             NewUIData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameUI_C_BindData) == 0x000008, "Wrong alignment on WBP_InGameUI_C_BindData");
static_assert(sizeof(WBP_InGameUI_C_BindData) == 0x000008, "Wrong size on WBP_InGameUI_C_BindData");
static_assert(offsetof(WBP_InGameUI_C_BindData, NewUIData) == 0x000000, "Member 'WBP_InGameUI_C_BindData::NewUIData' has a wrong offset!");

// Function WBP_InGameUI.WBP_InGameUI_C.ChangeHUDMap
// 0x0058 (0x0058 - 0x0000)
struct WBP_InGameUI_C_ChangeHUDMap final
{
public:
	struct FVector2D                              Temp_struct_Variable;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameUI_C_ChangeHUDMap) == 0x000008, "Wrong alignment on WBP_InGameUI_C_ChangeHUDMap");
static_assert(sizeof(WBP_InGameUI_C_ChangeHUDMap) == 0x000058, "Wrong size on WBP_InGameUI_C_ChangeHUDMap");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, Temp_struct_Variable) == 0x000000, "Member 'WBP_InGameUI_C_ChangeHUDMap::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, Temp_struct_Variable_1) == 0x000010, "Member 'WBP_InGameUI_C_ChangeHUDMap::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, Temp_bool_Variable) == 0x000020, "Member 'WBP_InGameUI_C_ChangeHUDMap::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_InGameUI_C_ChangeHUDMap::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, K2Node_Select_Default) == 0x000028, "Member 'WBP_InGameUI_C_ChangeHUDMap::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, CallFunc_BreakVector2D_X) == 0x000038, "Member 'WBP_InGameUI_C_ChangeHUDMap::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, CallFunc_BreakVector2D_Y) == 0x000040, "Member 'WBP_InGameUI_C_ChangeHUDMap::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WBP_InGameUI_C_ChangeHUDMap::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x00004C, "Member 'WBP_InGameUI_C_ChangeHUDMap::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ChangeHUDMap, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000050, "Member 'WBP_InGameUI_C_ChangeHUDMap::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_InGameUI.WBP_InGameUI_C.ExecuteUbergraph_WBP_InGameUI
// 0x0510 (0x0510 - 0x0000)
struct WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0040(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_1;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x00B8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4_0;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0130(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue;               // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_NewUIData_1;                          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data;    // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             K2Node_Event_OldUIData;                            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOdyUIData*                             K2Node_Event_NewUIData;                            // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_1;  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaGameWorldUIData*                 K2Node_CustomEvent_GameWorldUIData;                // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IntBinding_GetValue_ReturnValue;          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue;                    // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_2;  // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB[0x1];                                      // 0x01DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NumLeft;                        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryWarnPlayersNumRemaining_DidWarning;    // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x01F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(EInputMethod InputMethod)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0238(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0260(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_2; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchaSnapNetPlayerController*         K2Node_DynamicCast_AsMatcha_Snap_Net_Player_Controller; // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_State;                          // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OldValue;                       // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue;                       // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297[0x1];                                      // 0x0297(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue_1;                  // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_3;  // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController_MatchaSnapNet_C*      K2Node_DynamicCast_AsPlayer_Controller_Matcha_Snap_Net; // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue;         // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOdyUIData*                             CallFunc_GetUIData_ReturnValue_2;                  // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchaGameWorldUIData*                 K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_4;  // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController_MatchaSnapNet_C*      K2Node_DynamicCast_AsPlayer_Controller_Matcha_Snap_Net_1; // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BoolBinding_GetValue_ReturnValue_1;       // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x02F8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0320(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NumLeft)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_1;                            // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_1;                            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_3; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0350(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0378(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_2;                            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_2;                            // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_4; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchaUISubsystem*                     CallFunc_GetUISubsystem_ReturnValue;               // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputMethod                                  K2Node_CustomEvent_InputMethod;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputMethod                                  CallFunc_GetInputMethod_ReturnValue;               // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUISubsystem*                     CallFunc_GetUISubsystem_ReturnValue_1;             // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputMethod                                  CallFunc_GetInputMethod_ReturnValue_1;             // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x2];                                      // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_TooltipUI_C>        K2Node_DynamicCast_AsI_Tooltip_UI;                 // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_TooltipUI_C>        K2Node_DynamicCast_AsI_Tooltip_UI_1;               // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchaUIDataModelBase*                 CallFunc_GetUIDataModel_ReturnValue_1;             // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_6;     // 0x0440(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_6;     // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_6;   // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_6;    // 0x0468(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_9_0;                            // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8_0;                            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_10;                             // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_4;                            // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_7;     // 0x04A8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_7;     // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_7;   // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_7;    // 0x04D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool OldValue, bool NewValue)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x04D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11_0;                           // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10_0;                           // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool State)>                   K2Node_CreateDelegate_OutputDelegate_4;            // 0x04FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x050D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI) == 0x000008, "Wrong alignment on WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI");
static_assert(sizeof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI) == 0x000510, "Wrong size on WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, EntryPoint) == 0x000000, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_byte_Variable) == 0x000004, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000008, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000028, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00002C, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000030, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x000038, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000040, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000060, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000064, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000068, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_object_Variable) == 0x000070, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1) == 0x000078, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable) == 0x000080, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_1) == 0x000088, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_0) == 0x000090, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_1_0) == 0x000098, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_1_1) == 0x0000A0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_1_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_1) == 0x0000A8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_2) == 0x0000B0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_ActionValue) == 0x0000B8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0000D8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0000DC, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000E0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0000E8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_object_Variable_1) == 0x0000F0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_3) == 0x0000F8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_3_0) == 0x000100, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_4) == 0x000108, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_bool_Variable) == 0x000110, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_4_0) == 0x000118, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_bool_Variable_1) == 0x000120, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_int_Loop_Counter_Variable) == 0x000124, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_Add_IntInt_ReturnValue) == 0x000128, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_int_Array_Index_Variable) == 0x00012C, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_Event_MyGeometry) == 0x000130, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_Event_InDeltaTime) == 0x000168, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GetUIDataModel_ReturnValue) == 0x000170, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GetUIDataModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_Event_NewUIData_1) == 0x000178, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_Event_NewUIData_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data) == 0x000180, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_Event_OldUIData) == 0x000190, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_Event_OldUIData' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_Event_NewUIData) == 0x000198, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_Event_NewUIData' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_1) == 0x0001A0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_CustomEvent_GameWorldUIData) == 0x0001B0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_CustomEvent_GameWorldUIData' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_IntBinding_GetValue_ReturnValue) == 0x0001B8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_IntBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GetUIData_ReturnValue) == 0x0001C0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_Conv_IntToByte_ReturnValue) == 0x0001C8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_2) == 0x0001D0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GetValidValue_ReturnValue) == 0x0001D9, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_IsValid_ReturnValue) == 0x0001DA, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_CustomEvent_NumLeft) == 0x0001DC, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_CustomEvent_NumLeft' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001E0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_TryWarnPlayersNumRemaining_DidWarning) == 0x0001E4, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_TryWarnPlayersNumRemaining_DidWarning' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_SwitchEnum_CmpSuccess) == 0x0001E5, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_int_Array_Index_Variable_1) == 0x0001E8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GetAllWidgetsWithInterface_FoundWidgets) == 0x0001F0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GetAllWidgetsWithInterface_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_CreateDelegate_OutputDelegate) == 0x000200, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000210, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_5) == 0x000218, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_6) == 0x000220, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_7) == 0x000228, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_object_Variable_2) == 0x000230, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_ActionValue_3) == 0x000238, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_ActionValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_ElapsedTime_3) == 0x000258, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_ElapsedTime_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_TriggeredTime_3) == 0x00025C, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_TriggeredTime_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_EnhancedInputActionEvent_SourceAction_3) == 0x000260, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_EnhancedInputActionEvent_SourceAction_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_7_0) == 0x000268, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_7_0' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, Temp_real_Variable_6_0) == 0x000270, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::Temp_real_Variable_6_0' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_2) == 0x000278, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GetPlayerController_ReturnValue) == 0x000280, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_AsMatcha_Snap_Net_Player_Controller) == 0x000288, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_AsMatcha_Snap_Net_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_bSuccess_3) == 0x000290, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_CustomEvent_State) == 0x000291, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_CustomEvent_Visible) == 0x000292, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000293, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000294, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_CustomEvent_OldValue) == 0x000295, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_CustomEvent_NewValue) == 0x000296, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GetUIData_ReturnValue_1) == 0x000298, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GetUIData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GetPlayerController_ReturnValue_1) == 0x0002A0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_3) == 0x0002A8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_bSuccess_4) == 0x0002B0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_AsPlayer_Controller_Matcha_Snap_Net) == 0x0002B8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_AsPlayer_Controller_Matcha_Snap_Net' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_bSuccess_5) == 0x0002C0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_BoolBinding_GetValue_ReturnValue) == 0x0002C1, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_BoolBinding_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GetUIData_ReturnValue_2) == 0x0002C8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GetUIData_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_4) == 0x0002D0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_AsMatcha_Game_World_UI_Data_4' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, K2Node_DynamicCast_bSuccess_6) == 0x0002D8, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI, CallFunc_GetPlayerController_ReturnValue_2) == 0x0002E0, "Member 'WBP_InGameUI_C_ExecuteUbergraph_WBP_InGameUI::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
