#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KillFeedEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KillFeedEntry.WBP_KillFeedEntry_C
// 0x0038 (0x03D0 - 0x0398)
class UWBP_KillFeedEntry_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SlideIn;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 InstigatorIcon;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOdyTextBlock*                          InstigatorName;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KOIcon;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TargetIcon;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOdyTextBlock*                          TargetName;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_KillFeedEntry(int32 EntryPoint);
	void UnbindData(class UOdyUIData* OldUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KillFeedEntry_C">();
	}
	static class UWBP_KillFeedEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KillFeedEntry_C>();
	}
};
static_assert(alignof(UWBP_KillFeedEntry_C) == 0x000008, "Wrong alignment on UWBP_KillFeedEntry_C");
static_assert(sizeof(UWBP_KillFeedEntry_C) == 0x0003D0, "Wrong size on UWBP_KillFeedEntry_C");
static_assert(offsetof(UWBP_KillFeedEntry_C, UberGraphFrame) == 0x000398, "Member 'UWBP_KillFeedEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeedEntry_C, SlideIn) == 0x0003A0, "Member 'UWBP_KillFeedEntry_C::SlideIn' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeedEntry_C, InstigatorIcon) == 0x0003A8, "Member 'UWBP_KillFeedEntry_C::InstigatorIcon' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeedEntry_C, InstigatorName) == 0x0003B0, "Member 'UWBP_KillFeedEntry_C::InstigatorName' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeedEntry_C, KOIcon) == 0x0003B8, "Member 'UWBP_KillFeedEntry_C::KOIcon' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeedEntry_C, TargetIcon) == 0x0003C0, "Member 'UWBP_KillFeedEntry_C::TargetIcon' has a wrong offset!");
static_assert(offsetof(UWBP_KillFeedEntry_C, TargetName) == 0x0003C8, "Member 'UWBP_KillFeedEntry_C::TargetName' has a wrong offset!");

}

