#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerChannelBarAndPrompts

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerChannelBarAndPrompts.WBP_PlayerChannelBarAndPrompts_C
// 0x0498 (0x0830 - 0x0398)
class UWBP_PlayerChannelBarAndPrompts_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PromptTextUpdate;                                  // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CameraModeUpdate;                                  // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CameraModeText;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GameplayPromptText;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ItemUseChannelBar;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        CurrentTargetConsumeFinishTime;                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartChannelEntityTimeMS;                          // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartedChannelBarUI;                               // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentEntityTimeMS;                               // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LastKnownModeWasCombat;                            // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     AnimPlayer;                                        // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         LastTipID;                                         // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HadCamoArmor;                                      // 0x03FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStoppedChannelBarUI;                              // 0x03FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FE[0x2];                                      // 0x03FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HeldItemName;                                      // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_StartItemChannel;                          // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_StopItemChannel;                           // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            RareBGBrush;                                       // 0x0420(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            EpicBGBrush;                                       // 0x04F0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            CommonBGBrush;                                     // 0x05C0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            LegendaryBGBush;                                   // 0x0690(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            EmptyBrush;                                        // 0x0760(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_PlayerChannelBarAndPrompts(int32 EntryPoint);
	void SetStartStopChannelAudioEvents(const class FString& HeldItemName_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TryPlayCamoArmorGameplayPrompt(bool HasCamoArmor);
	void TryPlayGameplayPrompt(int32 TipID);
	void TryStartChannelBar(double TargetConsumeFinishTime, double CurrentEntityTimeMS_0, bool* Channeling);
	void UpdateCameraModeText(bool CombatMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerChannelBarAndPrompts_C">();
	}
	static class UWBP_PlayerChannelBarAndPrompts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerChannelBarAndPrompts_C>();
	}
};
static_assert(alignof(UWBP_PlayerChannelBarAndPrompts_C) == 0x000010, "Wrong alignment on UWBP_PlayerChannelBarAndPrompts_C");
static_assert(sizeof(UWBP_PlayerChannelBarAndPrompts_C) == 0x000830, "Wrong size on UWBP_PlayerChannelBarAndPrompts_C");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, UberGraphFrame) == 0x000398, "Member 'UWBP_PlayerChannelBarAndPrompts_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, PromptTextUpdate) == 0x0003A0, "Member 'UWBP_PlayerChannelBarAndPrompts_C::PromptTextUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, CameraModeUpdate) == 0x0003A8, "Member 'UWBP_PlayerChannelBarAndPrompts_C::CameraModeUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, CameraModeText) == 0x0003B0, "Member 'UWBP_PlayerChannelBarAndPrompts_C::CameraModeText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, GameplayPromptText) == 0x0003B8, "Member 'UWBP_PlayerChannelBarAndPrompts_C::GameplayPromptText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, ItemUseChannelBar) == 0x0003C0, "Member 'UWBP_PlayerChannelBarAndPrompts_C::ItemUseChannelBar' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, CurrentTargetConsumeFinishTime) == 0x0003C8, "Member 'UWBP_PlayerChannelBarAndPrompts_C::CurrentTargetConsumeFinishTime' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, StartChannelEntityTimeMS) == 0x0003D0, "Member 'UWBP_PlayerChannelBarAndPrompts_C::StartChannelEntityTimeMS' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, StartedChannelBarUI) == 0x0003D8, "Member 'UWBP_PlayerChannelBarAndPrompts_C::StartedChannelBarUI' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, CurrentEntityTimeMS) == 0x0003E0, "Member 'UWBP_PlayerChannelBarAndPrompts_C::CurrentEntityTimeMS' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, LastKnownModeWasCombat) == 0x0003E8, "Member 'UWBP_PlayerChannelBarAndPrompts_C::LastKnownModeWasCombat' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, AnimPlayer) == 0x0003F0, "Member 'UWBP_PlayerChannelBarAndPrompts_C::AnimPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, LastTipID) == 0x0003F8, "Member 'UWBP_PlayerChannelBarAndPrompts_C::LastTipID' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, HadCamoArmor) == 0x0003FC, "Member 'UWBP_PlayerChannelBarAndPrompts_C::HadCamoArmor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, bStoppedChannelBarUI) == 0x0003FD, "Member 'UWBP_PlayerChannelBarAndPrompts_C::bStoppedChannelBarUI' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, HeldItemName) == 0x000400, "Member 'UWBP_PlayerChannelBarAndPrompts_C::HeldItemName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, AkEvent_StartItemChannel) == 0x000410, "Member 'UWBP_PlayerChannelBarAndPrompts_C::AkEvent_StartItemChannel' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, AkEvent_StopItemChannel) == 0x000418, "Member 'UWBP_PlayerChannelBarAndPrompts_C::AkEvent_StopItemChannel' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, RareBGBrush) == 0x000420, "Member 'UWBP_PlayerChannelBarAndPrompts_C::RareBGBrush' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, EpicBGBrush) == 0x0004F0, "Member 'UWBP_PlayerChannelBarAndPrompts_C::EpicBGBrush' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, CommonBGBrush) == 0x0005C0, "Member 'UWBP_PlayerChannelBarAndPrompts_C::CommonBGBrush' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, LegendaryBGBush) == 0x000690, "Member 'UWBP_PlayerChannelBarAndPrompts_C::LegendaryBGBush' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerChannelBarAndPrompts_C, EmptyBrush) == 0x000760, "Member 'UWBP_PlayerChannelBarAndPrompts_C::EmptyBrush' has a wrong offset!");

}

