#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_OptionTypeBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OdyUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_OptionTypeBase.WBP_Settings_OptionTypeBase_C
// 0x0068 (0x0400 - 0x0398)
class UWBP_Settings_OptionTypeBase_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               Root_SizeBox;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxOption;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleBackground;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TypeBackground;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             TypeSlot;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title_Text;                                        // 0x03D0(0x0010)(Edit, BlueprintVisible)
	bool                                          DebugIsSelected;                                   // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                OptionPadding;                                     // 0x03E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HasWidthOverride;                                  // 0x03F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WidthOverride;                                     // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Settings_OptionTypeBase(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetTitle(const class FText& TitleText_0);
	void SetVisual(bool IsSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_OptionTypeBase_C">();
	}
	static class UWBP_Settings_OptionTypeBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_OptionTypeBase_C>();
	}
};
static_assert(alignof(UWBP_Settings_OptionTypeBase_C) == 0x000008, "Wrong alignment on UWBP_Settings_OptionTypeBase_C");
static_assert(sizeof(UWBP_Settings_OptionTypeBase_C) == 0x000400, "Wrong size on UWBP_Settings_OptionTypeBase_C");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, UberGraphFrame) == 0x000398, "Member 'UWBP_Settings_OptionTypeBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, Root_SizeBox) == 0x0003A0, "Member 'UWBP_Settings_OptionTypeBase_C::Root_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, SizeBoxOption) == 0x0003A8, "Member 'UWBP_Settings_OptionTypeBase_C::SizeBoxOption' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, TitleBackground) == 0x0003B0, "Member 'UWBP_Settings_OptionTypeBase_C::TitleBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, TitleText) == 0x0003B8, "Member 'UWBP_Settings_OptionTypeBase_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, TypeBackground) == 0x0003C0, "Member 'UWBP_Settings_OptionTypeBase_C::TypeBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, TypeSlot) == 0x0003C8, "Member 'UWBP_Settings_OptionTypeBase_C::TypeSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, Title_Text) == 0x0003D0, "Member 'UWBP_Settings_OptionTypeBase_C::Title_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, DebugIsSelected) == 0x0003E0, "Member 'UWBP_Settings_OptionTypeBase_C::DebugIsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, OptionPadding) == 0x0003E4, "Member 'UWBP_Settings_OptionTypeBase_C::OptionPadding' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, HasWidthOverride) == 0x0003F4, "Member 'UWBP_Settings_OptionTypeBase_C::HasWidthOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTypeBase_C, WidthOverride) == 0x0003F8, "Member 'UWBP_Settings_OptionTypeBase_C::WidthOverride' has a wrong offset!");

}

