#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_SocialListBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OdyUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_SocialListBase.WBP_MainMenu_SocialListBase_C
// 0x0158 (0x04F0 - 0x0398)
class UWBP_MainMenu_SocialListBase_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Arrow;                                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HeaderForCategory_C*               HeaderSocial;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ListSlot;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Show_Header;                                       // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HeaderText;                                        // 0x03D8(0x0010)(Edit, BlueprintVisible)
	struct FLinearColor                           HeaderTextColor;                                   // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         TextFont;                                          // 0x03F8(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FMargin                                HeaderTextPadding;                                 // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Bottom_Rotate;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Bottom_Offset;                                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Left_Rotate;                                       // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Left_Offset;                                       // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Right_Rotate;                                      // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Right_Offset;                                      // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Top_Rotate;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Top_Offset;                                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HeaderBGColor;                                     // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeaderFormPaddingLeft;                             // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeaderFormPaddingRight;                            // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width;                                             // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x04C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_BG;                                            // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color_BG;                                          // 0x04CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Details;                                     // 0x04DC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MainMenu_SocialListBase(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetVisual(const struct FLinearColor& ColorDetails, bool HasBG, const struct FLinearColor& ColorBG, bool ShowHeader, float Header_PaddingLeft, float Header_PaddingRight, float Width_0, float Height_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_SocialListBase_C">();
	}
	static class UWBP_MainMenu_SocialListBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_SocialListBase_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_SocialListBase_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_SocialListBase_C");
static_assert(sizeof(UWBP_MainMenu_SocialListBase_C) == 0x0004F0, "Wrong size on UWBP_MainMenu_SocialListBase_C");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, UberGraphFrame) == 0x000398, "Member 'UWBP_MainMenu_SocialListBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Arrow) == 0x0003A0, "Member 'UWBP_MainMenu_SocialListBase_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Background) == 0x0003A8, "Member 'UWBP_MainMenu_SocialListBase_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Border) == 0x0003B0, "Member 'UWBP_MainMenu_SocialListBase_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, HeaderSocial) == 0x0003B8, "Member 'UWBP_MainMenu_SocialListBase_C::HeaderSocial' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, ListSlot) == 0x0003C0, "Member 'UWBP_MainMenu_SocialListBase_C::ListSlot' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, SizeBox) == 0x0003C8, "Member 'UWBP_MainMenu_SocialListBase_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Show_Header) == 0x0003D0, "Member 'UWBP_MainMenu_SocialListBase_C::Show_Header' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, HeaderText) == 0x0003D8, "Member 'UWBP_MainMenu_SocialListBase_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, HeaderTextColor) == 0x0003E8, "Member 'UWBP_MainMenu_SocialListBase_C::HeaderTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, TextFont) == 0x0003F8, "Member 'UWBP_MainMenu_SocialListBase_C::TextFont' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, HeaderTextPadding) == 0x000458, "Member 'UWBP_MainMenu_SocialListBase_C::HeaderTextPadding' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Bottom_Rotate) == 0x000468, "Member 'UWBP_MainMenu_SocialListBase_C::Bottom_Rotate' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Bottom_Offset) == 0x000470, "Member 'UWBP_MainMenu_SocialListBase_C::Bottom_Offset' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Left_Rotate) == 0x000478, "Member 'UWBP_MainMenu_SocialListBase_C::Left_Rotate' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Left_Offset) == 0x000480, "Member 'UWBP_MainMenu_SocialListBase_C::Left_Offset' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Right_Rotate) == 0x000488, "Member 'UWBP_MainMenu_SocialListBase_C::Right_Rotate' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Right_Offset) == 0x000490, "Member 'UWBP_MainMenu_SocialListBase_C::Right_Offset' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Top_Rotate) == 0x000498, "Member 'UWBP_MainMenu_SocialListBase_C::Top_Rotate' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Top_Offset) == 0x0004A0, "Member 'UWBP_MainMenu_SocialListBase_C::Top_Offset' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, HeaderBGColor) == 0x0004A8, "Member 'UWBP_MainMenu_SocialListBase_C::HeaderBGColor' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, HeaderFormPaddingLeft) == 0x0004B8, "Member 'UWBP_MainMenu_SocialListBase_C::HeaderFormPaddingLeft' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, HeaderFormPaddingRight) == 0x0004BC, "Member 'UWBP_MainMenu_SocialListBase_C::HeaderFormPaddingRight' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Width) == 0x0004C0, "Member 'UWBP_MainMenu_SocialListBase_C::Width' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Height) == 0x0004C4, "Member 'UWBP_MainMenu_SocialListBase_C::Height' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Has_BG) == 0x0004C8, "Member 'UWBP_MainMenu_SocialListBase_C::Has_BG' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Color_BG) == 0x0004CC, "Member 'UWBP_MainMenu_SocialListBase_C::Color_BG' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_SocialListBase_C, Color_Details) == 0x0004DC, "Member 'UWBP_MainMenu_SocialListBase_C::Color_Details' has a wrong offset!");

}

