#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerMatchSummary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OdyUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerMatchSummary.WBP_PlayerMatchSummary_C
// 0x0110 (0x04A8 - 0x0398)
class UWBP_PlayerMatchSummary_C final : public UOdyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOdyTextBlock*                          AmountHealedValue;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOdyTextBlock*                          DamageDealtValue;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOdyTextBlock*                          KOValue;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOdyTextBlock*                          PlayerName;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerPortrait;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOdyTextBlock*                          RevivesValue;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatContainer1;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatContainer2;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatContainer3;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatContainer4;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatContainerTint1;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatContainerTint2;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatContainerTint3;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatContainerTint4;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatTipColor1;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatTipColor2;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatTipColor3;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatTipColor4;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TeamBorderColor;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           StatContainerDefaultColor;                         // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           StatTipDefaultColor;                               // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            StatValueDefaultColor;                             // 0x0458(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           StatContainerTintColor;                            // 0x046C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            Local_Player_Text_Color;                           // 0x047C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           Local_Player_Stat_Container_Color;                 // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StatContainerTintOpacity;                          // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void ExecuteUbergraph_WBP_PlayerMatchSummary(int32 EntryPoint);
	void IsLocalPlayer();
	void IsWinnerColorChange(bool IsWinner);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void UnbindData(class UOdyUIData* OldUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerMatchSummary_C">();
	}
	static class UWBP_PlayerMatchSummary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerMatchSummary_C>();
	}
};
static_assert(alignof(UWBP_PlayerMatchSummary_C) == 0x000008, "Wrong alignment on UWBP_PlayerMatchSummary_C");
static_assert(sizeof(UWBP_PlayerMatchSummary_C) == 0x0004A8, "Wrong size on UWBP_PlayerMatchSummary_C");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, UberGraphFrame) == 0x000398, "Member 'UWBP_PlayerMatchSummary_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, AmountHealedValue) == 0x0003A0, "Member 'UWBP_PlayerMatchSummary_C::AmountHealedValue' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, DamageDealtValue) == 0x0003A8, "Member 'UWBP_PlayerMatchSummary_C::DamageDealtValue' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, KOValue) == 0x0003B0, "Member 'UWBP_PlayerMatchSummary_C::KOValue' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, PlayerName) == 0x0003B8, "Member 'UWBP_PlayerMatchSummary_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, PlayerPortrait) == 0x0003C0, "Member 'UWBP_PlayerMatchSummary_C::PlayerPortrait' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, RevivesValue) == 0x0003C8, "Member 'UWBP_PlayerMatchSummary_C::RevivesValue' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainer1) == 0x0003D0, "Member 'UWBP_PlayerMatchSummary_C::StatContainer1' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainer2) == 0x0003D8, "Member 'UWBP_PlayerMatchSummary_C::StatContainer2' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainer3) == 0x0003E0, "Member 'UWBP_PlayerMatchSummary_C::StatContainer3' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainer4) == 0x0003E8, "Member 'UWBP_PlayerMatchSummary_C::StatContainer4' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainerTint1) == 0x0003F0, "Member 'UWBP_PlayerMatchSummary_C::StatContainerTint1' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainerTint2) == 0x0003F8, "Member 'UWBP_PlayerMatchSummary_C::StatContainerTint2' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainerTint3) == 0x000400, "Member 'UWBP_PlayerMatchSummary_C::StatContainerTint3' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainerTint4) == 0x000408, "Member 'UWBP_PlayerMatchSummary_C::StatContainerTint4' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatTipColor1) == 0x000410, "Member 'UWBP_PlayerMatchSummary_C::StatTipColor1' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatTipColor2) == 0x000418, "Member 'UWBP_PlayerMatchSummary_C::StatTipColor2' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatTipColor3) == 0x000420, "Member 'UWBP_PlayerMatchSummary_C::StatTipColor3' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatTipColor4) == 0x000428, "Member 'UWBP_PlayerMatchSummary_C::StatTipColor4' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, TeamBorderColor) == 0x000430, "Member 'UWBP_PlayerMatchSummary_C::TeamBorderColor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainerDefaultColor) == 0x000438, "Member 'UWBP_PlayerMatchSummary_C::StatContainerDefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatTipDefaultColor) == 0x000448, "Member 'UWBP_PlayerMatchSummary_C::StatTipDefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatValueDefaultColor) == 0x000458, "Member 'UWBP_PlayerMatchSummary_C::StatValueDefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainerTintColor) == 0x00046C, "Member 'UWBP_PlayerMatchSummary_C::StatContainerTintColor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, Local_Player_Text_Color) == 0x00047C, "Member 'UWBP_PlayerMatchSummary_C::Local_Player_Text_Color' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, Local_Player_Stat_Container_Color) == 0x000490, "Member 'UWBP_PlayerMatchSummary_C::Local_Player_Stat_Container_Color' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerMatchSummary_C, StatContainerTintOpacity) == 0x0004A0, "Member 'UWBP_PlayerMatchSummary_C::StatContainerTintOpacity' has a wrong offset!");

}

