#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventorySlot_Prompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventorySlot_Prompt.WBP_InventorySlot_Prompt_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_InventorySlot_Prompt_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPrompt;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBinding_C*                    WBP_InputBinding;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PromptText;                                        // 0x0300(0x0010)(Edit, BlueprintVisible)
	struct FMargin                                PaddingPrompt;                                     // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTexture2D*                             Debugkeybind;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Input_Action;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InventorySlot_Prompt(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventorySlot_Prompt_C">();
	}
	static class UWBP_InventorySlot_Prompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventorySlot_Prompt_C>();
	}
};
static_assert(alignof(UWBP_InventorySlot_Prompt_C) == 0x000008, "Wrong alignment on UWBP_InventorySlot_Prompt_C");
static_assert(sizeof(UWBP_InventorySlot_Prompt_C) == 0x000330, "Wrong size on UWBP_InventorySlot_Prompt_C");
static_assert(offsetof(UWBP_InventorySlot_Prompt_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_InventorySlot_Prompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventorySlot_Prompt_C, HorizontalBox) == 0x0002E8, "Member 'UWBP_InventorySlot_Prompt_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_InventorySlot_Prompt_C, TextPrompt) == 0x0002F0, "Member 'UWBP_InventorySlot_Prompt_C::TextPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_InventorySlot_Prompt_C, WBP_InputBinding) == 0x0002F8, "Member 'UWBP_InventorySlot_Prompt_C::WBP_InputBinding' has a wrong offset!");
static_assert(offsetof(UWBP_InventorySlot_Prompt_C, PromptText) == 0x000300, "Member 'UWBP_InventorySlot_Prompt_C::PromptText' has a wrong offset!");
static_assert(offsetof(UWBP_InventorySlot_Prompt_C, PaddingPrompt) == 0x000310, "Member 'UWBP_InventorySlot_Prompt_C::PaddingPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_InventorySlot_Prompt_C, Debugkeybind) == 0x000320, "Member 'UWBP_InventorySlot_Prompt_C::Debugkeybind' has a wrong offset!");
static_assert(offsetof(UWBP_InventorySlot_Prompt_C, Input_Action) == 0x000328, "Member 'UWBP_InventorySlot_Prompt_C::Input_Action' has a wrong offset!");

}

