#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpawnCeremony

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Matcha_structs.hpp"
#include "OdyUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpawnCeremony.WBP_SpawnCeremony_C
// 0x0150 (0x0598 - 0x0448)
class UWBP_SpawnCeremony_C final : public UOdyMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_SpawnCeremony_HackTip_C*           HackTip_1;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnCeremony_HackTip_C*           HackTip_2;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnCeremony_HackTip_C*           HackTip_3;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnCeremony_HackTip_C*           HackTip_4;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HackTips;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_73;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_162;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerNameAndTeam_C*               PlayerNameAndTeam;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_2;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SpawnRegionsContainer;                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MatchTimer_C*                      Timer;                                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TipHack1;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TipHack2;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnRegionMap_C*                  WBP_SpawnRegionMap;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UMatchaPlayerUIData*>            AllPlayerUIData;                                   // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ESpawnRegion, class UWBP_SpawnRegion_Button_C*> RegionsListButtons;                                // 0x04E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         SelectionTimer;                                    // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TimerBaseColor;                                    // 0x0534(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TimerEndingColor;                                  // 0x0548(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         GetReadyTimer;                                     // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalPlayerSelectedRegionIndex;                    // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableInput;                                       // 0x0564(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchaMatchPhase                             CurrentMatchPhase;                                 // 0x0565(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_566[0x2];                                      // 0x0566(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESpawnRegion>                          SelectableRegions;                                 // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           FLASE;                                             // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TimerDefaultDecorativeColor;                       // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindData(class UOdyUIData* NewUIData);
	void ChangeSelectedRegion(int32 Index_0);
	void Construct();
	void ExecuteUbergraph_WBP_SpawnCeremony(int32 EntryPoint);
	void HandleMatchPhaseChanged(EMatchaMatchPhase OldPhase, EMatchaMatchPhase NewPhase);
	void InitializeSelectableSpawnRegions();
	void InpActEvt_Down_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Gamepad_DPad_Down_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_Gamepad_DPad_Up_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_S_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_Up_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_W_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void OnAvailableHacksChanged();
	void OnInitialized();
	void OnMatchPhaseChanged(int32 OldValue, int32 NewValue);
	void OnTimerUpdated(int32 OldValue, int32 NewValue);
	void OnUIDataSet(class UOdyUIData* NewUIData);
	void PlayerNameChanged(const class FText& OldValue, const class FText& NewValue);
	void PreConstruct(bool IsDesignTime);
	void SetTipHackText(const class FText& Text);
	void TeamNumberChanged(int32 OldValue, int32 NewValue);
	void Try_Select_Region_By_Index(int32 SelectedIndex);
	void UnbindData(class UOdyUIData* OldUIData);
	void Update_Available_Hack_Tips(class UMatchaGameWorldUIData* WorldUIData);
	void UpdatePlayerInfo();
	void UpdateTimer(int32 RemainingTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpawnCeremony_C">();
	}
	static class UWBP_SpawnCeremony_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpawnCeremony_C>();
	}
};
static_assert(alignof(UWBP_SpawnCeremony_C) == 0x000008, "Wrong alignment on UWBP_SpawnCeremony_C");
static_assert(sizeof(UWBP_SpawnCeremony_C) == 0x000598, "Wrong size on UWBP_SpawnCeremony_C");
static_assert(offsetof(UWBP_SpawnCeremony_C, UberGraphFrame) == 0x000448, "Member 'UWBP_SpawnCeremony_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, HackTip_1) == 0x000450, "Member 'UWBP_SpawnCeremony_C::HackTip_1' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, HackTip_2) == 0x000458, "Member 'UWBP_SpawnCeremony_C::HackTip_2' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, HackTip_3) == 0x000460, "Member 'UWBP_SpawnCeremony_C::HackTip_3' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, HackTip_4) == 0x000468, "Member 'UWBP_SpawnCeremony_C::HackTip_4' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, HackTips) == 0x000470, "Member 'UWBP_SpawnCeremony_C::HackTips' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, Image) == 0x000478, "Member 'UWBP_SpawnCeremony_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, Image_73) == 0x000480, "Member 'UWBP_SpawnCeremony_C::Image_73' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, Image_162) == 0x000488, "Member 'UWBP_SpawnCeremony_C::Image_162' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, PlayerNameAndTeam) == 0x000490, "Member 'UWBP_SpawnCeremony_C::PlayerNameAndTeam' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, RetainerBox_0) == 0x000498, "Member 'UWBP_SpawnCeremony_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, RetainerBox_2) == 0x0004A0, "Member 'UWBP_SpawnCeremony_C::RetainerBox_2' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, SpawnRegionsContainer) == 0x0004A8, "Member 'UWBP_SpawnCeremony_C::SpawnRegionsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, Timer) == 0x0004B0, "Member 'UWBP_SpawnCeremony_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, TipHack1) == 0x0004B8, "Member 'UWBP_SpawnCeremony_C::TipHack1' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, TipHack2) == 0x0004C0, "Member 'UWBP_SpawnCeremony_C::TipHack2' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, WBP_SpawnRegionMap) == 0x0004C8, "Member 'UWBP_SpawnCeremony_C::WBP_SpawnRegionMap' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, AllPlayerUIData) == 0x0004D0, "Member 'UWBP_SpawnCeremony_C::AllPlayerUIData' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, RegionsListButtons) == 0x0004E0, "Member 'UWBP_SpawnCeremony_C::RegionsListButtons' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, SelectionTimer) == 0x000530, "Member 'UWBP_SpawnCeremony_C::SelectionTimer' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, TimerBaseColor) == 0x000534, "Member 'UWBP_SpawnCeremony_C::TimerBaseColor' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, TimerEndingColor) == 0x000548, "Member 'UWBP_SpawnCeremony_C::TimerEndingColor' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, GetReadyTimer) == 0x00055C, "Member 'UWBP_SpawnCeremony_C::GetReadyTimer' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, LocalPlayerSelectedRegionIndex) == 0x000560, "Member 'UWBP_SpawnCeremony_C::LocalPlayerSelectedRegionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, EnableInput) == 0x000564, "Member 'UWBP_SpawnCeremony_C::EnableInput' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, CurrentMatchPhase) == 0x000565, "Member 'UWBP_SpawnCeremony_C::CurrentMatchPhase' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, SelectableRegions) == 0x000568, "Member 'UWBP_SpawnCeremony_C::SelectableRegions' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, FLASE) == 0x000578, "Member 'UWBP_SpawnCeremony_C::FLASE' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnCeremony_C, TimerDefaultDecorativeColor) == 0x000588, "Member 'UWBP_SpawnCeremony_C::TimerDefaultDecorativeColor' has a wrong offset!");

}

